# -*- coding: utf-8 -*-
"""
Created on Wed Jun  6 16:36:20 2018

@author: XAYQ-WangChenxi
"""

from __future__ import unicode_literals

#from flask_restful import reqparse,Api, Resource
from flask_restful import Api
from flask import Flask,request

#from flask import abort
#from flask import make_response,Response  
import json
#import tab
import time
#########test/product==========
import re
#####放在11.41库
import jieba
import os
import jieba.analyse
####导入排重包


test_content = '我是测试文章'
jieba.lcut(test_content.strip(), cut_all = False)

def abspath(filename):
    basedir = '/home/nlp/model'
    #basedir = 'E:/NLP/深圳局/NegInf'
    return os.path.join(basedir, filename)

print ('IFFile is loading ......')
from sklearn.externals import joblib
IFclf = joblib.load(abspath("IF/model.m"))
IFvec = joblib.load(abspath("IF/vec.m"))
IFtransformer = joblib.load(abspath("IF/tfidf.m"))
IFch2 = joblib.load(abspath("IF/ch2.m"))
print ('IFFile loading successful')

adclf = joblib.load(abspath("admin/model.m"))
advec = joblib.load(abspath("admin/vec.m"))
adtransformer = joblib.load(abspath("admin/tfidf.m"))
adch2 = joblib.load(abspath("admin/ch2.m"))
print ('admin File loading successful')

asclf = joblib.load(abspath("assure/model.m"))
asvec = joblib.load(abspath("assure/vec.m"))
astransformer = joblib.load(abspath("assure/tfidf.m"))
asch2 = joblib.load(abspath("assure/ch2.m"))
print ('assure File loading successful')

creclf = joblib.load(abspath("credit/model.m"))
crevec = joblib.load(abspath("credit/vec.m"))
cretransformer = joblib.load(abspath("credit/tfidf.m"))
crech2 = joblib.load(abspath("credit/ch2.m"))
print ('credit File loading successful')

finclf = joblib.load(abspath("finance/model.m"))
finvec = joblib.load(abspath("finance/vec.m"))
fintransformer = joblib.load(abspath("finance/tfidf.m"))
finch2 = joblib.load(abspath("finance/ch2.m"))
print ('finance File loading successful')

manclf = joblib.load(abspath("manage/model.m"))
manvec = joblib.load(abspath("manage/vec.m"))
mantransformer = joblib.load(abspath("manage/tfidf.m"))
manch2 = joblib.load(abspath("manage/ch2.m"))
print ('manage File loading successful')

marclf = joblib.load(abspath("market/model.m"))
marvec = joblib.load(abspath("market/vec.m"))
martransformer = joblib.load(abspath("market/tfidf.m"))
march2 = joblib.load(abspath("market/ch2.m"))
print ('market File loading successful')

proclf = joblib.load(abspath("product/model.m"))
provec = joblib.load(abspath("product/vec.m"))
protransformer = joblib.load(abspath("product/tfidf.m"))
proch2 = joblib.load(abspath("product/ch2.m"))
print ('product File loading successful')

projclf = joblib.load(abspath("project/model.m"))
projvec = joblib.load(abspath("project/vec.m"))
projtransformer = joblib.load(abspath("project/tfidf.m"))
projch2 = joblib.load(abspath("project/ch2.m"))
print ('project File loading successful')

regclf = joblib.load(abspath("regulate/model.m"))
regvec = joblib.load(abspath("regulate/vec.m"))
regtransformer = joblib.load(abspath("regulate/tfidf.m"))
regch2 = joblib.load(abspath("regulate/ch2.m"))
print ('regulate File loading successful')

unfclf = joblib.load(abspath("unforce/model.m"))
unfvec = joblib.load(abspath("unforce/vec.m"))
unftransformer = joblib.load(abspath("unforce/tfidf.m"))
unfch2 = joblib.load(abspath("unforce/ch2.m"))
print ('unforce File loading successful')

othclf = joblib.load(abspath("other/model.m"))
othvec = joblib.load(abspath("other/vec.m"))
othtransformer = joblib.load(abspath("other/tfidf.m"))
othch2 = joblib.load(abspath("other/ch2.m"))
print ('other File loading successful')

pnclf = joblib.load(abspath("posneg/model.m"))
pnvec = joblib.load(abspath("posneg/vec.m"))
pntransformer = joblib.load(abspath("posneg/tfidf.m"))
pnch2 = joblib.load(abspath("posneg/ch2.m"))
print ('posorneg File loading successful')

oneclf = joblib.load(abspath("onesvm/model.m"))
onevec = joblib.load(abspath("onesvm/vec.m"))
onetransformer = joblib.load(abspath("onesvm/tfidf.m"))
print ('onesvm File loading successful')

print ('IFkeyword is loading ......')
keywords = "P2P|p2p|比特币|余额宝|融租租赁|支付机构|支付宝|数字货币|保险.*互联网|加密货币|愉悦资本.*平台\
|虚拟货币|科技金融|金融科技|点牛金融|普惠金融|互金|现金贷|区块链"
print ('IFkeyword loading successful')

###加载负面词库
neg1 = '减持|预亏|负债率高|风险加剧|重组风险|遭质疑|戴帽风险|大股东套现|关联交易|业绩存疑|重组中止|夸大宣传|质量门|罗生门|服务不佳|再度减持|不达标|销售不力|生产过剩|挪用募资|评级下调|网友投诉|精准减持|客户投诉|拖欠贷款|价量齐跌|利润收窄|误导销售|资金压力|毛利减少|低价贱卖|滞销严重|前景看淡|烧钱|风险凸显|利益损失|巨额赔偿|罚款|主业更迭|伪高新|捆绑销售|数据打架|危及健康|投诉|陷入困境|存货大幅上升|品牌受重创|偷工减料|遭遇黑天鹅|入不敷出|矛盾升级|遭猜疑|遭猜忌|净利润预降|陷困境|卖家产|诚信危机|遭索赔|踩雷|存隐患|风险警示|责令整改|抽检不合格|黑榜|资金匮乏|资产不明|集体辞职|质检不合格|负增长|承诺不兑现|超标|信用黑榜|主业不明|原料不明|过保质期|取消资格|公信力降低|故意违约|质量堪忧|内鬼|画饼|假公济私|用脚投票|垃圾债|债务违约|前景难料|藏猫腻|现状堪忧|打白条|深陷泥沼|发展瓶颈|主业惨淡|前景黯淡|涉嫌隐瞒|三角债|不合格|市值缩水|研报抄袭|质量纠纷|管理硬伤|资质不佳|库存压力大|现金流紧张|违反财务承诺|资金链窘境|名誉侵权|市值蒸发|质量担忧|负重前行|股民控诉|主营歉收|舆论危机|商标纠纷|业绩变脸|管理混乱|囤货严重|责任缺失|订单缩水|大额抛售|销售下滑|年报有误|难掩亏损|扩股圈钱|缺乏核心竞争产品|多重资金压力|中报大注水|产品缺陷|销量差|矛盾加剧|投资超限|业务低迷|跌幅首位|债台高筑|贷款叫停|频频减持|项目停摆|被踢出|高溢价并购|业绩踩雷|戴帽|重组告吹|夭折|做局|遭严打|被诱骗|收购泡汤|误导客户|整改不达标|募投项目存疑|保壳战|业绩下滑|变卖资产|逆势扩张|募投项目缩水|索赔|夸大收益|摊上事了|收益暴跌|夸大推介|业绩承诺过高|被非标|市场质疑|不靠谱|遭拍卖|披星戴帽|存款失窃|躺枪|被揪出旧账|审查遭中止|疑窦重重|动机不纯|前景堪忧|看淡重组前景|混改折戟|挂牌遇冷|遭遇人事动荡|帮凶|项目进展迟缓|疑存风险|盈转亏|悬念丛生|摊事|数据掐架|泡汤|被篡改|项目前景不明|存货激增|销量下滑|业绩三连降|业绩虚胖|逐年萎缩|大变脸|减持套现|主动退市|被终止|遭终止|动机遭质疑|局中局|陷提价怪圈|流标|奇葩|疯狂出逃|账面浮亏|亏损泥潭|担保能力存疑|负债额畸形|费用游戏|玩财技|暗放利好|和解遭拒|澄而不清|研发能力存疑|圈钱发奖金|资金紧绷|拼爹门|拖累业绩|股价饱受质疑|股权存变数|信任危机|迷局待破|溢价收购|库存高企|价格垄断|质量投诉|败家|销售停滞|缺少资金|折价甩卖|质量不过关|资金链存忧|风险犹存|重组引质疑|限价难保|销售低迷|卖壳难成行|借壳梦碎|大幅减持|坑爹|保价成空|大额举债|资金困局|财务趋紧|收购亏损公司|募资被占用|负收益|冤大头|前景不明|业绩地雷|品牌短板|擦边球|重组艰难|扭亏无望|销量利润双跌|频繁换血|整合迷局|逆势跳水|资金周转困局|全年预亏|业绩受损|舆论质疑|净亏损|专家质疑|订单无下文|资质一般|评估定价有失公允|不实信息|遭围剿|大肆减持|大量套现|巨额套现|主业有硬伤|债务压顶|再度巨亏|体系混乱|管理问题|进展迟缓|借机套现|麻烦缠身|现金流失|打水漂|毛利率承压|业绩暴减|陷入迷途|遭遇质疑|借利好套现|疯狂减持|利润亏损|私卖|变相套现|被注销|存货畸高|亏空|项目被查|赌局|身陷困境|产能过剩|吸血鬼|遭逼问|仙股|客户单一|约谈|遭看空|花式借壳|行业危机|溢价|扭亏无期|终止增发|落空|存考验|大股东易位|折戟|前路漫漫|铩羽|不靠普|重组筹划终止|梦魇|恶意抛售|无实际控制人|玩文字游戏|遭吐槽|偿付存疑|ST危机|遭爆炒|不乐观|垫底|业绩加速滑坡|遭遇乌龙|投机炒作|埋下隐患|毛利偏低|利润遭威胁|权宜之计|生变|后院起火|豪赌|被指风险高|砸招牌|遭狙击|酿大祸|业务下滑|停牌前躁动|未落地|增收不增利|依赖大客户|鸡肋|遭拖累|添变数|存变数|脸上贴金|无法对付|噱头|改革迷雾|可持续性存疑|巧合介入|蹊跷|黑色产业链条|漏洞|无改良迹象|挫折|束缚|争锋相对|风口浪尖|屡教不改|心太狠|业绩滑坡|滑铁卢|负面|业绩短板|颓势难扭|套利悬疑|增发毒丸|搅局|暗斗|出尔反尔|妖气缠身|意外泡汤|喊冤|断臂上市|遭诟病|回应迟到|窃听风云|遭浮亏|回扣|疑团|股权转让落空|搭车之嫌|捧杀|陨落|战略不明|遇寒流|逃责|乌龙单|再遭冷眼|铤而走险|转型噩梦|添堵|见光死|陷入烦恼|表态太含糊|生死劫|闹剧|掩护减持|连环套|猫腻|拖欠|遭泄露|难挽颓势|临阵脱逃|推掉责任|赔本甩卖|风波未息|毒饵|真真假假|是是非非|扩张失败|债务游戏|业绩未达标|净利速滑|下调亏损额|内外交困|改错王|放卫星|土豪式送转|陷阱|多事之秋|经营不善|遭声讨|募投诡象|准点减持|研发费用疑云|危机四伏|争议不断|铁公鸡|踩点减持|陷困局|偿付危机|灰色地带|濒临绝境|增资迷局|摊上大事|卖子还债|严重依赖|蹊跷收购|暗藏风险|暗藏陷阱|暗藏猫腻|暗藏隐患|暗藏地雷|恐生变|通报批评|穷途末路|转型失败|卖身还债|三宗罪|内斗升级|股东翻脸|陷十面埋伏|离职潮|不合作声明|股权之争|追咬|引狼入室|突围不易|贱卖|地下硕鼠|被推进危局|薪酬成谜|股东掐架|资格被撤|资产存硬伤|宫斗剧|影响经营|业绩受考验|闹剧重组|难逃卖壳|神秘重组|惹争议|同室操戈|保壳前景堪忧|重组谜团|定增堵单|商标被卖|遭嘲讽|迷雾重重|存货难销|补贴依赖症|败走|保壳失败|扑朔迷离|画饼充饥|高层地震|整合失败|业绩难达标|预谋|问题严重|打太极|闯关失败|资产不符条件|走向成谜|引资本市场围观|互黑|嘴仗|小辫子|狐狸尾巴|诸多疑点|自查不能服众|踢皮球|人祸|陷入泥潭|严重亏损|老油条|新瓶装旧酒|骗局|家丑|固步自封|生死边缘|怠工|转型之困|降级|遭否决|主业单一|软肋|变天|藏忧|资不抵债|损失惨重|延期|拖延|业绩梦魇|杀鸡取卵|损失巨大|自相矛盾|前景蒙尘|三缄其口|钻空子|来源不明|经营欠佳|转型遇阻|引监管关注|重组闹剧|转型阵痛|报忧|收效甚微|架空|悬案|产生分歧|分歧加剧|存在分歧|分歧严重|命悬一线|折翅|自揭家丑|风光不再|债市风暴|引不满|前途未卜|踩线|踩红线|被逾期|麻烦公司|一股独大|资金紧张|一蹶不振|争议|翻旧账|遭封杀|开倒车|断臂求生|被否|遭扣押|酿苦果|起波澜|缺乏人气|变脸王|敷衍|为钱所困|黄粱一梦|业务不振|内控之忧|不被看好|急速下滑|吃补助|多重压力|风险敞口大开|不务正业|区经营风险|说谎|难盈利|保壳渺茫|投资去向不明|面临风险|实力不济|财务窟窿|中报蒙尘|被拉黑|非理性|沉迷理财|业绩堪忧|承诺成泡影|不尽责|注资迷雾|遭淘汰|业务持续不振|内忧外患|困局凸显|订单地雷|陷绝境|致命鸦片|重组难遂愿|过度依赖|密集减持|糊涂账|业绩遭侵蚀|遭曝光|逃避责任|债务缠身|摆乌龙|遭消化不良|败笔|变相涨价|腰斩|业绩难堪|税制混乱|不完善|注水|挨批|挨罚|不属实|全军覆没|欲盖弥彰|被染过|业务集中|遭通报|疲态尽显|圈钱戏码|难扭亏损|遭市场冷眼|有疑点|不看好重组|市场低迷|超级权力|业务流产|扮靓业绩|经营危机|绯闻缠身|拖油瓶|藏隐忧|有水分|搞砸危机公关|资金瓶颈|恩仇录|步履维艰|出口下滑|风险重重|未尽责|公开谴责|空手套白狼|催肥业绩|陷僵局|胆气不足|愈演愈烈|遭发难|金玉其外败絮其中|计提风波|边缘化|累赘|玩失踪|青黄不接|拖下水|高管勾心斗角|众怒|虚增|失败|蒸发|举报|缠身|遇困局|陷入危机|陷入危局|甩卖|硬伤|泥潭|拖累利润|黑洞|恶意误导|漩涡|激进|难逃|谴责|告吹|惨遭|缺陷|遇阻|被判|争夺战|涉嫌炒作|危局|丑闻|沦为鸡肋|绊脚石|绝收|惨淡|受挫|掐架|屡遭|被爆料|夸大|利空|受罚|高估|洗黑钱|雪上加霜|不容乐观|失控|抄袭|频遭|过山车|瑕疵|苦果|屡次|恶意|纷争|重挫|瞒报|围攻|吞噬|秘而不宣|血本无归|骗取|埋雷|参假|黯淡|跳水|反遭|生疑|抹黑|带伤|疑窦|弊端|错失|遭到举报|悲剧|潜藏|沦陷|不买账|损害|信披不实|遥遥无期|噩梦|大肆侵吞|大肆敛财|老赖|受贿罪|未达标|侵蚀|劣迹|口水仗|弃壳|难见效|炮轰|开喷|骂战|卷款门|屡禁不止|清仓式|高位套现|厮杀|讲故事|猜谜期|堪忧|蚕食|昙花一现|乱账|掣肘|高管迷信|作秀|暗战|闹翻|扯皮|业绩异常|遮遮掩掩|闪辞|钱荒|拒解释|隐瞒|难解渴|钉子户|偷龙转凤|举步维艰|股价蹦极|李鬼|惹众怒|乌龙|虚胖|受困|颓势|依赖综合征|名不副实|催命符|坏孩子|带病申购|走弯路|冰点|命途多舛|枯木难逢春|不着调|借款风波|成本飙升|扩张乏力|鬼画符|溃败|疑点难消|资金闲置|崩盘|元气未复|余悸尚存|不符程序|泄密门|决策错误|主业模糊|暂停审核|卸磨杀驴|风控漏洞|收购乱象|残局|对呛|拒绝和解|祸不单行|遭砸盘|过度融资|隐性超募|除权门|遭炮轰|诱导|遭遇麻烦|自不量力|难辞其咎|折价命运|有待商榷|踢场|败家子|致命伤|大跃进|成败难料|自揭伤疤|难脱干系|潜规则|爆炸|被收编|变相提价|离奇暴跌|砸盘|偏安一隅|担保门|涉事|集体沦陷|借款式重组|定时炸弹|过度乐观|技术瓶颈|水土不服|陷尴尬|联手坐庄|存瑕疵|险棋|毒丸|东窗事发|作弊|抹黑门|致癌|最差市值管理|衰败|麻烦不断|事故频发|傍大款|被举报|浮亏|遭唏嘘|变数难测|圈钱还债|相背离|捆绑协议|违规王|被弃门|前景叵测|烫手山芋|高产低效|孤注一掷|学历造假|臭鱼烂虾|主业不振|拦路虎|举债度日|被打脸|疑窦丛生|良心何在|变相欺骗|大出血|马甲账户|暗门|贱卖公司|拒不接收|空架子|存货余额大|遭看衰|亦官亦商|绑架|差强人意|看走眼|非议|不配合|打人|反目|遭罢免|沦为笑柄|太保守|偏向虎山行|复苏无望|扯皮战|装穷|消化不良|没落|战略阵痛|不翼而飞|被强平|令人发指|拖垮|胎死腹中|盛转衰|亏损严重|涉嫌操纵|中枪|迟报|定增受阻|躲猫猫|差钱|流拍|乌龙球|硬碰硬|有玄机|爽约|变脸|被卷入|带病|走钢丝|疑为|频发|疑似|变相借壳|变相违规|乱象|受损|虚构|协商无果|独大|受累|受波及|隐现|动荡不安|悬疑|协商未果|牵涉|牵出|抛弃|遇冷|深陷|谜团|诡异|供应过剩|忽悠|腾挪|滑坡|魔咒|管理缺失|窘境|掩盖事实|发展无望|甩包袱|寄生|发展阻碍|谎言|萎缩|濒临|顽疾|无视|沉浮|强行退市|抛锚|兴衰|涨薪门|不满|计划搁浅|搭错车|取款机|无厘头|多病缠身|殃及|缩水|被迫转型|洗大澡|萎靡不振|不死鸟|一落千丈|诟病|资格被撤销|债务困局|甩卖资产|内外勾结|吃里扒外|绩差生|蒙阴影|被打入冷宫|身陷囹圄|隐性交易|暗箱操作|铩羽而归|预亏王|颗粒无收|徐翔概念股|侵占|资本玩偶|疯狂并购|僵尸股|换汤不换药|利益输送|东床事发|黑庄|遭冻股|钻漏洞|资金玩偶|乱象丛生|扭亏乏术|惹麻烦|乌龙利好|管控薄弱|暗箱易主|转型停滞|承若泡汤|毒丸计划|江河日下|定增生变|作茧自缚|后院失火|负债累累|蒙上阴影|估值存疑|资金链吃紧|信披遗漏|风投出逃|扩张受挫|遭闷杀|诚意不足|恶意收购|失职嫌疑|涉嫌歧视|腹背受敌|破坏财物|举报丑闻|问题年报|增发迷雾|业绩不佳|拒不披露|业绩困局|借款逾期|警戒线|弥天大谎|趁火打劫|重组规模缩水|变数丛生|被套|忽悠式重组|画饼式重组|股价遭腰斩|实控人爽约|债务问题|存在不确定性|账户被查封|帐户被冻结|保壳危机|失信榜|项目烂尾|陷质押危局|举报门|陷亏损泥淖|重仓被套|陷多事之秋|股价异动|非阳光操作|遭爆料|灰色资金|灰色套利|灰色交易|囤地生财|投资者不满|学术造假|奇葩研报|停产门|停工风波|内控不完善|内控不健全|业绩惨淡|风波不断|自营巨亏|露马脚|草率|交易乱象|遭截胡|偷鸡不成蚀把米|定增破发|未予公告|提案被否|窗口期交易|数据涉假|经营难题|主业疲软|巨额减持|倒戈|陷多方博弈|被夺表决权|业绩退步|赔了夫人又折兵|乱象重生|遭撤销|陷纠纷|强制退市|盈利堪忧|定增方案被否|定增方案遭否|定增夭折|重组项目存变数|陷退市危机|被指掺假|涉嫌垄断|定增流产|屡遭处罚|违规占款|忽悠监管|遭巨额罚款|资本阴谋|机构大逃亡|敏感期买入|高负债|亏损|质量太次|利润腰斩|无证销售|净利下滑|销量同比大降|竞争力不足|存隐忧|业绩不达标|方案被否|重组遇冷|激进扩张|资金告急|陷舆论漩涡|主业陷困局|业绩失诺|标的资产披露不详|版权费纠纷|股东减持|年报数据打架|承诺未兑现|财务异常|年报疑团|应收账款存隐患|产品不合格|业绩巨降|净利润下滑|深交所追问|纠纷案|被疑圈钱|承诺或成空|转型落空|盈利模式模糊|数据存较大差异|被监管|负债率骤升|业绩承诺或难实现|业绩“急刹车”|重组方案流产|年报疑点多多|靠政府补助度日|被出具风险提示|负债高企|占用公司资金|逾期贷款难收|重大事项遭否|承诺难兑现|皮包公司|陷业绩泥潭|营收下滑|利润大幅下降|面临暂停交易风险|粉饰业绩|资金链承压|被中小股东否决|投资者质疑|盈利引质疑|业绩预告“失准”|净利润下降|资质存疑|痛骂|对峙|造谣|功败垂成|土崩瓦解|硝烟弥漫|起伏不定|惹祸上身|各自为战|嘲笑|徇私|输血|痛斥|暴露出|歧视|做手脚|若隐若现|假劣|损人利己|赔不起|噤若寒蝉|卷进|成也萧何|骚动|煤气中毒|假冒|超期|背负着|除名|犹抱琵琶半遮面|风声鹤唳|骗到|不痛不痒|卸包袱|何去何从|白热化|疏于|抢夺|驳回|鸟尽弓藏|越权|裁定|掩饰|指责|恐慌|事出有因|入侵|报复|避讳|毁约|贴金|缴获|惨不忍睹|可乘之机|制造舆论|扣罚|折磨|祸及|付之东流|此消彼长|逼到|搁浅|冷落|聚敛钱财|严峻形势|整肃|不良行为|诸多困难|摸不清|掠夺|销声匿迹|大肠杆菌超标|阻碍|言而无信|胡作非为|下降|举债|挽救|致癌性|轻视|触雷|停产|护短|肆无忌惮|无功而返|始料未及|陷入|衰落|无可奉告|惨跌|胆大妄为|约谈公司|停滞|传唤|私设|失察|歪曲|掏空|掩耳盗铃|寄生性|削减|违约案|杜撰|只字未提|暂缓|逆势下跌|实属无奈|不诚实|吹嘘|惩治|连累|赊账|蒙骗|密谋|鏖战|枯竭|受损方|欠债|不满情绪|隔靴搔痒|欺负|集权|停业|踩到|安于现状|掩藏着|引人深思|不良现象|浸染|可窥一斑|洗牌|诬陷|伙同|小题大做|串通|争斗|严阵以待|措手不及|议论纷纷|不正之风|自然灾害|融资难|比比皆是|逃过一劫|激怒|跌宕起伏|泛滥成灾|风雨飘摇|洗劫|赔款|失守|多头管理|露馅|失宠|失实|相悖|饱受|空头支票|遭殃|弃权|假借|蹉跎|徘徊不前|多灾多难|失密|责无旁贷|逼债|名存实亡|威慑|泄密|督办|不无关系|捉襟见肘|虚报|倾倒|污染|塌陷|功能障碍|心有余悸|贬低|高不成低不就|不义之财|吃老本|负担沉重|以次充好|吃回扣|大打折扣|恶意软件|怒斥|撂挑子|不负责任|拿回扣|漏电|迷失|有悖于|倒闭|浑水摸鱼|企图|不为人知|哄抢|阵痛|熟视无睹|悔之晚矣|反悔|尴尬|僧多粥少|过从甚密|紧随其后|于法无据|畏首畏尾|熔断|难以确定|眼花缭乱|蔑视|亏掉|诸多矛盾|攀比|处罚|陷于|负债|威胁|紧缩|自毁|赊欠|无法无天|骗人|瞒天过海|断章取义|挑衅|胁迫|被骗|脱节|敲警钟|急流勇退|不良影响|倒卖|控告|岌岌可危|破坏|触犯|万劫不复|荒废|屡见不鲜|忍无可忍|焦头烂额|孤家寡人|无关痛痒|苛责|不予置评|拒不承认|有毒|取缔|猜疑|抛售|曝光|营私舞弊|贻误|每况愈下|拆借|跌穿|害死|抵制|稍纵即逝|歪门邪道|垂涎|互不相让|一败涂地|拒付|污蔑|短缺|引起轰动|掺入|供大于求|挤掉|争执|摒弃|诘问|散布|瘫痪|注销|搏杀|呼风唤雨|存疑|藏污纳垢|店大欺客|吹牛|赔本赚吆喝|怠慢|套取|流年不利|拒不履行|倍受|缉捕|迫不及待|徒劳|忌讳|无所作为|篡改|无理取闹|捆绑|瞎了眼|居高不下|休克|抨击|缺斤短两|闹鬼|冻结|节外生枝|不良反应|避而不答|自认倒霉|避实就虚|塌方式|产生误解|饥不择食|网络攻击|督促|刁难|无人问津|制假|带帽|推卸|止损线|折半|滥竽充数|羞辱|生锈|掩盖真相|模糊性|凹凸不平|病入膏肓|调侃|伤亡|含糊不清|跌破|秋后算账|催缴|缺斤少两|失真|判决|信用卡诈骗|破釜沉舟|剑拔弩张|优胜劣汰|一筹莫展|见怪不怪|缺少|跳楼自杀|出人意料|群众反映|不制冷|抵债|奢侈浪费|坏账准备|造假|初犯|风云突变|四面楚歌|据为己有|轩然大波|难言之隐|抛出|越来越低|胡来|受害|历历在目|戛然而止|心存侥幸|治标不治本|不确定性|无形压力|醉翁之意不在酒|一去不返|另谋出路|泄露|分崩离滥用|逃不出|死而不僵|歉收|杜绝|偷梁换柱|讨说法|冲昏头脑|视若无睹|本末倒置|金蝉脱壳|敢怒不敢言|挂羊头卖狗肉|驱使|鞭长莫及|裂变|忧虑|烧坏|只字不提|惨淡经营|得逞|横行|起诉案|吓唬|无赖|二进宫|挣扎|背道而驰|咄咄怪事|杀招|不温不火|争议案|被盗|带来不利|裁员|卖不出去|毫不掩饰|捏造事实|被困|老冤家|趋之若鹜|掉队|矫枉过正|骑虎难下|滞销|一贯作风|不无遗憾|不相称|问题重重|清盘线|不良资产|告负|倒退|偏袒|对不上|千夫所指|吊销|警惕|众矢之|否决|蒙受|视而不见|出错|降价|闹着玩|侵害到|谈不拢|咬牙切齿|语焉不详|仿冒|罚没款|编织|言之凿凿|自杀|侵害|逃废债|两败俱伤|曲解|公诸于世|腥风血雨|假装|一穷二白|清仓|股抵债|恶化|歪风邪气|心灰意冷|强奸|悬而未决|殆尽|闯祸|诅咒|不利于|滥发|坑人|指控|违规案|欲罢不能|困窘|受骗|久拖未决|不堪重负|拆毁|阳奉阴违|不尽人意|混淆视听|不如人意|诱使|风光一时|机关算尽太聪明|抬价|抑制|墨守成规|强买强卖|大疗效|监守自盗|偷偷摸摸|搞不好|倒下|追偿|淡出|骑虎之势|逃过|出狱|缄默|崩塌|打砸|大相径庭|反驳|下泻|一意孤行|滞压|屡禁不绝|恐难|明目张胆|审查|坎坷路|玩弄|饥渴症|倚赖|暗含|召回|系统故障|传讯|逃逸|翻脸|凶多吉少|五花八门|染上|看不起|失去|不明朗|绳之以法|爆出|审核|舞弊|空谈|高悬|牟取暴利|僵化|逃避|售假|莫须有|闹心事|辱骂|大不如前|暗藏玄机|模棱两可|遮掩|告诫|匮乏|如坐针毡|控辩|滞后|一波三折|风风雨雨|责任事故|捏一把汗|摸爬滚打|仿造|食物中毒|吃不消|片面追求|着火|愚弄|下跌|跟不上|开炮|破损|揭短|窃密|瓦解|卡壳|防不胜防|披星戴月|停滞不前|令人担心|令人担忧|难避|反诉|逃脱|难上加难|不甚明朗|受到谴责|致命|遭受|怨声载道|沉沦|群死群伤|业主维权|声讨|动乱|不升反降|煽动|杯水车薪|得不偿失|难保|最低迷|揭露|赌钱|上当受骗|利欲熏心|伤害|炒作|认栽|被控|城门失火殃及池鱼|对赌|触目惊心|违规操作|冒进|血雨腥风|投机取巧|落败|僵持|舍本逐末|跌落|破罐子破摔|严禁|天网恢恢|撤职|过期|无起色|受制于人|恶劣影响|骤降|走投无路|灭顶之灾难以为继|毁损|谎称|使用不当|逃往|遭劫|明知故犯|背黑锅|一损俱损|大操大办|不良信息|引诱|遭到|职务侵占|冷嘲热讽|互诉|滑落|耍赖|贪图|谋私|嘲弄|功亏一篑|不予理睬|孤芳自赏|一跌再跌|杳无音讯|谣言惑众|依赖症|败露|堕落|刀光剑影\风起云涌|令人堪忧|逃废|野蛮|无人不知|扼腕|偷逃|牵制|坑害|势均力敌|发案|质问|火中取栗|妄图|敌视|误导|无动于衷|损公肥私|粉饰|颠倒黑白|朝三暮四|梦想破灭|无妄之灾|反其道而行之|查处|违章操作|失职|碌碌无为|苟延残喘|决裂|诱骗|低迷不振|骗钱|三令五申|唯利是图|株连|犯规|叫苦不迭|殴打|生不逢时|摧枯拉朽|剥削|一毛不拔|敷衍塞责|违背|见不得人|相撞|栽赃|一波未平一波又起|深恶痛绝|扣押|血洗|主观臆测|包庇|潜逃|不伦不类|暂扣|不利因素|失当|推来推去|知情不报|捕风捉影|拆除|沦落|作假|临危|延误|骤减|力不从心|歇业|触礁|意气用事|涉案|偷走|不能自拔|严惩不贷|遏制|大吃大喝|置之不理|没理由|戏谑|失序|无力回天|欺负人|拒不执行|失约|勾结|明枪暗箭|黯然失色|难以实现|遭证监局|远不如|不可为|走下坡路|强迫|公开批评|承受不住|志不在此|欠缺|躲避|失款|变速箱异响|横生枝节|大起大落|过于自信|受灾|掺杂使假|倒数|鼓吹|做空者|成为泡影|闹事|兴风作浪|踌躇不前|风马牛不相及|剽窃|烧毁|背弃|不止一次|过街老鼠|严厉打击|缩减|唇亡齿寒|烟消云散|盗取|名噪一时|坐视不理|挪用|本来面目|挖空心思|打伤|讹诈|恶劣行径|欺行霸市|盗卖|索债|不合逻辑|搞垮|严惩|有章不循|空中楼阁|以假充真|起疑|不怀好意|原油泄漏|停业整顿|满目疮痍|不领情|妨害|明文禁止|擅自决定|生活作风|颇为费解|透支|查扣|分道扬镳|大失所望|蒙在鼓里|养尊处优|减产|积重难返|捏造|浅尝辄止|匪夷所思|明争暗斗|自杀身亡|通不过|销毁|回击|黄牌警告|无所不用其极|耍流氓|天方夜谭|难逃法网|供过于求|无耻|勒令|沦为|无影无踪|缺乏|盗版|外泄|再降|处以|崩溃|不可告人|受潮|时间延迟|盘剥|责罚|下挫|欺骗|难以置信|无心|亵渎|拖后腿|发生意外|避而不见|当之无愧|碰壁|成瘾|受伤|削弱|东施效颦|一泻千里|重蹈覆辙|波动大|吹捧|染指|引爆|怀疑|硬着陆|严厉批评|栽跟头|受塑化剂|警告|自顾不暇|侮辱|担忧|喧嚣|通报|冒用|失之交臂|玩味|摸不着头脑|大肠杆菌|惩处|倒挂|减负|无中生有|蛮干|失衡|不理不睬|无利可图|窝里斗|衰退|拒之门外|出格|作祟|压垮|情绪化|违规|开展调查|死路一条|骇人听闻|忧心忡忡|杀一儆百|挤压|企业破产|暴露无遗|鱼死网破|拖累|扬言|牢狱之灾|免不了|我行我素|纠缠|说大话|敲诈|催促|冒名|别有用心|避重就轻|连锅端|陷害|毫无诚意|推拖|在劫难逃|摧毁|纠结|揭穿|受灾害|扼杀|损毁|避而不谈|阻挠|变质|爆料|折戟沉沙|当头棒喝|编造|蒙蔽|过河拆桥|操之过急|半停产|盗运|执法不严|肆意妄为|渎职|膨胀|谩骂|事不过三|令人气愤|剥夺|操纵|结党营私|降职|周转不灵|欺瞒|抱怨|形同虚设|纵容|混战|诱惑|出师不利|冷清|加重|倒买倒卖|强烈不满|制约|滚蛋|狂跌|偏离|形势严峻|羁押|拔苗助长|得罪|不强|恶化趋势|追捕|急于|人人自危|恶性事故|拖欠款项|争斗不休|贪官污吏|狂泻|蒙混过关|背离|上当|排污水|欠妥|获罚|挤兑|难以预测|闪烁其词|暗藏|自毁前程|燃眉之急|困难重重|扭曲|谈崩|罪魁祸首|不当得利|恶性循环|严重不足|欲哭无泪|顺手牵羊|严重损失|杀熟|悔恨|车身锈蚀|恶搞|专利案|巧立名目|下落不明|玩不转|拷问|排挤|赔偿损失|于事无补|冒充|自欺欺人|有恃无恐|抽紧|一团乱麻|忙中出错|不计后果|暴打|透水事故|劣质装修|甲醛超标|爆燃|中毒|面板爆裂|售后不保修|拒载|交通事故|沙门氏菌|挡位缺失|气囊隐患|自燃|轮胎鼓包|电池容量不足|漆面起泡|内排水处生锈|吃出蟑螂|用过期肉|过期食品|发霉|二氧化硫超标|霉变|长毛|镉超标|苯超标|吃出虫子|假奶粉|夸大疗效|盗刷|信用卡违规套现|转贷倒贷风|非法买卖银行卡|不良贷款增加|信用卡管理漏洞|飞单|贴息存款|恶意骗贷|快捷支付曝重大漏洞|存款失踪|洗钱|存款莫名消失|信用卡恶意透支|信用卡预授权漏洞|诽谤|不实之处|蓄谋|损坏|后劲不足|人浮于事|凶猛|赔本生意|矢口否认|归咎|逃不了|违反|唱反调|阴魂不散|关押|失势|犹存|离奇失踪|滋生|围堵|退保|割据|不惜成本|自相残杀|无能为力|错配|牵涉到|慌不择路|漏洞百出|折价|恼火|因小失大|时过境迁|窝藏|利诱|巧取豪夺|千疮百孔|深不见底|付出代价|土壤污染|冲突|含糊其辞|奈何|漏水|你死我活|失利|虎视眈眈|耸人听闻|一家独大|陈诉|戳穿|以罚代刑|漠视|践踏|锐减|惹恼|逾期|有失公允|破灭|痛失|脱离|失准|尾大不掉|批判|争权夺利|一拖再拖|隐瞒事实|扰动|逃跑|突袭|事与愿违|惩戒|不足之处|拉帮结派|有损于|漂洗|不为所动|谨小慎微|违犯|严查|涉嫌|凋零|揶揄|盗窃|闻风丧胆|不胫而走|引以为戒|认错|藐视|微不足道|甚嚣尘上|人心惶惶|站不住脚|污水排放|讽刺|虚夸|鱼龙混杂|勾兑|罢免|供认不讳|接受批评|苦不堪言|暴跌|忍气吞声|敲响|害苦|阉割|猜测|商标案|短斤少两|制裁|众说纷纭|错误操作|退赔|退赃|迫近|推诿|费尽心机|疑惑|有损|口诛笔伐|良莠不齐|操纵者|控诉|龟裂|涉嫌人|单打独斗|难兄难弟|退货|讳莫如深|脱离群众|剪不断理还乱|暗度陈仓|厚此薄彼|贪图便宜|践诺|陷落|裙带关系|逃不过|敷衍了事|失信|监禁|言行不一|有禁不止|无异于|沆瀣一气|瞒不住|下有对策|受到牵连|受制于|遇挫|行骗|铺天盖地|火上浇油|非一日之寒|猝死|盛极而衰|弄虚作假|堕入|抗议|苯泄漏|提出异议|斥责|不明真相|不得人心|置若罔闻|首当其冲|停职|偃旗息鼓|顾此失彼|搁置|掩人耳目|作罢|敲诈勒索|打压|惩罚|贬损|败落|撤诉|嘲讽|抽样检查|唆使|灰飞烟灭|呆坏账|釜底抽薪|众矢之的|高溢价|八竿子打不着|延宕|裹足不前|激化|强占|累犯|还债|勾兑门|糊弄|逆市扩张|脱不了|拘押|不可思议|山穷水尽|侵吞|排污|骚扰|日薄西山|寸步难行|烧伤|失踪|一厢情愿|不能偿还|转危为安|弹劾|对垒|鸡飞蛋打|掺杂|泄漏|非法活动|争执不下|避嫌|损害赔偿|克扣|不明不白|变卖|时运不济|撒谎|居心不良|以权谋私|华而不实|急功近利|拖欠工资|措施不力|搪塞|一无所知|倾家荡产|驳斥|讨债|政企不分|大跌|侵犯|拒不接受|进退维谷|枯死|夸大其词|葬送|褒贬不一|如履薄冰|蒙受损失|滋事|受创|冒顶|顾虑重重|底气不足|盗用|以假乱真|诋毁|觊觎|裹挟|九牛一毛|唇枪舌剑|过激|下坡路|进退两难|失误|反目成仇|另有隐情|狡辩|偷窃|失调|未能幸免|谎报|严肃查处|一纸空文|断档|各执一词|纯属捏造|挥霍|罚没|进行批评|日益严重|捉摸不透|免职|泄露信息|隐瞒行为|下滑跌幅|无法重组|同比下跌|被“吓”停牌|遭遇政策收紧|违约问题|遭拒赔|上市公司违反|调查波及|假跨界|净利润预减|披露不准|业绩预降|屡次失信市场|呛声|拖欠年终奖|开展深度自查|被市场禁入|陷入穷途|遭深交所监管|受投资者质疑|陷摘牌危机|降负面|遇毛利挑战|被搁置|遭新主“举牌”|深交所谴责|被转走|被操纵|利润减少|濒临“生死关头”|踩钢丝|遭媒体质疑|接关注函|遭转让公司或易主|被问询|前景未明|被指藏|遭剿|代表人失联|遇重挫|遭上海证监局处罚|产品违规|遭业主吐槽|战略受挫|未披露|再跌停|遭占款|连年下跌|同比“腰斩”|存蹊跷|下调年度预算|遭冻害损失|一切存疑|黑洞"|陷多元发展死循环|著作权迷局|涉嫌股价|追问合规性|遭证监会四点质疑|遭者冷遇|遭上交所问询|债务逾期|销量暴跌|被挤出|被动|致退市风险陡增|掩关联交易|上交所追问|业绩“大变脸”|致损失|受质疑|遇难关|炒作伤身|同比预减|不敢恭维|被小股东训斥|涉嫌违规停牌|再次下滑|遇瓶颈|盈利模式堪忧|被减持|存较大差异|业绩大变脸|违规占用|涉嫌造假|ipo中止|掩背后隐忧|盈利下降|被按“暂停”|国有资产流失|大额透支|涉选择性披露违规|保壳危情|公司受累|遭上交所严问|终止原因各异|仍然失联|披露违规|向证监会举报|涉嫌误导性陈述|重组又悬|引分歧|陷入资本迷阵|遭政策“嫌弃”|存虚高问题|遭集体违约|违规增持|圈钱|遭禁|披露不完善|超标排放|收益为负|立案调查|负面评级|净利润降低|涉欺诈|“惯性”下降|终止资产重组|断崖式下跌|曝调查|终止定增计划|被重点监控|被点名|乱象频出|涉洗黑钱|严重警告|遇危机|遭上交所发函关注|停牌核查|引深交所发函|有致癌风险|业绩持续下滑|长期低迷|被质押|严重违规|环保黑名单|责令改正|受拖累|连续下滑|陷入泥淖|披露不严谨|受自律监管措施|流向不明|遭遇平仓线|披露再触“红线”|遭证监局警示|被退市|又违规|两年下滑|遇“李鬼”|再次折戟|募债违约|隐瞒股权信息遭|已踩雷|不走心|被深交所出具|利润持续下滑|存退市风险|冻结股权|净利为负|遇“黑天鹅”|被强制|影响负面|持续盈利存疑|被否决|遭股转|持续发酵|销量不振|ipo失败|变相裁员|遭多方质疑|重组无望|被指粉|违规停牌|检出瘦肉精|资源违规|遭“封杀”悬疑|需求不振|被限制|监管“警钟”|受灾严重|仍未披露|被实施|净利大跌|被离职|隐瞒重大纠纷|大幅下降|被抛售|持续下滑|恐打水漂|警示风险|存风险|涉嫌重大遗漏|未兑付|涉嫌虚假|违规处罚|有猫腻|净利润狂降|客户存疑|被拒交|地雷业绩|被监管约谈|仍存疑|遭强制停牌|违规受罚|被投诉内幕交易|纰漏频出|质疑平台资质|被假冒销售|被追问|前景难测|引争议|费用存疑|被“祸害”|净利预减|暂停股权转让|信披“冰山一角”|遭遇过山车|证监会终止|被警告|飞蛾扑火|开撕|被质问|被通报|被发改委|遭监管关注|败诉赔偿|净利下降|双双下滑|股权纷争|耍赖皮|引监管层|公司受罚|合计罚款|曝家丑|遭上交所监管关注|企业超标|联合质疑|风险陡增|引后患|被质疑|濒临退市风险|动荡伤元气|被停牌|严重侵害|大幅下滑|被银行挪用|遭交易所问询|违约事件白热化|再画饼|著作权谜局|遭冷遇|接“烂摊子”|同比减少|披露不详|保壳|被消费殆尽|曝财务内情|分红违规|追问原委|销量减少|编制错误|离奇暴增|计划泡汤|被问责|被拆伙|存“易主”风险|中绩倒退|吊销保荐牌照|土豪操纵|恶意交易|疑躺枪|后市无望|遭“不测”|重组面临夭折|被取消|被冻结|沦为“鸡肋”|埋下祸根|遭“暂时性”否决|遭集体“换血”|遭拘留|再度爆仓|几近腰斩|曝全面停摆|前景存疑|被证监会否决|上演“拖字诀”|回归无期|陷危机|奇葩年报|业绩低迷|信批违规|沦为空头支票|终止交易合规性|踩雷借壳新规|涉偷梁换柱|连续巨亏|ipo大事不妙|散发着异味|受到警告|股东闹架|利润率不足|强制关停|本息违约|被揭穿|被调至负面|被罚逾|交易存疑|存违规行为|强制停牌|遭弃|演绎骗局|风险暴露|低迷倒逼转型|防卫过当|利润直降|违规购买理财产品|涉嫌内幕|净利润减少|警示退市风险|存占资问题|被“玩坏”|毛利率降|被替代|巨款失踪|带伤闯关|披露重大诉讼公告|最败家|股民举报|沦为“皮包公司”|受纪律处分|遭查封|产业泡汤|安装工为假冒|重组“流产”|遭上证所问询|陷入寒冬|盛世中断|股价操纵|受猛烈冲击|曝票据大案|被无视|全面疲软|过于凶猛|取消挂网|亏损加剧|重拳出击|违约陷囚徒困境|业务违规|已断裂|有“可恨之处”|市值梦碎|耗巨资返工|潜藏利益输送|公司躺枪|终止上市|曝风险|保壳困境|重组折戟|撤销背后内幕|净值暴跌|被挂牌|提示风险|经销商质疑|遭上交所通报批评|涉关联交易|难以持续|下发监管函|遇"瓶颈"|遭清洗|被曝不合格|深陷督导泥潭|下发关注函|暂停上市|频频折戟|风暴来袭|被重罚|产销降|露出致命缺口|涉短线交易|被罚款|被交易所问询|被挪用|大幅变脸|致应收账款大增|中毒事故|暴增幻象|业绩大降|曝光违反|资本入侵|被漠视|陷入窘境|投资浮亏|存多处疑点待解|被出具|已违约|受拷问|普遍预亏|遭下调|被风险提示|违法罚款|同期下降|存暂停上市风险|违约地雷|披露不准确|违法成本|负面行为|被上证所|违规托运危险品|被轮流冻结|违规涉|遭疑|被自律监管|遭监管层警示|被立案|违反企业文化|被勒令|受冷落|净利降|频发罚单|净利大降|引质疑|被st|遭深交所关注|被疑|被证监会调查|收入下滑|违规建设项目|重组效果打折|ipo痛点|赔偿不披露|失败告终|受挑战|下滑收购|营收下降|采取自律监管措施|引深交所问询|连环违约|严重失误|逆势下滑|涉嫌虚报采购|调至负面|被降级|涉嫌违反|被罢免|涉嫌泄密|遭“爽约”|单独起诉|净利腰斩|未信披|陷入票据风险|被责令|涉嫌吃空饷|涉事企业|违约投资人|重组上市|违规相关责任方|遭处罚|遭监管|被监管关注|处罚落定|项目暂停|暂停受理|被深套|违规开户|被追刑|被置换|遭投资者吐槽|存多种违规|重组均告失败|下跌风险|被埋怨|风波来袭|不足半年|受处罚|被调整|整体遇冷|负面舆论|隐瞒半月|妖股|遭股权|强制回购|严重侵权|项目折戟|终止疑团|遭证监会否决|已立案|陷欠债风波|业绩疲软|遭重创|遭拷问|涉嫌骗|现金流为负|遭局方处罚|披露不充分|主业低迷|牵出财务混乱状况|败家半年报|陷入亏损|疑问迭出|竟然“跑路”|存市场风险|被券商否认|被降为|遭暂停|沦为“违约王”|受谴责|泄露成谜|上市公司遭罚|持续拖累|违约风险|遭转让|遭补卡诈骗|谴责处分|无视合法提案|存货攀升|业务缩水|披违规|引爆纷争|相继陷入|产业艰难|被罚没|断崖下跌|双双巨亏|违规资金占用|深陷困境|曝内幕|遭泼冷水|被人举报|遇寒冬|连续“踩雷”|被交易所公开谴责|存“水分”|隐忧加剧|被玩坏|违规交易|遭自律监管|“卖壳”悬|虚增存贷款|销量骤降|追问跨界风险|遭司法冻结|非法截取|吹捧门|年报错误|陷财报危机|现象严重|在造假|频现违规|质疑董事会表决|资金冻结|遭搅局|净利减少|减少坏账准备大增|被否转型落空|被警告处罚|受行业|同期减少|被决定|遭狸猫换太子|被停用|重组困境|举报海外投资|受监管关注|存伤亡隐患|被证监会捅破|加速下滑|事故频出|滋长|坠毁|衰竭|赔掉|姑息|概不负责|情况严重|误传|应负|依法追究|放纵|一知半解|难以获得|郁积|一屁股债|出毛病|擅自改变|不明智|近墨者黑|以劣充优|被打乱|贪大求全|策反|撑门面|日趋严重|慢性伤害|刻舟求剑|不思进取|无稽之谈|草草收场|判处刑罚|毫无准备|依法取缔|轻敌|曝露出|束手无策|借题发挥|怨恨|不进则退|骗购|不值一提|打官司|解决不了|直言不讳|孰是孰非|不近人情|诱发|依法惩治|群龙无首|自诩|隐讳|抄袭案|作死|怯懦|不胜其烦|毁誉参半|跑官|一无所有|无法弥补|吵闹|信口开河|以讹传讹|迫害|付之一炬|要挟|拆台|经不起|纸醉金迷|黯然神伤|纵横捭阖|缓期|知难而退|恐惧|可诉讼|令人大跌眼镜|摇摇欲坠|没有勇气|丢卒保车|惊吓|刑事追究|劝诱|参差不齐|独木难支|为所欲为|猴年马月|痴人说梦|越俎代庖|挫败|从严处理|表示歉意|满盘皆输|催讨|依法打击|不切实际|勾心斗角|拖泥带水|臭名远扬|渔翁得利|无可挽回|险象环生|造谣中伤|不起作用|不可同日而语|平抑|无缘无故|非法所得|补亏|发泄|不利|破财消灾|充耳不闻|杳无音信|始料不及|冒犯|无故缺席|不知所措|垂死挣扎|急不可待|确凿无疑|不屑一顾|殚精竭虑|抱佛脚|远水解不了近渴|不寒而栗|捣乱|不白之冤|深感不安|误入歧途|臆想|模糊不清|痛定思痛|毁谤|无从下手|轻举妄动|串通一气|深表歉意|躲过一劫|产生矛盾|财政危机|同仇敌忾|义愤填膺|朝不保夕|疏忽大意|困兽犹斗|欺诈案|先天不足|如鲠在喉|望风而逃|分赃不均|咎由自取|公私不分|无济于事|不择手段|确凿证据|另起炉灶|短斤缺两|断送|无地自容|惴惴不安|屡试不爽|降低成本|不当之处|无原则|群情激愤|提诉|严厉查处|一查到底|乱了阵脚|受到冲击|利令智昏|猝不及防|放荡不羁|全盘否定|定责|胳膊拧不过大腿|遏止|争论不休|出庭作证|后果严重|鹿死谁手|败也萧何|违章|乱七八糟|担惊受怕|查办|卖假|哗众取宠|赃款赃物|互斥|逍遥法外|赖账|有过之而无不及|搅乱|贪污贿赂|疲于奔命|节节下挫|寻衅|各罚|气势汹汹|滞缓|玉石俱焚|嗤之以鼻|奇耻大辱|紧逼之下|坑骗|厚颜无耻|危及|提出抗议|粉墨登场|不守信用|是非之地|挥金如土|铁超标|恣意妄为|毫不相关|大动干戈|害群之马|相互指责|心急如焚|无计可施|拨乱反正|独断专行|大言不惭|稍有不慎|不认账|混淆是非|急不可耐|触犯刑律|溃于蚁穴|引咎辞职|举棋不定|有案必查|令人瞠目|谢罪|不良后果|偷逃税|移送起诉|待查|弱不禁风|身败名裂|威吓|水火不容|愤愤不平|来路不明|被双规|含糊其词|粗制滥造|吃哑巴亏|抗诉|可判|追赃|查案|同流合污|后顾之忧|虚心接受|滥用权力|连篇累牍|空穴来风|事不关己|辩驳|抗辩|票房跳水|面临司法拍卖|双双离职|影响投标|面临困境|融资怪现状|面临变更风险|降评级|陷入大额亏损业绩|不严谨|涉嫌误导性|骗补企业现状|多方受罚|客户“大换血”|重组风险陡增|标准缺失|排污超标|伤害消费者|公司停产|低迷倒|未兑现|重组委“大开杀戒”|管理失责|领深交所关注函|污染风险|被揭|被连夜提示|业绩大跌|骗补|行业遇挫|难返|惨遭小股东“打脸”|投资者的毒药|资金短缺|难题待解|断货危机|收到监管关注|大幅亏损|高层失联|披露前内部人增持|被迫关张|持续萎靡|取消整车资质|全面停产|影响业绩或作弊|违规持有|存在突出环境隐患|连年亏损|被指粉饰|疑点待解|股权迷局|意见不一|被资本玩|做市违规|离奇失联|被*st|急发风险|盲目施救|亏损资产|诉讼未决|经营压力|不规范|财富大蒸发|退市风波|遭欧盟“封杀”|数据“打架”|违规买卖|转让纠纷|拖字诀|同比大挫|业绩“失诺”|拒交表决|均反对|交易疑云|无法报牌|交易减持|下滑趋势|无法解决|严防资本|投资风险|被责整改|投诉分析报告|现重大利空|收到证监会警示函|违规予以|逆势涨停|套现失联|遭美国标普降|引发交易所追问|沦为st|摘牌危机|不交代|减持违规|被查出|经营停摆|涉异常交易|借壳上市受挫|业务纠纷|应收款风险|物料超标|监管约谈|收购迷雾|用途不详|股东反对|面临产品匮乏难题|市场整体遇冷|被证监会行政监管|逾期担保|高管离职|曝光涉事企业|亏两季度|战略碰壁|减值隐患|租赁纠纷|上交所处分|质量告急|高度依赖|净利双下滑|状态不明|连遭监管关注|库存难销|购销存疑|面临夭折|债权人“围剿”|“严重超标”排放|拖薪保壳|追刑责|研报监管|疑卷入|陷重组困境|痼疾待治|不断发酵|危机发酵|撤销股东会决议|数据之谜|成长存疑|风控压力|ipo造假|气囊缺陷|遭竞争对手|违约王|失踪理财款|违规情形|现“双降”|深陷亏损泥潭|自查风暴|降级风险|重组疑问迭出|现利空|虚假承兑业务|卖公司|不合规|介入调查|拍卖纷争|股民单独起诉|调查事件|难掩|闹乌龙|净亏|追问背后隐情|问责|巨额债务|巨头裁员|资产风险|提案无效|能力存疑|不守信|未投保|面临退市风险|预告大变脸|信披病|难成行|归属存疑|被关停|不“踩雷”|有隐患|股价波动|无视股东利益|遭遇行业冬天|收入之谜|求生扭亏|遭ipo中止|很尴尬|倒查罚单|危局待解|面临破产|难撑|企业绩变脸|收购案争议|系统监管|配售违规|未有效|未获通过|放弃重组|虚报采购数据|被曝拖欠|未计提相应预计|遭遇“变数”|难逃st厄运|终止疑团难消|严重开裂|疑存关联交易|诉讼纠纷|减少坏账|文化跌停|违规购买|难收回|领监管函|存在退市风险|业绩硬伤|又悬|被指借|预减公告|未通过|证监会发飙|标的去年亏|隐瞒卖壳关键信息|被假冒|遭自律|爆兑付危机|无人接手|疫苗事件|事件发酵|盈利承压|财务恶化|品牌全线溃败|集体“沦陷”|股价承压|对抗监管|违规套现|爆炸事故|企业黑名单|断裂风险|负面舆论难以自拔|暴增盈利画饼|遭渠道联合抵制|异议之争|实控人疑团|冰山一角|文字陷阱|交易风险|大幅转亏|未获支持|现负增长|大幅跳水|涉嫌“误导性陈述”|辞职埋单|纷争频遭|股价恐承压|收到《监管关注函》|加速逼宫|收到上交所问询函|不良贷款|事项遭否|未获成效|不按套路出牌|未予置评|模式终结|恐起|“炒股”亏|整改信披问题|虚列劳务费|欠薪事件|吃紧负债|涉嫌侵害|下游疲软|停牌病|疯狂的内幕|兑付风险|挑战重组|炒股亏|遭股权冻结|业绩亏损|违规办理|遭遇强敌|收到年报问询函|控制违规|资产负债率骤升|消费投诉|被投诉|点名通报|引监管问责|减持股份|支持诉讼|紧急套现|多起诉讼|现金流断裂|再起风波|业绩“蹦极”|盲目买入|核查风暴|不及预期|巨头亏损|不作为|纠纷诉讼|超标企业|股东发难|资产成谜|互撕|存“霸王条款”|被召回|发案疑云|紧急关注|债务危机|违规使用募集|紧急叫停|项目投产后亏|存信息披露问题|内部“大换血”|结果难料|私自挪走|财务猫腻|存在重大缺陷|否认涉案|股东遭罚|“自酿”兑付|反而亏损|超标上黑榜|防恶意收购|违法不断|现双版本|纠纷不断|不再经营|股价受罚|披露大变脸|经销商逼宫|涉“骗”|举牌乱象|被上交所点名|“遭禁”危机|否认借壳|获立案|毛利率奇高|已浮亏|面临更严审核|被发改委罚|未解决|追问终止|面临双重考验|支付存疑|无奈收缩|投研乌龙|高管辞职|遭深交所追问|巨额处罚|私募风暴|不公布|卖自家人|风险事件|难言胜利|绊脚石频现|信托风险|存在问题|现“后遗症”|未申报|收到证监会调查函|未按期进行|寄生式|陷盈利困局|难兑现|追问跨界|退市影响|涉嫌虚报|经销商纠纷|仍旧存疑|集体离职|涉嫌超额申报|易主受阻|收到警示函|不兑现|爆分析师“吹捧门”|疑云重重|信批监管|毛利率之谜|重重疑点|注销跑路|财务数据存疑|停牌一天|违规倒查|媒体曝光|无法绕过|模式遭遇|采取“连坐制”|遭上交所|转让疑云|暂停上市风险|面临“生死时刻”|增速放缓|难闯关|太坑爹|陷入全面疲软|卖子公司|纠纷曝光|监管关注|遭遇滑铁卢|面临资金压力|无法获知|净利重挫|监管层关注|业绩危机|逆势增长|严重失实|碰监管红线|逾期债额扩大|卖股还债|展望为负面|背后乱象|失信市场|缘何搁浅|有害物料|遭河南证监局出具|重组之路成谜|遭司法拍卖|狂降|年报疑点|恐成|环保阴霾|重组资产虚幻|艰难前行|此前卷入|闹“乌龙”|先行赔付|领罚单|被责令整改|品牌泛滥|被关联方占用|涉嫌虚增|股民索赔|收到深交所监管函|舆论漩涡|陷保壳困境|被辞|沦为“违约”|过度倚靠|集体泄密|虚增营收|多道重组|陷债务|无法提现|受累市场弱势|数据异常|逾期贷款|企业索赔|政策风险|受豪赌重组拖累|质价不符|上市存疑|影响后市|遭罚|方案流产|警告信|尚存变数|品牌巨亏|无法可依|未履行|产业整合困局|减值损失|“闹剧”监管|中报地雷|悬念待解|拒背黑锅|不良率|疑遭|现金流危机|遭证监会询问|成长乏力|行业不景气|未完成|遭退|半年度亏损|亏损存退市风险|炒股巨亏|遭中小股东否决|架构巨变|减持股份预案|超预警线|不符合|问题频现|风暴升级|控制权之争|市值坍塌|拒交财报|暂停交易风险|违背承诺|发函追问|股东践约|股东折价|终止定增方案|陷疑云|系统处罚|销量困局|公告减持|陷入三国|多处疑团|面临成长瓶颈|下滑严重|无法履行|遭遇“脚”投票|股价大跌|投资巨亏|终止挂牌|举报直指|客户起诉|难言顺利|难获赔|几乎一切存疑|涉骗|恐生变数|不正当|翻脸证监局介入|退市风险|生死状|章程闹剧|投诉内幕交易|涉案资金|交易监管|董监高辞职|存在难点|假冒销售|难解困局|陷转型困惑|怒告券商|追问关联交易|关停转让|被强行平仓|遭遇“老套路”|终止收购|“黑天鹅”频现|单一产品|巨额占款|再亏|净利亏损|难增利|开局告急|违规提前使用|千万坏账|被深交所监管|设备直接损失|证监会处罚|共亏损|引发市场疑虑|反省不足|预警亏损|存在较大不确定性|难翻身|违规遭罚|竭力否认|疏漏补偿|持续增长存疑|“评级”存疑|未公布|停水事故|严禁入市|首降|市场禁入|账户存疑|净利润大跌|违规非经营性|面临“下课”风险|诉状牵出|遭“封杀”|未按规定|面临困局|现笔误|遭刨根问底|掩转型困局|拖欠工资房租|被贷款|业务堪忧|信披存瑕疵|尴尬局面|利润惨淡|被冻|连亏|失信“大户”|殃及担保人|黑名单激增|摄入致癌|配售黑名单|屡遭警告|逾期归还|不及时|予以监管关注|“裁员”事件|负面消息|环保问题|重组“夭折”|难“解渴”|资金占用问题|遭一董事反对|面临诸多难点|再曝光|资金“饥渴”|股权争斗|不接受|引玄机|占用资金|被检农残超标|不认同|遭“黄牌”警告|问询函|半年报蹊跷|虚假资料|梦想落空|追问未披露|股东公开谴责|严重生锈|易主梦碎|业绩突变|影响利润|导致食言|被限期整改|利润“蒸发”|引出扑朔乱局|年度亏损|违反减持承诺|状况频出|不承认|用途不明|不全面|再折戟|仓式减持|董事长套现|消息缠身|破净|未备案|不足遭批|惨遭股东|拖延增持|互相打架|业务巨亏|引发债务质疑|难以扭转|能力不足|遭批|惨遭股东抛弃|危在旦夕|被提示风险|财务数据有异|采取监管谈话措施|能力薄弱|监管“寒流”|战略难以为继|疑陷|撤资风波|定增遇阻|并购后遗症|逃债无望|存三大隐患|恐陷股权争夺大战|游戏梦碎|被处|罚单|连遭警示|存监管风险|不规矩|处罚升级|暴露制度缺陷|紧急问询|集体请辞|存卫生安全隐患|市场承压|“寒流”袭来|隐患升级|控制权隐患|业绩大亏|陷入忧患|清仓式减持|频繁停货|惹怒|创新力存短板|主业荒废|非理性竞争|资产流动性低|资金运用不健全|管理违规|销售违规|财务费用违规|未退运费险|不支付保险金|买成保险|回避风险|成了买保险|赔付不到账|拖欠理赔|瞎办保险|与赔付不符合|拒绝理赔|没收回保金|不给机动车保险证|复效困难|保单永久失效|拒绝赔付|得不到理赔|索赔无果|不开定损单|拖延理赔|运费险不给退|解除保险|不退还保险押金|存钱成了保险|没有理赔|拿不到定损单|隐瞒费用|理赔复杂|不到账|理赔慢|保费强行翻倍|不给赔|理赔艰难|不理赔|不能全额赔偿|没赔|不能理赔|代我签字|骗取保金|匿病投保|化名就医|要员工购险|保单门|变成买保险|无扣款通知|无保单|拒付返还金|公意险缺陷|存款成保险|取消保险代理资格|索赔无门|鸳鸯保单|赔付难实现|假理赔|假航意险|假借保监局|医保案|理赔案|被签名|没赔付|保单过期|孤儿保单|没法续保|银行内卖保险|保费说成存款|搭售保险|保单不能退|巨额保险|保费骤增|银行卖保|违约购买|保无故失效|多收保费|超额承保|不受理|天书保单|地下保单|骗贷|通融理赔|吃单|保险饭局|账户缩水|拿不到保险金|诈保|没有如实告知|保障单一|未告知是保险|赔付率低|伪造保单|没法赔|骗得赔款|被代签|保单有假|拒付保险|赔偿案|拒绝支付|被保险|变成了保单|延期给付|延迟支付保险金|退还保费|违反投保程序|赔付存在问题|虚列|没有告知|错误介绍|额外利益|不给赔付|大闹保险公司|骗取高额保险|高额退保手续费|存款变生命人寿|虚假病史|骗医保|编造病史|不想再投保|承诺投保人合同外利益|违反保险法|虚构团体|擅自变更条款|假保险|虚增保费|血汗钱变太平洋保险|存款变国寿保险|数据不真实|医保卡被停用|医保卡被冻结|保单存误导|孤儿单|保单无人跟进|虚假社保|无法获理赔|拒保|不想理赔|享受不到|保险不管|拒绝退还|被逼买保险|理赔烦恼|不能刷医保卡|不刷医保卡|莫名成保险|损害参保者|骗取医保|医保卡成提货卡|变成了保险|理财产品变保险|强推保险|虚假列支佣金|代签名|虚假投保资料|解释不明确|自行扣款|强卖保险|不能赔|保单未生效|理赔逾期未支付|冒充投保人|保金未追回|伪造保险票据|误买代理费高|无法理赔|生效后再上路|修改保单底联|费率下滑|高保低赔|减保|寿险市场惨淡|索赔率上升|偿付能力不足|炒停|偿付能力严重不足|假费用|假业务|虚挂|银保乱象|银保挤兑|非法套取资金|截留保费|保监会通报|涉及保费|团险业务违规问|定损标准不一致|保单失效|保险被套|保险损失|存款变保险|误买保险|诱导投保人|虚构代理业务|阴阳保单|假签字|回访超期|产品结构不合理|退保纠纷|存款变保单|收不到保单|保单无人管理|退保困难|办案无故拖延|欺骗销售|抬高交强险售价|虚增营销员|拒绝赔偿|虚挂业务员|骗取保险|回访违规|不给予理赔|套现|骗保|骗卖|资金去向不明|假保单|理赔纠纷|押金退还难|虚列套费|诱导推销|代签门|骗买|套取费用|非法保险中介|理赔给付纠纷|拼凑保单|虚假承保|险企资产流动性低|虚假赔案|取消代理资格|挪用保费|侵占保费|保障能力不足|不说明拒赔理由|拒赔|理赔过程不透明|理赔资料繁多|定损差距大|理赔尺度不一|惜赔|拖赔|费率不公平|费率问题|不如实告知|不进行风险提示|存单变保单|销售误导|误导投保人|理赔难|理赔金额少|虚列中介业务费|到有效保障|不予理赔|保险单遭质疑|虚假理赔|不赔|编造保险|诱导投保|高收益陷阱|保费侵吞|没理赔|不够赔|保险诈案|被续保|保险合同被终止|虚假住院|未给乘客上险|不予赔偿|被失效|套保|存款变新华保险|夸大意外险|停保|最富低保户|被劝退|存款办成保险|假赔|骗领保险|仍未明|“断崖式”下滑|巨额补贴|涉嫌刷票|有霉变|未覆盖|“双头”之争|补贴的诱惑|ip纠纷|乱局频生|难根除|牛散夺食|幽灵场|内控不善|引发行业震荡|采取责令改正措施|遭伙伴罢免|趴窝|责令增加|被停工|批次不合|自食恶果|“闹”离婚|批次不合格|原因仍未明|遭遇“断崖式”下滑|态度说变就变|内控八面漏风|投资踩雷|名声差|持续亏损|方案遭否|未及时信披|地位濒危|巨额电费纠纷|股权冻结|减持公司股票|资不抵罚|业绩大倒退|被上交所问询|揭示风险|被行政监管|大做文章|公诸于众|出卖|战战兢兢|轻慢|一去不复返|聪明反被聪明误|听天由命|掉以轻心|不灵敏|半途而废|怜悯|踟蹰|迷惑不解|勒索|不予承认|不符实|易沾污|添麻烦|雁过拔毛|毛骨悚然|遭袭|树欲静而风不止|自查自纠|杀气腾腾|溃散|逼出来|心有余而力不足|变味儿|趟浑水|毋庸赘述|令人不安|寻衅滋事|无证照|初见端倪|难觅|一带而过|一着不慎|造谣生事|打砸抢|不堪|偷天换日|有苦难言|招摇撞骗|偷运|为富不仁|来者不善|训斥|欺压|忍俊不禁|捉拿归案|死心塌地|不速之客|法网恢恢|对着干|严重困难|排山倒海|情况不明|触怒|岿然不动|马失前蹄|违反纪律|不平则鸣|刀俎鱼肉|不可救药|黑材料|天有不测风云|警钟长鸣|冷眼旁观|有违常情|迫不得已|追踪调查|无用武之地|费尽周折|沾亲带故|有腐必反|毁于|制造矛盾|反复无常|犯错误|艰难曲折|荒诞不经|泥沙俱下|非死即伤|祸起萧墙|恼羞成怒|心怀不轨|一事无成|牵累到|坐以待毙|贬为|山雨欲来风满楼|情况异常|恨之入骨|暗潮汹涌|不良倾向|无法挽救|天理不容|错失良机|搬弄是非|拳打脚踢|无言以对|参赌|溃退|拒绝服务|扣人心弦|惊世骇俗|一罚了之|来历不明|倒大霉|诚惶诚恐|恃强凌弱|变本加厉|后患无穷|滴水不漏|不遗余力|黔驴技穷|引火上身|狼狈不堪|名不符实|冒天下之大不韪|监管函|稀土超标|督导不力|被强制平仓|资产减值|遭风险提示|ipo堪忧|引发不满|裁员降薪减亏|唯一亏损国企|成受罚常客|陷迷途|将一手好牌玩烂|遭欧亚卖场封杀|网销违规|被交易商协会通报|出具警示函|遭券商风险提示|惨遭下调|齐“变脸”|股东“群撤”|重组疑云|惹怒证监会|数据齐“变脸”|年检不合格|蚀本|撕毁|错误做法|整顿|臆造|混乱状态|不堪设想|不及格|吐血|哄骗|逼迫|收拾残局|废弃|证据不足|被忽视|困难|损耗|告密|妨碍|情况严峻|调戏|衰减|毁于一旦|拒绝接受|夺走|贬值|拉下水|阴阳怪气|窃听|犯错|任人宰割|危害|不符|不尽一致|相去甚远|隐瞒真实情况|敲山震虎|绞杀|震怒|处心积虑|滥用|打假|无法说明|被强制摘牌|出现异常|咄咄逼人|爆仓|强行平仓|不能平仓|退市|停市|高频交易|违约|过度投机|系统性金融风险|违规减持|赌场|私募失联|失联|维权|交易中断|交易故障|违反反洗钱法|小鬼|领导弱化|建设缺失|管理不规范|协助调查|非法聚集|游行|静坐|集体诉讼|跳楼|放火|扰乱办公场所|肆意辱骂|言语攻击|扭曲事实|集体飘绿|跌停板|超跌|急跌|自成交|整体低迷|黑天鹅事件|重创|行情疲软|大量撤单|频繁撤单|股市大跌|熊长牛短|延续跌势|连续下跌|大幅下跌|断涯下跌|闪崩|保证金不足|报单延迟|暴力加仓|爆雷|变脸减持|不担当|不能履行职责|财务注水|财务状况恶化|超范围经营|撤销备案|倒仓|盗买盗卖|赌博|断崖|兑付逾期|股东抽逃出资|股东虚假出资|股价腰斩|行政监管措施|合谋操纵|黑嘴|糊弄应付|花式减持|混日子|集中减仓|集中抛售|减持新套路|叫停|巨额亏损|巨幅亏损|客户密码被盗|客户账户被盗|连年下滑|流动性风险|流动性危机|庞氏骗局|疲疲沓沓混日子|评级虚高|欺骗投资者|欺诈发行|抢帽子交易|人去楼空|数据库宕机|数据库故障|数据库异常|通道业务暂停|投机|推卸责任|违约担保|尾市拉抬|无成交回报|无法撤单|无过便是功|无力偿还|系统宕机|系统堵塞|系统事故|系统延迟|系统异常|系统拥堵|消极敷衍|效益大幅下滑|修饰财报|虚增收入|研报标题党|业绩连续下滑|业绩造假|溢价减持|影子偏离度|逾期兑付|债券代持|重大遗漏|装样子|蛊惑交易|操纵开盘价|业绩作假|大幅下调业绩预估|粉饰财报|应收账款翻倍增长|财务报表撒谎|财务欺诈|业绩有压力|业绩同比下降|下修业绩|下调业绩|业绩连续亏损|业绩承诺被质疑|业绩不及市场预期|虚增业绩|零成交|飘绿|全线重挫|再遭重创|全线下跌|跌出新纪录|全线低开|大幅下挫|遭遇重挫|股价创新低|坍塌式离职|联系不上|坠楼|发布通缉令|违法操纵|隐瞒重大涉诉|带病上市|信息披露虚假|信息披露乱象|遗漏披露|业务连续下滑|夺权式要约收购|重组造假|抽逃出资|招股说明书撒谎|敌意收购|反收购|控制权纠纷|业绩对赌未完成|业绩对赌失败|虚假出资|质押股票跌破平仓线|侵占上市公司资金|侵占上市公司资产|侵害上市公司利益|无偿占有上市公司款项|凌驾|混乱|公司治理失效|公司治理失败|公司治理失灵|限制股东权利|公司治理待解|奇葩议案|审计失败|无法表示意见|被调查|评估失真|不履职|问询|监管关注函|警示函|内控缺陷|大股东违规|控股股东违规|法人治理缺陷|流动性枯竭|流动性不足|挪用保证金|流动性坍塌|内容诱导|阴阳合同|自行召开|自焚|虚假仓单|涉嫌受贿罪|奢靡之风|疲疲沓沓|明斯基时刻|立案|跨市场操纵|交割违约|灰犀牛|持续看空|朝令夕改|被开除|备案除名|业务萎缩|财务数据不真实|业务虚构|账款催收|合作方失联|负债率过高|纠纷|债务|负债高|异常交易|隐藏债务|财务纠纷|合同违约|食言|净负债率攀升|利润下降|报告期亏损|营收大幅下降|业绩缩水|业绩大幅缩水|被指控|被监管谈话|重灾区|关停|重组“流产”'
#neg1 = '不买|不吃|不喝|拉肚子|胃疼|吐槽|一概而论|换汤不换药|坑爹|歧途|做贼心虚|作梗|罪孽深重|盲目|懊悔|丧胆|淫邪|粗拉|罪该万死|疏懒|失检|一仍旧贯|重负|花天酒地|纷扰|蠢话|寒冷|刚愎|消极|降级|陷害|凶煞|愚陋|逼问|埋汰|黝黯|厚颜无耻|畜生|世故|敌对|萧瑟|废话|荒僻|窝心|简陋|目光短浅|唾弃|反对|陷落|苦境|剌戾|玩忽|悲切|消沉|忧愁|忧伤|随心所欲|坏事|吝惜|欺骗|攫取|呵斥|残忍|洋鬼子|退缩|野心|嘲笑|不利|空泛|侵袭|含糊|挑衅|遗憾|轻浮|杂沓|卑怯|贪得无厌|妄为|骚乱|完蛋|潜逃|奸邪|盗窃|孤行|小偷|骄矜|驳杂|随便|夭折|无知|寒伧|坐井观天|犯贱|偏废|尖酸|混浊|不幸|碍难|阴森|讨厌|庇护|衰颓|错误|煞费苦心|吝啬|仇敌|追悔|罪名|冷冰冰|作乐|狼狈|纸上谈兵|阻隔|盗贼|斤斤计较|腐旧|卖国|保守|穷酸|闭塞|篡改|可耻|无视|敌人|侵占|黯然|不可一世|纤弱|过虑|挑拨是非|啰嗦|搞鬼|空话|引诱|憷头|亵渎|无理取闹|屈服|罪犯|触怒|空乏|悲剧|冗长|狡猾|气馁|下降|过激|非难|虚荣|怯弱|破陋|胡诌|侈靡|烦扰|沉闷|藏奸|故障|目中无人|看风使舵|寡欢|邪恶|淡薄|蠢人|霸占|暴徒|酒鬼|逃避|傲视|拘泥|猖狂|庸俗|愧怍|颠覆|矫揉造作|记仇|昏庸|奸诈|黯淡|停滞|迂阔|昏迷|虚设|泄气|声讨|浪荡|失策|生气|凶杀|内疚|坏|泄露|哄骗|慌张|蔽塞|阴惨|杀害|猥鄙|骄纵|繁琐|低落|坎坷|疑虑|皮相|野性|流氓|繁冗|徒劳|冥顽|拖沓|废物|偏心|轻贱|狭隘|谲诈|愁眉苦脸|独断|麻痹|嫉恨|苟且|残毒|丧心病狂|嚣张|投降|片面|委琐|假公济私|猥亵|一成不变|仿制|逃之夭夭|怨言|毒打|硗薄|粗话|内哄|文恬武嬉|压抑|罪不容诛|责难|勾结|蓄意|厌倦|惹气|投敌|欺压|恫吓|吓人|病魔|敌意|猥陋|凶狂|狭窄|禁闭|碍眼|浇薄|可恶|孬种|无耻|薄情|怅怅|忌妒|凄怆|得寸进尺|困境|竭蹶|枯槁|鬼头鬼脑|损耗|偏见|惨苦|贿赂|偏袒|混乱|垮台|淫逸|难听|忙乱|装模作样|翻云覆雨|恶果|烦心|虚假|赌博|浅薄|鼓动|惊恐|封建|耻辱|委靡|违规|变相|迂拙|唾骂|拈轻怕重|劣势|凶顽|下三烂|粗野|愚昧|悍然|违背|深重|冷嘲热讽|惨痛|讥诮|申斥|牢骚|放荡|争吵|恶化|冗杂|贪财|阴损|昏乱|卑微|阴险|执迷不悟|损人利己|粗俗|恶狠狠|肮脏|弊端|丢丑|致使|虚弱|混蛋|末日|颓败|发狂|罢黜|恼人|害处|污蔑|失误|生硬|衰微|阴谋|草草|下贱|压榨|粗陋|密谋|腐蚀|子虚|土匪|主观|擅自|报复|恣肆|无赖|吵架|蒙昧|惨败|沮丧|避重就轻|古板|滑头|抱怨|无名|挫伤|丧失|目瞪口呆|误导|冷酷|出轨|胆小|吹嘘|卑贱|固执|繁难|鲁莽|苦涩|辛酸|死气沉沉|见风转舵|刻薄|痛恨|懈怠|罪过|狭小|烦闷|骄慢|怅恨|滥用|混沌|阔绰|戏弄|囚犯|针砭|尴尬|困难|厌弃|指桑骂槐|犹豫不决|冰冷|狰狞|蠢笨|粗暴|柔弱|差劲|疑心|责问|骚扰|轻视|乖剌|收买|调戏|做作|约束|败坏|平庸|简慢|见异思迁|破败|颓靡|残缺|犯人|责备|隐瞒|干涉|冒犯|漠视|乱杂|吹牛|含沙射影|畏葸|暮气沉沉|怨恨|怅惘|贸然|暴跳|卑鄙|昏暗|稚气|横行霸道|挥霍无度|两面三刀|沉沦|困顿|豪强|颓唐|古怪|残缺不全|仇恨|好色|落魄|暴力|虎头蛇尾|陈腐|苛刻|驱使|干扰|尖嘴薄舌|嫌恶|阴沉|异想天开|变心|谬论|怪物|烦冗|骗局|践踏|厚颜|缺陷|失意|恶棍|女巫|郁结|窘境|毁坏|事故|张口结舌|阻滞|重沓|呵叱|不爽|杀气|调皮|丢脸|肉麻|恶人|空虚|斥责|掩饰|惆怅|毒品|娇气|拖累|漠不关心|悲苦|残酷|放浪|迷信|蚍蜉撼树|蛮荒|计谋|鬼鬼祟祟|黑心肠|惶悚|倒楣|妄动|抱残守缺|色厉内荏|骗子|翘尾巴|忧虑|狂妄|抵触|畏首畏尾|嫌憎|纵容|无中生有|吹捧|口蜜腹剑|偏差|攻击|伧俗|羞耻|繁缛|妨碍|篡夺|穷奢极欲|恐慌|不公|遗弃|勉强|责怪|落空|暮气|不闻不问|瞻前顾后|急躁|非分|结仇|倨傲|怒发冲冠|谩骂|强横|霸道|没精打采|动怒|污秽|负担|拖泥带水|妄自尊大|单薄|骄气|令人发指|蛀蚀|刁滑|凌杂|荒唐|反动|劳役|幕后|枯涩|畸形|呆笨|衰落|装相|偏颇|腻烦|荒废|索然无味|暴跳如雷|动气|怯懦|肆无忌惮|举棋不定|臭名远扬|猜疑|含混|苍白|光火|訾议|窝囊|损坏|忧愤|魔王|隐晦|占领|批判|可鄙|连累|黑道|娇养|荒凉|贱货|气势汹汹|顽梗|私心|草率|抑郁|羞愧|贪心|存心|强词夺理|妒忌|漠然置之|蠢事|失慎|悲戚|伤痕|俗|夺取|肆虐|自大|溺爱|残暴|惨案|酷烈|啬刻|傻瓜|迷惑|受挫|祸国殃民|扭曲|死板|无精打采|中伤|顽抗|苟且偷安|抹煞|郁郁|阴暗|要不得|无聊|自以为是|血淋淋|幽暗|糜烂|低级|孤傲|愚蠢|施暴|空想|嚣杂|尖刻|蒙蔽|低声下气|迟钝|作假|魔鬼|匮乏|胡闹|糊涂|失察|乏味|任意|迟滞|迁就|诡诈|窘促|抢夺|胆小如鼠|同谋|麻木|浑浊|短暂|变脸|怵头|芜杂|糟粕|污浊|自高自大|瘫痪|暴露|离心离德|诡计|发疯|胡思乱想|腐化|劳而无功|呆板|蚕食|丑事|动荡|腻歪|穷途末路|麻烦|微贱|伤神|断肠|粗心|寒心|迟缓|失当|惶然|不轨|惊骇|割裂|狠毒|逆耳|马虎|任性|紊乱|陈旧|粗笨|残虐|朝秦暮楚|分崩离析|荒乱|下作|混战|噪音|下乘|胡话|蹂躏|傻子|奢华|通敌|打扰|鄙夷|丢失|限制|褊狭|专制|杀气腾腾|劣质|恶习|蹩脚|荒疏|淫乱|流言|咄咄逼人|黄色|费解|惶恐|繁杂|败家|懊丧|短路|卖弄|排斥|蔑视|虐待|饥馑|抠门儿|坏水|嘈杂|老朽|毒害|贫穷|浮浅|疑心病|投机|杂乱无章|祸根|低迷|恼火|不孝|怪罪|轻薄|赤贫|千篇一律|悲伤|屈从|猜嫌|灾祸|侵入|埋没|毒手|暧昧|刺耳|扰乱|流气|龌龊|理屈词穷|不祥|腥臊|朝三暮四|乌烟瘴气|批评|无的放矢|愚弄|肆行|占据|认命|炫耀|惨毒|揭露|歪曲|耻笑|动摇|缺乏|坏蛋|叛徒|反抗|诱拐|曲解|乖僻|明哲保身|巴结|繁芜|暴戾|下等|假心假意|沾染|愧汗|疑云|干政|拘执|败絮|暴行|连篇累牍|欠缺|地狱|瑕疵|骂街|鄙陋|惨厉|可恨|迟疑|本末倒置|挑刺儿|烦乱|一意孤行|坏人|乖谬|穷凶极恶|挑战|死皮赖脸|昏聩|过当|心灰意懒|虚浮|讥讽|丑八怪|毛病|嘲讽|捕风捉影|驽钝|胁迫|贵|荒芜|以怨报德|失事|抑制|赖皮|污染|藐视|黠慧|山穷水尽|鲁钝|强盗|拙劣|凌虐|捏造|油滑|暴乱|变节|寡情|嫌弃|败北|跋扈|愚顽|悲凄|殴打|胸无点墨|愚妄|漂浮|厄运|悲观|弱点|凶横|灭口|享乐|阴郁|下品|孱弱|造作|三心二意|勾引|颓废|不法|泼妇|肤浅|泛滥|固执己见|暴烈|险诈|威吓|错过|自私自利|鼠目寸光|咒骂|愚钝|危害|臭名昭著|支离破碎|失宠|汉奸|责骂|气急败坏|造谣|贬损|媚俗|拘束|惨淡|乱套|冲撞|侵扰|装样子|残破|冷眼|贫乏|怠惰|刁悍|胆敢|怨天尤人|作怪|放任|低沉|苦难|罪恶滔天|淡漠|负面|危机|枯燥|诽谤|耸人听闻|笨蛋|阴影|垄断|鱼目混珠|谈虎色变|走狗|损失|严重|侮慢|半死|德性|困窘|虚张声势|奴颜婢膝|取笑|利欲熏心|灰色|蛮横|腥臭|讽刺|惨重|村野|呵责|凌乱|寄生虫|发热|口是心非|悲恸|挫败|欺瞒|肃杀|出卖|贪图|剥削|贬低|色狼|恶毒|侵犯|逼迫|威胁|离间|嘲弄|刻板|质问|适得其反|唯我独尊|累赘|叫骂|笨拙|悲酸|指鸡骂狗|棘手|遇难|虚伪|谎话|糟糕|内讧|逼供|肤泛|暴虐|烦嚣|瞎扯|放纵|灌输|乱窜|惶遽|受害|破坏|恐吓|怨悔|破旧|不堪一击|惊扰|凶戾|失宜|颠倒是非|骄傲自大|凶毒|丑闻|惊惶|窥探|懒汉|背理|触犯|残废|装腔作势|侵蚀|暴发|闷气|粗心大意|撒谎|心虚|肆意|失态|侵夺|强迫|现实|旁若无人|失节|悖谬|痼疾|卑下|伤害|郁闷|不学无术|歇斯底里|夸大|侮辱|胆怯|背时|叫嚷|仇外|近视|作弊|穷匮|吸毒|败兴|挑拨|不择手段|挥霍|差点儿|忘恩负义|恶浊|萎靡不振|泼辣|半途而废|苦恼|背叛|笑柄|瘦弱|牵连|阳奉阴违|愁苦|吵嘴|陷阱|不仁|饥荒|作难|狡狯|讨价还价|冒牌|恶心|纸醉金迷|嫌疑|反面|黑暗|乱腾|卖国贼|严酷|背悔|旁敲侧击|俚俗|不对|畏缩|倾覆|庸碌|祸害|不屑|刚愎自用|衰败|面目狰狞|图谋|疏忽|狂妄自大|慌乱|该死|脏乱|吵闹|白痴|嘴尖|延误|不善|万恶|非法|惊慌|失神|寒碜|毁损|惨死|溷浊|破裂|强暴|嗔怪|专横|不济|玷污|费力|横肉|驴唇不对马嘴|谋杀|障碍|残败|犯愁|粗糙|偷懒|趁火打劫|德行|变态|私自|小人|苛责|凶残|瞪眼|一毛不拔|滚蛋|鄙吝|蛇蝎心肠|叱骂|欺凌|堵心|笑里藏刀|执拗|抠搜|卑污|阴毒|浪费|哀求|疑惧|辣手|镇压|压迫|胡说|感伤|华而不实|丧气|叶公好龙|懒惰|躁急|官僚|流离|粗莽|酸楚|苛求|怒不可遏|诱惑|贪婪|逃走|损毁|窃贼|愚蒙|衰弱|一文不值|犹豫|自诩|聒噪|短处|忧烦|疯狂|欺诈|空洞|怄气|猖獗|拆毁|纸老虎|恐怖|敲诈|窘迫|反感|高傲|消耗|粗制滥造|伪善|板滞|退步|八面玲珑|俗气|横暴|动乱|索然寡味|轻忽|别扭|漫骂|厌恨|小气|愧恨|训斥|褊急|污点|羊质虎皮|刺眼|粗劣|顾虑|矮小|杀戮|罪孽|奚落|偏狭|涩滞|恶名|煽动|白搭|鄙薄|腐朽|险恶|瓦解|干瘪|冗赘|争斗|讨好|毒辣|缺德|老气横秋|愧悔|阻塞|挖苦|血腥|呆子|笨重|屁话|荒诞|张狂|利己|颠倒黑白|挫折|喧嚷|放逐|文不对题|惶惶|自命不凡|淫贱|粗率|迷途|贬黜|烦恼|凋谢|非人|腐恶|有头无尾|疙瘩|惭愧|奸猾|短视|败退|受气|犯罪|禁锢|鄙俚|酷虐|粗疏|瘠薄|羞人|乞怜|懊恨|悲凉|气恼|中邪|灰心|过分|悖逆|贫困|厌烦|矜夸|腐烂|猥琐|轻蔑|缩头缩脑|低贱|军阀|隐讳|非议|嫉妒|退却|惊吓|腻味|过错|捣蛋|毁谤|窥视|诋毁|暴躁|低下|脆弱|死硬|自馁|不配|搪塞|过失|僵硬|冒失|不兴|忧心|鄙俗|谬误|得罪|语无伦次|蛮不讲理|羞辱|骚动|蔫儿坏|粗浅|气短|叛国|损伤|蓬乱|狂暴|屈才|对立|言不由衷|耗费|伪造|颓丧|坐而论道|凄惨|心惊胆战|苦役|利令智昏|凶恶|僵持|亏心|指斥|遭殃|费劲|指责|纠缠|阻碍|自恃|迂腐|抢劫|失利|粗鄙|告密|乱说|土俗|心烦|懦弱|隐藏|讥刺|次品|污辱|狡滑|赌气|辱骂|上当|诟病|刁钻|不逊|败类|逃跑|难看|隐忧|低劣|强加|反复无常|啰唆|虚诈|无能|理屈|倒彩|残损|胆大妄为|狎昵|迫害|愧疚|丑陋|自夸|怫然|大言不惭|懊恼|可憎|因循守旧|假冒|灾害|踟蹰不前|弊病|凌辱|不妙|目空一切|侵吞|乱七八糟|倒闭|淫靡|扎手|低能|狡黠|苦闷|黑店|坏处|迟到|贬值|得陇望蜀|颠三倒四|守旧|牵制|束缚|野蛮|艰危|动火|见鬼|虚|斥骂|傲岸|难受|轻信|名誉扫地|无所不用其极|叫嚣|恶劣|癫狂|平淡|刺激|胡扯|骄横|愚傻|鄙视|顽钝|别有用心|低档|过度|打架|面目可憎|虚妄|平淡无奇|乌七八糟|假惺惺|背令|恼怒|不是|内情|狠心|怯阵|屈辱|过时|嫌厌|海难|闹事|冬烘|诡谲|差|自暴自弃|浅陋|轻率|滞销|干巴|作呕|不和|不肖|奢侈|闹剧|枯竭|夸示|叛乱|纷杂|晦涩|旷课|被动|圆滑|退化|揶揄|推翻|讨嫌|尖酸刻薄|粗重|奸佞|豪横|受难|畏怯|娼妓|贫瘠|见罪|困苦|躲藏|缺点|诅咒|破落|顽固|忽视|众叛亲离|觊觎|遭受|暴政|毁容|犯憷|勒索|欺侮|胡作非为|非礼|喋喋|顽劣|猥劣|一言堂|疑忌|稀松|反目|腥膻|议论|鬼子|丧尽天良|松散|狡辩|七零八落|落套|对抗|功利|仿造|荒谬|废弛|招摇撞骗|神气活现|目光如豆|扼杀|依赖|丧志|损害|武断|反常|憎恨|低三下四|费事|白费|浑噩|呆傻|邋遢|拥挤|喧哗|低潮|说谎|逊色|姑息|残害|暗杀|削弱|纠纷|焦虑|黑心|厌恶|违法|堕落|破产|萧索|侵害|下三滥|苍凉|草荒|成见|孤独|愚痴|孤僻|单调|怠慢|掠夺|妨害|冤孽|奴役|共犯|独裁|乞求|拉杂|倾轧|绝情|讥嘲|沉溺|凋敝|臭骂|夜郎自大|轻狂|幼稚|苦痛|灾难|糟心|促狭|矫情|灰暗|厌腻|赃物|乞讨|窒息|花心|黝暗|紧张|置之不理|胆寒|惹祸|放肆|漏洞|仇视|腐败|诡辩|大话|缺少|烦躁|冷淡|创伤|狼心狗肺|沉滞|下流|老奸巨猾|勾心斗角|落拓|浪子|万马齐喑|鄙弃|一窝蜂|误解|悭吝|淫秽|软弱|险阻|假意|发愁|势利|零乱|出尔反尔|嫌疑犯|自满|沉重|挑剔|不满|假手|剽窃|歹徒|褒贬|岔子|上钩|怠工|抓瞎|失败|卑劣|矫饰|垃圾|猜忌|哀号|淫猥|游荡|后进|夸诞|破烂|乖戾|散漫|悖晦|乱糟糟|草菅人命|阴晦|岌岌|蜻蜓点水|吵人|奸险|谋反|病态|蛮横无理|大肆|惨烈|致命|犯规|杂质|一触即溃|拘谨|呆滞|薄幸|财迷心窍|毛糙|偷窃|渣滓|阿谀|阴冷|失望|僵局|张扬|懒散|杂牌|暗淡|负心|荒淫|妄求|恐惧|蛮干|辜负|横加|阔气|忧郁|不当|短促|低俗|烦难|分赃|凶手|风波|萎靡|生涩|亡命|忧惧|不周|偏激|凄凉|滞涩|饭桶|负疚|惰性|支吾|杂乱|烦人|罪大恶极|肥胖|泄密|两面光|失和|靠不住|落后|胡来|背信弃义|横行|歹毒|唐突|悲痛|恼恨|死记|妒恨|敌视|残杀|碰壁|狡诈|不劳而获|心寒|偷摸|歧视|伤天害理|理亏|绑架|假造|劣等|潦倒|恶意|不良|胡乱|烦琐|碰撞|失信|发烧|风骚|闹鬼|浅尝辄止|谄媚|铺张|有始无终|蜚语|罪行|渺小|灭亡|难堪|恶贯满盈|乖张|无法无天|靡靡|不快|愚拙|严厉|僵化|垂涎|胡言|趾高气扬|发憷|难过|勾搭|过敏|压制|心口不一|掉队|衰退|怪僻|自惭形秽|受骗|自负|包庇|忧闷|伪装|潦草|冷冷清清|惟我独尊|粗鲁|折磨|憎恶|谣言|单弱|欺负|蜕化|违犯|逞性|虚饰|奢靡|恶魔|扫兴|愚鲁|崩溃|味同嚼蜡|夸耀|悲叹|谎言|繁乱|蛊惑|暴跌|逃亡|浮滑|玩弄|落伍|傲慢|拙笨|小肚鸡肠|罪恶|寒酸|暗昧|冷漠|嗔怒|凶险|庞杂|惟利是图|支离|艰涩|刁难|张冠李戴|垂头丧气|为所欲为|十恶不赦|无动于衷|汗颜|短浅|奉承|私通|机械|冒充|愁闷|耽搁|贬斥|狼籍|萧然|偷偷摸摸|凶兆|违反|盛气凌人|打搅|凶狠|绝望|叱责|八股|贪|不力|模糊|诱饵|偏执|葬身|流言蜚语|侵略|愚笨|焦躁|圈套|挂火|排除|后悔|自私|马马虎虎|暗弱|恶臭|不可靠|淫荡|专权|闻风丧胆|煽风点火|多疑|诱骗|剥夺|虚夸|喧嚣|萧条|伤心|功亏一篑|屠杀|绷脸|贪污|纷乱|薄弱|恣意|孤立|丑恶|狂躁|淫亵|虚空|刻毒|痴呆|浮躁|奴性|错乱|未老先衰|凶暴|优柔寡断|摇摆|狼狈为奸|迁怒|惨白|轻佻|碍手碍脚|莫名其妙|往心里去|有问题|刁赖|蹒跚|砍掉|尘世|噪声|死光|使倒塌|无知识的|球触网重发|黑沉沉|闹大|佞笑|背债|唉声叹气|拉不下脸|没大没小|孤立无援|吸毒者|逼仄|讽剌之事|原子尘的降下|查抄|没用|艰苦卓绝|有害的动物|紊|打破|粗犷|愁容|掠取|一曝十寒|青皮|不纯洁的|使枯萎|偏执狂|使惊慌|不理|铲除|啮噬|令退役|歪风|不发达|鬼东西|罅漏|朽坏|不识|冷害|搅乱|冤仇|终止|被放逐者|滞呆|有一搭没一搭|殷切|发出咯咯声的东西|眼睛瞎调|囫囵吞枣|懵懂|横蛮无礼|撞击|无奈|痴愚|落架|不可思议的|怀疑的|嬉笑怒骂|焦心|叱问|中伤性的|限止|目不识丁|蹿火|干里娘操鸡麦|骂|闹得慌|措大|超讨厌|压抑住|大惊|悲悼|可怕|拉关系|冗长乏味的|郁积|殖民地|偷人|愚人|赔本|沉寂|死蟑螂|洗荡|颓废的|搞小动作|浮生|不光彩|命令|栽赃|没有好脸|棍打|虚话|迂见|猎取|无爱情的|疲软|拘牵|掴..耳光|荒野的|没有自信的|侵凌|遮丑|不断|无关宏旨|飘零|剑拔弩张|悒郁|欺蒙|用皮带抽打|批|难闻|留下伤痕|弇陋|赛人样|刁顽|欲呕|害虫|反弹|怨恨的|喋血|枉然|道德败坏|你他妈妈的|心情恶劣|挂虑|体罚|不对劲|狗嘴|正凶|争吵的原因|患精神病|臣服|尚未准备好|最低|密藏|嶙嶙|悬乎|未详细说明|予取予求|急切地要求得到|倒台|没品德|扑灭|触目惊心|龃|非正统|奸臣|狗眼看人|寻仇|冷战|鳞状|无所作为|侮慢的|疾风|戆|粗放|郁愤|无原则|一文如命|衰落的|陈规|删除|埋怨|跩个屁|魔鬼似的|壅塞|悲触|发疯似的|乱批评别人|辩论|面呈病色|私生的|讹脱|令人恐惧|神经的|患病|走后门|一无所有|牵强|棘手的|顺风转舵|急语|下游|盘剥|伪造物|我操|漂泊|食古不化|出没於|弛懈|主观上|挟嫌|惊怕|死德性|死党|倔强地|等着看|轻敌|赖词儿|没屁眼|不坦率的|代罪羔羊|愤世|痛苦的|大变革|麻麻黑|贱命|蠹弊|迷住|死不|虎穴|走下坡|诱发|砰地放下|撤退信号|不自量力|不确实的|摆弄|凄寂|世俗的|创伤的|玄乎|不景气的|不合群的动物|亏缺|烙印|折辱|酒醉的|难处理的|毒气|人面兽心|监禁所|使变酸|打倒|有缺点的|掩埋|跛子|蠢呆|执拗的|哇哩咧|紧急状况|生病|占着|流俗|淫书|急不可待|白忙活儿|愁肠百结|说反话|花里胡哨|惶惶不可终日|党阀|傻的|忍住|败叶|差错|因循|无帮助|撞死|逃避义务|灿怒嚣憎|龌|眩目地照射|提防|含蓄|噘嘴|塞人|看不上眼|闹架|肩摩毂击|现丑|直瞪瞪|争宠|极度|可厌恶的|无趣味|没心没肺|索贿|不清楚|乾旱|有伤风化|何妨|滥葬|暗无天日|暴敌|大声要求|荒地|异常兴奋的|批发|害怕|意义不明确的|无所谓|淘神|冷若冰霜|惭|浑水摸鱼|惊怪|唠里唠叨|哀痛|进退维谷|殷忧|心焦如焚|视同蝼蚁|凶恶的|无变化的|离奇|摇摇晃晃|更贱|假托|滑稽剧|谴|诧|八面圆|旁徨|屈伏|含恨在心|猛推|挂记|泥污|太迟|诳话|秃头|干瞧|吃重|不调和的|淫雨|不足挂齿|拘留处|无勇气|吞剥|内斗|播弄|入魔|邪念|独裁者|慨然|陋习|拉扯|穷凶极恶的|逼命|想不到地|流浪乞丐|疲沓|冷淡的|平铺直序|魔怪|心地不好|推却|酸腐|腐败的|左右两难|死鬼|对立面|安慰安慰|秘密的|世代结仇|不适任的|豪侈|长期折磨|苦干|朽木|凶|涩|驯化|混合|醉生梦死|邪路|腆|动魄惊心|丑老太婆|交恶运|灰头灰脸|叫喊声|杂草|对得住|压力|没去理会|民怨沸腾|耍贱招|失败者|晃晃悠悠|昏愦|破布条|好战者|谬种|云遮雾障|膻|严厉对待|歉收|限定|被污染|控诉|愁眉|诉苦|笨拙地说出|不怕死|倾斜的|动用|蚀坏|说|没出息|拎背|蠢蠢|不熟悉的|眼生|刺鼻|装屎|贫苦|同流合污|恶狠|气不过|裹尸布|脱误|堆砌|讆|砰然声|贪欲|吓人的|窟窿|脸上下不来|原宥|昙花一现|怒目|刀刃|溢出|怪圈|惜|一暴十寒|悬心|撒赖|局骗|苛刻的|会传播的|颤声|使离乡背井|使困窘|敝屣|大雨|敌酋|无准备的|禁欲|抓辫子|怀疑论的|研碎|妨害物|论调|攻击者|没轻没重|无依无靠|私货|恶|使忧伤|畏强欺弱|荒谬绝伦|失约|虚有其表|难控制的|严格|浊浪|假球|无实效|掉队的飞机|郁怒|不利的|自大的|废品|倔|不满意|计较|匪穴|惴惴不安的|令人恐惧的|拉忽|变模糊|伪|休克|迟疑不决|毁灭性的|面有难色|坏脾气的|无吸引力|令人悲痛的|絮聒|阻力|浮|憾事|刺激物|被撕裂|胡乱对付|始作俑者|无怜悯心的|懑|萧|忍心|羞愤|毫无目标|一面倒|名声臭|婆婆妈妈|缓慢的|砍得很深的伤口|为..哀痛|诮呵|生活艰苦的|撒泼|结合|结怨连仇|模棱两可的|污七八糟|无伴|多事|猴|心情不稳|不诚实|没品|压倒性|不文明|怕苦怕累|加负担於|无感情的|所谓|呆住|冷峭|炎热|使人不愉快的|挑三拣四|偷|严肃|海盗|对..索费|苍茫|猛烈|乏味的|受骗者|受罚|寡味|牛头不对马嘴|不高兴的|乱了方寸|臆断|挂怀|困在|拖欠|申诉|毛手毛脚|严重事故|峭|我咧看|隐密|毫无用处|使厌烦|絮|髒污|自食其果|洁身自好|糖弹|失去|我操你妈|口不应心|愤世嫉俗|未经训练的|圈拢|穿凿|不稳定的|忡忡|令人恼火|还会做什麽|生锈|无人|使对抗|大哭|挑毛拣刺|出乎|痛惜|浮躁的|指控|二心|勉勉强强|快枯竭的|埋伏|糟烂|滑稽的|护短|逃生|自称|厚脸皮|厚着脸皮做|不适当的|力尽|扭打|无意义|小器|袭取|使分隔|感到忧虑|使受人轻视|赌棍|错谬|冗长乏味|窃夺|黑蒙蒙|刺痛的|大而化之|他奶奶|凭什麽|精疲力竭|尚武|压治统治|冲动的|垂危|党魁|不合意的|怨命|独断的|管闲事|扯淡|来火|黯然神伤|发炎|无关重要的|危险之源|指摘|尖厉|抛脸|过多的|白烂|解气|囚禁|喷溅声|可耻的人|处..以罚金|使陷於|错综复杂|会传播|污的|冷汗|给我注意一点|自吹自擂说|恕|封闭式|饭囊|跩什麽跩|瞎吹|刺探|彀中|贪墨|玩火自焚|茕茕孑立|反常的|发呆|惯技|极无礼的|不可信的|拆除|易受|变色|粗俗的|不顾|抵赖|不甘|强制|无法投递的邮件|严格的|高昂|包袱|使蒙受耻辱|用手掌打|变钝|反对的|无趣|怪诞的图样|松垮垮|软绵绵|粗手笨脚|交战|过饱|伏兵|煞风景的|陌生|傻事|剥落|被当|不安宁|反社会|次货|诎|问题|抗辩|傻眼|横逆|并吞|丑话|送葬者|唠唠叨叨地责备|阴恶|辣的|心如刀割|恶性|取闹|使临险境|拿腔作势|不稳定|不能解决|自扰|沈重|阴沈的|使腐蚀|丑剧|褴褛|忌刻|把柄|恶有恶报|相反|死亡|有特权的|好事|以饵引诱|依附|压倒|憾|穷极潦倒|砍死|背叛的|伤人感情的|最後的审判日|不甘示弱|罪恶深重|赘疣|妒火|善变|烂老师|不明确的|扯臊|死老太婆|不知|阻碍物|干|惨绝人寰|蠢妇|逞强|板面孔|好不容易|无希望的|闷棍|骂人|后来人|不客气|碎布条|零散|屈枉|破掉|傻里瓜唧|外行|投弹於|入寇|使人不高兴|可怖|哀切|添乱|使忧郁|猪母|混江湖|严厉拒绝|没道理|邪气|官商|穷途|赊购|战犯|不可预知的|无勇气的|使衰竭|大怒|很烂|宣告非法|不平静|不俭省|归罪|可叹|诡计多端|彻底失败|做霸占行为|粗俗鲁莽|亏折|高压政治|气愤愤|破坏活动|面带嗔色|鬼话|劫数|架空|闲闲|唉哟|攻占|累牍连篇|哩哩罗罗|把关在栏内|陷危|没有教养|搞台独|憨|惊呆的|懵懵懂懂|作低沈声|依违|弄髒|干上|斤斤|不起眼儿|没得说|捕捉之物|耻骂|狡诈的|败德的|短少|干傻事|进退两难|犹犹豫豫|给我死|混帐|覆辙|阻遏|低於他人者|挥霍无度的|挤得水泄不通|失密|刮掉|沦为|乱语|猾|急扯|陵夷|体衰|使失去感觉|抠唆|气死人|万箭穿心|扯皮|冒功|够了|黔驴技穷|诡诞|没有观察到|啬|蹈袭|紧拉|治罪|诶|老奸巨滑|横死|陡然|蚕食鲸吞|使受到伤害|讶然|烂到爆|凶气|盗版|使饿死|不公平的|判刑|打一打|忿忿然|难达到|违建|冒火|逃走的|行不通|复|坏心肠|变态者|怪|反咬|屌啥|败仗|孤孤单单|不易|薄田|使失常|疏松|愧恧|成废物|逼婚|轰动一时|鬼蜮|不大可能|不更事|媚外|妖言|不了|私图|正色|操你的|蔫头耷脑|钝的|屠戮|溃灭|粗野的|酸味|使落空|有条件投降|言之无物|变幻不定|瓜分|扯谎|可叹的|废旧|忧心忡忡|漏丑|油乎乎|超过|？惶|亡命之徒|过分单纯化|呻吟|怎麽这样|孤立的|刻薄的|噘着嘴说|通货膨胀|屁滚尿流|头皮发麻|雪特|疾驶|得罪人|叫喊|带塞|引起不舒服|冷冷|其貌不扬|对立者|钻营|用话刺痛|发横|窃听器|非法的|反驳|无慈悲心的|叛逃|老不休|真是烂|赔帐|使变丑|人祸|无动於衷的|无心|系|极度地|低沈|超自然|痛不欲生|难以置信的|不规则|恭维|鬼胎|谋私|无人问津|凌夷|屁用|感伤的|艰巨|难耐|安静下来|高不成|不光明正大的|诘难|衰老的|淫|好高骛远|疏远|墨吏|禁忌的|硬背|没把握|僻陋|悖时|易烦恼的|坏人当道|轻看|嘀咕|咒语|宣称|可厌恶|牟利|臭娘们|久坐的|贪污的|骚乱性|告吹|死样子|使腐朽|不起眼|一帮|意马心猿|死|于事无补|颠簸|怕|惨无人道|冷嘲|朝不谋夕|败亡|火灾|松松垮垮|电击|喝斥|如临深渊|气焰嚣张|兴风作浪|头晕的|直勾勾|失去..|戒惧|囊空如洗|僵直|奶声奶气|推诿|哗然|失业|猛地|生事|疏忽的|破罐破摔|下暴雨|献殷勤|不平静的|破产了|严厉批评|欺诈性|婉拒|杂乱的一团|缈|鸡毛蒜皮|残疾|窜逃|未触及|幽忧|剿说|不堪造就|学识浅薄|黑哨|杂碎|大惑|不合逻辑|非难的理由|脾气火暴|文弱|受辱|反动分子|抄你爸|乱虐并生|性急|烤焦|哭夭个屁|溃不成军|假货|悲天悯人|空空洞洞|丑死|碰击|对..感到後悔|败家子儿|有口无心|吆三喝四|贼窝|哭着使..|暂时|预谋|使性子|撒尿|负债|坚硬|使变暗|残部|风凉|迷惑的|艰难曲折|罪有应得|摆份儿|颛蒙|丑类|缺乏幽默|乌压压|惹的祸|遗失者|消耗热|败诉|随口泄漏|科盲|摇摇|反常现象|唉呀|文侩|侵犯人身|出笼|猛地关上|易碎|听任|被弄髒|骗术|逃窜|愦|中饱|不平坦的|蠢女|家贼|撒野|强烈抗议|不明|遇难船|不可逾越|蛮缠|阔少|罔|闹哄哄|使粗糙|惊觉|空文|拔尖|剧烈的|不合格的|暗事|溺死|使道德败坏|被干走|感到遗憾的|傲慢的|无志气的人|未知的|失笑|下层社会|嗤之以鼻|一个屁|威厉|朝..反冲|被瞒|遭灾|怪异的|没救|无底洞|已过盛年|挂心|稀松平常|算你厉害|迂夫子|砍断|冷风|魔女|寂|抱不平|不讲道理|可笑的|有瑕疵|绞痛|烂上万倍|扁你|惨事|凄然|不容易的|临时手段|家务杂事|讹舛|忘恩负义的|枪替|轻举妄动|潜踪|捞摸|虚虚实实|陨落|痛处|真是蠢|非婚生子女|举反证|崎|目光凶狠|未定|误差|严重地|未获情报|累卵|变味|贼心|病疫|质次价高|搀假|滥打|随随便便|虐|隔膜|草包|牵挂|嗬欠|人渣|伶仃|无争论之馀地的|扣押|幽寂|迷离|利用人|片断|饿馑|使疲倦的|摆阔|得逞|伪人|炮制|不必要|捣碎|空耗|阻拦|碰运气|浪|一枪毙了你|叹息|甘你屁事|欺生|无实质|紧急需要|白目|步入歧途|中断|碰伤|禁止|被害|内忧外患|避开|死不认帐|胆小鬼|喜新厌旧|贩毒|伤风|负|暧|赌注|攻击性的|耍贱|使极度激动|置辩|诽谤性|干屄|未决定|病夫|烦死|俚|度量小|脸红耳热|致死的|闷闷不乐的|末流|细小|表面性的事物|疲倦|头晕眼花|传染|伤悲|好争论|剧毒|令人费解|不切|孑|谬见|矮小的东西|鲁莽行为|涝害|威势|不得了|啜泣着说|海洛因|垂怜|使局促不安|急躁的|不济事|微瑕|铺张浪费|不欢而散|直盯盯|无根据|愚暗|买通|丢三落四|敢冒|雕砌|撕碎|使产生纹裂|不省人事|使短路|食人者|琐碎的|学坏|拉下脸|割破|使服从|虚拟|筋疲力尽的|呆痴|嶙峋|未决定的|不透明|丧钟|未雨绸缪|趄|憋得慌|死缠|臭老头|坚持己见|使分离|记恨|愣住|紧拖|挥泪|嘴皮子|败谢|死爱面子|丧魂落魄|废人|结结巴巴地说|肠肥脑满|高价地|不喜欢|面如土色|现眼|臭屁|死爱|沾沾自喜|弹劾|紧|乱吃|凑什麽热闹|依赖的|钳制|伤残|混日|人不知，鬼不觉|笨手|木头木脑|牵肠挂肚|瞢|绷着的脸|沈寂的|骗人的|馋猫|淡然|苛察|兽性|实属不易|死色呸|吵起来|巧言令色|变暗淡|犟|喧扰|托辞|忍受|不待见|不怀好意|捕捉|你他妈的|容易受惊|噍|插嘴|好唠叨的人|愤慨|激潮|老弱病残|浮词|为难|媚骨|砰然作声|使疼痛|小丑|呐喊|拉拢|扯破的洞|懦夫|逃掉|不够|元凶|群氓|慵懒|乱讲|不值钱|威逼|爱小|集团|榨出|伤心事|好不应该|僻|为什麽还|起风暴|自命清高|不知羞耻|漏卮|使行为不端|畏葸不前|病句|横蛮无理|号丧|无助|窠臼|权术|反覆无常|铤而走险的|闹僵|葸|自认|荒淫无度|艰苦的|要死要活|漏出|冗余|使起纠纷|魔怔|装窃听器|结结巴巴|挟制|机八事|牲畜|执性|平常|周恤|贫弱|霸王|陈腐的|犯怵|迷乱|钻牛角尖|不合法的|沈郁|寡合|臭气熏天|梗塞|难处理|侉|不能想像|悲惨|使对立|依稀|控制|罪迹|惊怖|抓得之物|好责骂的人|冷笑|置疑|哇哩|伤感|长舌|使不平|仗势欺人|回头|难耐的|昏君|挖空|丢掉|变黑|令人无法忍受的|令人厌倦|靠幺|迟延|阴间|质疑|格外的|知法犯法|瞎说|打人|火|无动於衷|不择|低|壁障|清规戒律|变幻|中魔|诱拐走|心软|晦气|断掉|犀利|毙了你|分离的|捉襟见肘|强迫的|贪小|游击|轻淡|不合算|害|王八羔子|倒底要怎样|淫乐|暗讽|湮没|苦味|无厌|被雷打死|隔开|哀诉|含悲|故态复萌|变坏|虚度|求解|降格|贫嘴薄舌|颓然|大吼|忿懑|疾病|震动|误会|委靡不振|设伏地点|瞑|怎麽搞|仿冒|暗淡的|毫无|溜须拍马|麻烦事|臭酸|懒得|逃避责任|报怨声|魑魅|吵吵闹闹的要求|费解的|无效的|致污物|大失败|同伙|使存偏见|帮伙|怨詈|勉强的|感到极度痛苦|怎麽搞的|挨打|用尖锐|伪造的|违命|使疾走|什麽德性|少惹我|无事自扰|冻伤|起哄|捉摸不定|迷信的|喜欢吵架|阴惨的|病恹恹|想抢走|臭狗|莽莽苍苍|糜费|难以捉摸|逆行|吵子|黢|利用|灾年|贱人|虚荣心|狂热|不真实|盗寇|劣迹|焦痕|使落入圈套|蒙哄|说反话的|得鱼忘筌|押往监狱|索然|视同草芥|异常兴奋|去去去|贼|坏的|昧心|妄念|自危|邪说|吃心|心神不宁|老谋深算|冒险的|不念旧恶|至死不悟|目无法纪|宽纵|诟骂|痞子|不正常|瞎的|疯人|寥寂|评头论足|未受制止|强压|平凡|变深|水泄不通|使沾上泥污|叱喝|菜鸟|谤议|乱扯|刺伤|被控犯罪的人|险症|窝点|遁辞|星星点点|积郁|缺心眼儿|稀巴烂|老顽固|耗尽|朦胧|打烂|轻蔑的|好战|阴|子弹|喧闹声|悲伤者|灭迹|污迹|操你妈|诛除|强打|毁掉|闪边|精神上的打击|世界的末日|忌讳|神经紧张|乱乱哄哄|困厄|竦|疯狂般|没精|苟活|搞啥鬼|大惊失色|被动性|离乡|使绷紧|死玻璃|声气相投|说含沙射影的话|作恶多端|烂肉|以讹传讹|粪土|好挖苦人的|魔难|忸怩|极可憎|苟安|杂多的|绕脖子|一败涂地|悲怆|过份|遴|秽气|逃走的人|真蠢|有害|分肥|停顿|悲惨的|拙|那麽烂|僵持不下|哄抬|混乱的|摇晃着行驶|剩余|贪吃|谋得|宥|顽强的|掀风鼓浪|乱叫|最後通牒|战斗|摩肩接踵|一错再错|安抚|厚利可图|气|陷井|使有成见|鲁|抽筋|要饭的|不注意的|减色|浓烈|挟怨|锁链|嗜杀成性|裂开的|玉石俱焚|不清洁|亡羊补牢|反对改革|未知的东西|跋涉|抱怨地说|胸无城府|浮报|发展迟缓|狗熊|无名小卒|外行的|浇漓|烦燥的|衰老|爱理不理|击败|坐监狱|悲观失望|乌洞洞|浊流|与..斗争|阉割|窟穴|欠妥|含糊不清|馋鬼|微末|后台|困难的|喧天|私欲|厚脸|除掉|讨厌的事|粗鲁的|外祸|破铜烂铁|使沈溺|摆脱|怆恍|损人|易变的|长的丑并不是你的错|没事做|戆头戆脑|娇纵|解雇|凶耗|败局|无资格|亏马子|违章|任情|衰亡|谴谪|成问题的|无生命|掺假|淫棍|无形的东西|无法解决|何尝|跩什麽|聋的|使极苦闷|无礼貌的|武力|人身攻击|滞後於|受屈|擅权|去你的|那麽干|一塌糊涂|荒瘠|极权|嫌怨|无德|颐指气使|发出刺耳|伪人之心|大小姐脾气|盗世窃誉|警告|重现|暗地里|傲脾气|杂草丛生|命运注定的|阴阳怪气|你她妈|面面相觑|难信|扭扭捏捏|干！|不结果实|怂恿|讳疾忌医|自吹|未中|漏洞百出|凛然|刮出|缺失|没劲|过时的|三天打鱼，两天晒网|女流|一锅粥|冻害|凄厉|不明确|怒气冲冲的|嘲笑的|污渍|危殆|无智的|有成见|冒有风险|恼人的|哭夭|烂人|不出场|虚掷|饥色|使受毒气影响|各奔前程|见怪|剉小|凋败|裂口|妄称|唐突的|根本就|死气沈沈的|不好卖|真干|开口子|固执的|尖锐|难取悦的|他马的|眼花的|感觉不到|痛哭流涕|破坏..的基础|残酷的|忘不了|极残忍的人|拒受|妖怪|炎凉|饥不择食|使降级|沓|钻头觅缝|奴隶|违反的|薄情的|磨难|小卒|笨拙的处理|反托拉斯的|罪人|名过其实|缺乏兴趣的|憎恨之物|鬼混|唆使|告发|皱缩|无理由|哇靠|簸弄|窳劣|矜持|滚回去|多心|心机|扯白|空想家|黔驴之技|什麽世界|让人讦|缠磨|惊人的|趑趄|上台|怀有恶意的|断开|心痛|迷宫般|没良心|不合宜|独夫|吃瘪|加油添醋|疑惑|卑俗|逼人|高价位|误诊|被逐出|自扫门前雪|不美的|无记名|过了气|陵轹|惩罚|伤心死了|发育停止|患精神病的|油腻腻|不以|搞什麽玩意|獪|耍弄|阻止|支解|初出茅庐|砍头|暗下|混吃混喝|悔不该|凶什麽|不成器|开除|荒野|乾燥|妖妄|挂累|横事|世俗|自疚|倒赔|诃|受难者|误传|有义务|台独|沿袭|情况不好|拒绝承认|反诬|轻飘|轻|淫风|激进|一掌|悛|险要|纠合|倒运|裹乱|发出砰然声|被害者|乱离|宽假|宣布脱离关系|生恐|害人|重演|奴才|凶猛|盗猎|孛|不可预测|久经世故的|病根|被侵蚀|一蹶不振|费力地做|走开啦|起纠纷|钻心|不说话|毁灭|不灵巧|兴叹|嫁祸于人|不忿|削掉|虢|黪|迷迷糊糊|不服从|封锁|手无缚鸡之力|舛讹|被损坏|干恁娘|蠢驴|砍落|豺狼成性|狐疑|萧疏|急急忙忙|不协调|对抗力量|惰|惼|不行|搞小圈圈|阴险的|变得不愉快|狂悖|劫夺|兵燹|反动主义的|蹉跌|不愿意的|冤府|有缺点|包围|无证据|停滞的|庸人自扰|陈词滥调|感到抱歉的|吃罪|破坏心情|脱口说出|大失所望|一钱如命|揭不开锅|扑腾|倒塌|耽误|漏网|差役|愣头愣脑|使纠缠|掺杂的|使失去|老年|遗漏|乱成一团|心烦意乱|孩子气|内外交困|饶恕|退学|见死不救|视同儿戏|髒话|虚言|急|唠叨|顾虑重重|迫不|不能信赖的|水中捞月|失血|没有经验|穿窬|生惧|惹毛|不三不四|如兽|不成比例的|残暴的|伏诛|不怀|无子可动|亡命者|叵测|乱搞|说胡话|暴戾之气|大量杀戮|一无可取|脾气急躁|滋蔓|兔死狐悲|涵蓄|等不及|提心吊胆|不留心|老死|扑朔迷离|急忙地讲|天真|生活艰苦|带衰|义正词严|心机很重|猛吃|瘸的|迷恋|无资格的|做假|唉唷|为耻|冒进|不修边幅|短促频繁地乾咳|使分心|王八蛋|僵痛的|大错而特错|意外的|打劫|烦忧|漫不经意|惹到你|贼眉鼠眼|使不适|浊重|阴谋者|放火|撕破|使委屈|无助的状态|恻隐|颓废者|赘述|鸡蛋里挑骨头|犯讳|坍台|变得冷酷无情|哄弄|无可争辩的|漠漠|陡然下降的|徒劳无功|错案|孤苦|僻静|哀恸|货色|愕|酷|贫瘠的|乱嘈嘈|毵毵|不流动的|现世报|八面光|惶急|责骂不休|缺乏兴趣|神经病的|狷|委决不下|凹陷|非自愿|拖着行进|罢课|沈重的步伐|凭白无故|烫痛|见不得人|扼制|搞封建|装可怜|发出撞击声|斑块|不足道|斗臭|大闹|肉脚|瞧不上眼|怒形于色|戕贼|于心有愧|憋拗|搞得|塌台|嘴敞|入迷|窒闷|醉醺醺|膻腥|蒙受耻辱|模棱两可|大海捞针|何苦|怜恤|给我小心点|嘴巴放乾净一点|为害|要被当了|偏斜|狼奔豸突|死棋|单|清寒|傻乎乎|游击队|搞糟|名利|悲哀|约束物|使隔绝|磕磕绊绊|绝|素不相识|放射|黑货|冀望|发展迟缓的|狡猾的|迷恋者|刁钻古怪|偏私|斯文扫地|憝|易损坏的|迂论|不厚道的|酷热|非真正|打入|猪就是猪|玷辱|使陷危|全无|异|不守|哄抢|不分皂白|充满危险|可怕的人|弄糟|恶行|疯子|赤裸裸|降祸|情何以堪|噱头|保残守缺|一波三折|流眼泪|眩目|耸人|惊疑|抖颤|敢喵我|撒刁|着急的|断送|窘急|蛇头|使身心交疲|致人死命|烂到极点|磕头碰脑|感到难过的|目论|偷东西|令人疲倦|使潜入|稀里糊涂|隐约|妖物|不得要领|灭绝的|赔钱|烂|冲击波|麻|打仗|紧急|阻挡|有毒腺的|轰动一时的|惨白的|硫化|仇人|使磨损|下毒手|冻馁|躁狂|越境|食言而肥|溜号|苦事|临时|捏把汗|使消沈|侥|性情急躁|碎|伪善者|多嫌|除害|困难重重|损失惨重的|认头|沈没|劈啪|无礼貌|咒|水雷|毛骨悚然|爆炸|沈重的责任|老到|迷信引起|无怜悯心|不堪入耳|死有余辜|无礼的|占去|饱食终日|泪珠|厌|官腔|令人怀疑|使枯竭|鼓吹|不共戴天|吓到|相反地|懒得理你|板荡|闯祸|蠢男|脾气暴躁的|冗馀|未加抑制的|干你娘老鸡麦|哭笑不得|老年的|败绩|莽撞|慌忙|不愿|老巢|阻绝|痛斥|捉贼|暗流|诱惑力|丝毫|快枯竭|造成损失|专横的|贼骨头|粉无聊|姨太太|不会的|僭|尖着|被驱逐|卑躬屈节|银根紧的|功利主义|魔鬼的|怏怏|次级|晕头转向|疤痕|你以为你是谁|东骂西骂|土崩瓦解|交困|使不舒服|惹上|赌钱|劣根|不周到|华|没收物|有屁用|受伤的|文痞|不好|对..采取破坏行动|你死我活|见风使舵|自卑情绪|苛待|批评为|偷生|小气的|吊儿郎当的人|令人遗憾|装傻|丑行|随口|懦弱的人|闯入|望梅止渴|不洁的|漏税|逃票|肥肉|贱民|诅|脓包|无效|精神不振|法西斯主义者|欺世盗名|臃肿|一怔|逮捕|凉|没味|流浪汉|超然|差异|无伤大雅|无意义的|打骂|讨厌的人|唱反调|在..中加入脂肪|不好客|劫掠|不自然的|疲敝|无教养|超标|泛|混淆黑白|巫术|国仇家恨|气死ㄌ|自由心证|打高空|当道|好屌|无为|特困|伤心惨目|灾病|咂嘴|避债|衣衫不整|兔子不吃窝边草|歪斜|费用大|淆杂|秘教的|无恙|不成比例|使麻木|毒|逆着|看你娘卡好|不觉|撵走|微愠|肉了叭叽|惊惶奔跑|动肝火|抽噎地哭|白痴般|高难度|坐探|惊骇的|不到|惟恐|鸡犬不宁|靠腰|不可爱|呆若木鸡|稀烂|更恶劣|窒息而死|与世隔绝|亵|丑史|否定|幼稚的|太闲|拗|变丑|交战的|争斗者|刁|反冲|仆人|赤地千里|不足之处|粗糙地|含糊其辞|不足取的|放荡不羁|羸弱|西崽|飞贼|顽敌|未触及的|溘逝|不直截了当|乱骂|狠|才疏学浅|假道学|漫无目的|崎岖不平|拉出|乌合之众|凹凸|未被通知|覆亡|惛|无所不作|绷|使痉挛|憋着|硬挤过去|疑问|一场空|厉鬼|大失|小时了了|阴险人|无争论之馀地|不经|萧森|流寇|不予置评|蹭蹬|迷路者|割断|剧烈|别嘴|上瘾者|僵尸|使腐烂|很气|绝不|法盲|服丧|索费|打偏|惊叫|染指|前呼后拥|粗里粗气|无精打采的|欠打|腻|匆忙|恶名昭张|不到黄河心不死|奢|如鲠在喉|养不起|粗涩|衍|病弱的|攻讦|瞎了狗眼|暗笑|严峻|含有特定意味|发臭|翻脸|晦暝|尖刻的|压误|弄乱|忧虑的|罪孽深重的|班房|畏难|凹种|失控地|埋地雷|绝对的|变天|编造|麻醉|不确实|哼！|断裂|不许|戾|腐化堕落|效颦|脱离联邦|戳脊梁骨|全无的|落选|离群的动物|不平均|叱|古里古怪|毫无办法|溅出|完全丧失者|好斗|开炮|成心|敏感|坐收渔利|减缩|处於不利地位|讹谬|宠信|病的|失足|令人不愉快的|厄境|巧立名目|迫切需要|篡位|未知数|荒诞不经|淫辞|骇怪|牙碜|使错综|不经济的|费工夫|行为不良的人|丧心病狂的|矮小的人|草木皆兵|不遂|画蛇添足|烈性子|弥天大罪|耍狠|卷入|混战场|下狱|造成破坏的|乱吹牛|障碍物|倒胃口|交恶|废弃的|背地里|痴子|迷漫|疯癫|说教|搞违建|无奇|刻舟求剑|不调和|他奶奶的|不牢固|不能医治的|狠骂|使不能|藉口|没头没脑|色迷迷|敲骨吸髓|打屁股|悔之不及|辛苦的|白衣苍狗|从心所欲|砰地落下|干休|超出|自相矛盾|使恼怒|幻异|流里流气|使处於不利地位|放任自我|沾污|磨损处|鸟东西|迂回的|年老体弱|翻腾|宿弊|伤生|不就|损|食而不知其味|小手小脚|不落忍|不过意|伤残退役军人|打家劫舍|惊人|不真诚|强逼|菀|乱蓬蓬|沮丧的|狂气|无策|一味|不上算的|乱吠|吵吵|无利益的|愁怀|贸贸然|憔悴|充满危险的|情急拼命|木雕泥塑|经受不起|为..报复|孤寂的|刺棒|发劈啪声|胡子拉茬|鬼鬼祟祟的人|压坏|虚幻|宦海|嘈杂的谈笑声|板着面孔|无益的|不关紧要之事|拉不下脸来|无形|说粗话|怨嗟|塞责|吓呆|枪毙|多刺|笨头笨脑|溜门|易受骗的|诬赖|毒打一顿|驳议|舛|风流|以诱饵吸引|打退堂鼓|怆|狼吞虎咽|恸|眼花|扯破|多变|包容|自作自受|费心|少不更事|枉|愠|夸张的手法|夹带|恶狠很|用枪射击|要吐|皇皇|不加思考|使便宜|超越误差|野兽|害怕的|你是怎样|使生气|猥|骂大街|堕落的|击退的|哈巴狗|乱民|悔之无及|邪门|嘻嘻哈哈|说不|竞争者|搥胸顿足|微暗|配不上|索寞|遗赠|白党|徒|附逆|苛政|看低|恶感|太虚|懵里懵懂|口臭|愚行|无意|大灾难|竟然|无度|进搀|分化|坏运气|闻出..的臭气|嘴贫|大嚷|无耻谓之贱|炫惑|代沟|躲避责任者|使作呕|最差|清算清算|冷静|白云苍狗|使破烂|沽名钓誉|冥|冷酷地|旁骛|地主|看了就有气|嚼舌|何苦来哉|袭击|窃国|死期|怖|消耗性|做错|匪谍|撞墙|非生产性|空|悲恻|被沾污|没法子|满得溢出|脸上发红|冗笔|背地|小捣蛋|堵|没收|申饬|不近人情的|化石|不成熟|患..病的|犯了罪的|鼠胆|附和|丑|秽语|拉近乎|使不得|抗议|弥天|故意刁难|干号|拉紧|过热|笨|乱屁|硬挤|刺针|遏止|使贫困|不健康|搆陷|被诅咒|绞尽脑汁|可惊|改变改变|无希望|干你全家|占着毛坑不拉屎|差误|衔恨|屠宰者|妄说|损己为人|挥霍的|叫屁|追悔莫及|怒气冲天|中止|气粗|官僚主义|落後於|高慢|小便|尖声|庞大|赖|背道而驰|气壮如牛|过气|顶罪|独断专行|蕴藉|怀疑|摆谱儿|最跩|骑墙|疲倦的|得不到休息|变种|使失效|隐蔽处|战祸|年久失修|蠢翻了|秘密|冲昏头脑|躲开|装蒜|吃货|发出刺耳声|可笑|赶走|充公|低级庸俗|凶荒|行为不礼貌|之耻|无家可归|不才|害羞的|生造|内难|不受感动的|哭泣|案底|偏安|浮泛|在..上蔓生|引起嘲笑的|渗透|令人厌恶的|居功|不识字的|变酸|夸张|摇动|熬煎|弄污|无凭无据|二把刀|奔窜|不流行的|难以明了|心神不安的|攘攘|仗着|该罚下地狱|胡乱地涂|给我注意点|惊叹|使窒息|反动主义者|临死|唯我|不正|发出尖锐|支配|无用的老马|使陷入困境|不美|难捉摸的|惯偷|漏电|感冒|闷|败露|凿空|叫苦不迭|欺辱|哈欠|谄笑|婚外|私党|发配|脾气暴|无人遵守|悖妄|一偏|明抢|误|求全责备|掎|失算|饕|显摆|懒惰鬼|闲言冷语|一钱不值|一般杀人罪|无口才|权势|无深虑的|对..提出异议|逆子|咬住|不舒服的|不谨慎|作践|暂停|战斗的|内忧|疏放|用臭气赶出|麻木不仁|令人伤心|悲伤的|多风暴|不坚固的|陡然下降|静僻|刮落|磨损|横渡|有罪的|病菌|气鼓鼓|痛骂|偏护|蠹虫|贪赃|权宜的|白卷|债务人|作色|置之不顾|恂|臆测|塞满|蔑称|罚款|羁绊|心急如焚|猛撞|风声鹤唳|假冒品|有缺陷的|乱说话|不经心|烦死了|毫不客气|不加思考的|大浪|将..逐出社会|缺|污浊的|可争论|茫然的|官倒|爆震|叫喊着说|裹挟|侵权|水性杨花|变阴暗|漏做|出没|有顾忌的|不在意|震颤|严重的|任性的|冷箭|哓|满不在乎|反垄断|不毛|羞於|无涵养|草芥|自我中心的|怅然若失|乱哄哄|事态|不赞成|竹篮打水|非常饥饿|恨的牙痒痒|心慌|犯了罪|回绝|按兵不动|情节剧似的|使隐退|野心勃勃|错怪|焦炙|蹰|张牙舞爪|使烦乱|窖藏|千变万化|人为财死，鸟为食亡|尚未准备好的|黑手|娇羞|恨之入骨|令人烦恼的|慊|阴奉阳违|突然地|如临大敌|不经之谈|错讹|抱恨终生|费时|难吃|冷落|骇|生疏|心如死灰|多有微词|歪道|喧哗吵闹|恚怒|狡诘|打算|不可思议|被动式|凶相|无事生非|淘|习性|繁重|倒帐|你妈|真是够了|过分拥挤|生拉硬拽|使变得不愉快|够了没|不平等|助长|熬磨|冗语|一下子爆发的一连串|甩都不甩|丢弃|偷懒的|冗繁|冒充者|辐射|长夜|发育迟缓|不足|滚远|油头滑脑|无知的|米珠薪桂|不屑于|过少|残兵|开后门|暴动|鼻酸|悍妇|等闲视之|谋划|阙略|不见|发呜咽声|案犯|弄跛|无规|柔肠百结|打赌|加油门快速前进|杀机|泡蘑菇|极度渴望|谁死谁亡|不合情理|琐屑|恨你|不快乐的|毒腺|心地不好的|不亲切|孑然|发臭味|从犯|低头|不知恩|气忿|法西斯党员|打入冷宫|对..沈下脸|结疤|生变|卑陋|与..作战|使孤立|不稳|贪婪的|困人|与..断绝关系|苦心|盲从|看风使船|大块呆|残暴的行为|对得起|诡密|心有馀悸|坐视不救|清理债务|僵|刀俎|功利的|无关大局|令人讨厌的人|变革|小小不言|黑|不好用|拍拍屁股走人|犯事|无慈悲心|啰里啰唆|未发觉|逆产|赧|不足为训|生气的|止步不前|割伤|消失|不合|覆灭|剽取|腐臭|巧言利口|无所用心|铁血|穷困潦倒|搞阴谋|叛卖|最低水平|与..脱离|杂遝|寻衅|无效能|咯咯|悭|转蓬|勒赎|出手阔气|讨人嫌|酒醉|穷光蛋|滥打人|率|朽败|视若无睹|不易了解|嗜杀成性的人|充满危机|牢笼|披靡|紧迫地|鲨鱼|来路不明|波折|对..突然查抄|没有经验的|暴戾恣睢|横征暴敛|听天由命|挖掘|掌击|靠北|弄坏|悲鸣|岌岌可危|巢穴|只顾自身利益|从..开小差|轧轧地作响|冒牌货|自夸说|绝对不会原谅你|极坏的|含胡|退出|隔绝|挂漏|巽|浮名|使折断|惧怕|使变陈腐|死心|疮痍|不可逆转|哈喇|党羽|憷|用拳猛击|暗里|严肃的|令人困倦|基础薄弱|责怨|喊叫声|阴黑|诞|地雷|大惊小怪|使成孤儿|燃烧|火爆|妖冶|老子|可厌|憔悴的|世态炎凉|变得束手无策|搞关系|臭功夫|找麻烦|疲累|魂不附体|掺杂|无可无不可|视若草芥|欠扁|奸雄|残喘|逼退|恻|算计|棼|瞠目结舌|粗拙|使遭危险|悲愤|极残忍|多此一举|搞政变|意意思思|谢绝|干你桌来|绝望的|倚仗|伤风败俗的|苦|逞威风|瘅|堪虑|不牢靠|冲口说出|激战|失败的|垫背|突袭|很屌|感到可怜|茕|成空|蓄谋|踹开|白费的|敌对的|隐性|突如其来的|忍让|狂热的|诛灭|习气|无遮蔽|无准备|藏刀|瞎话|成性|伪劣|变髒|谰言|屈理|杯弓蛇影|惊愕|放肆的|现世的|不得已|不舒适的|坐待|耍脾气|眼皮子浅|怵场|杀人不眨眼|白丁|不显眼|唯利是图|狐疑不决|高傲态度|眼睛狗到蛤仔肉|胡吹|欠干|现出愁容|野|搞得一团乱|受伤|枭雄|隐形|残品|翻船|使紧张|诡密的|穷境|妄自菲薄|实利的|违反行为|心焦|贼头贼脑|大小便|深恶痛绝|不容|无表情|凄切|屌儿啷当|寒微|蒙混|一肚子气|灭绝人性|雕饰|枷锁|惨杀|没才华|穷奢极侈|羡慕|笨的|被俘的|不愿意|不合适|慌恐|搞下去|不安全的|无权的|长期不和|难上加难|使愤怒|严酷的考验|顽|惘然若失|窝藏|吃饱闲闲|怪诞|不知不觉|延迟|没好气|老派|无能为力的|无礼的人|违禁|悲观主义|使狂热|气哼哼|令人窒息|偏|舞弊|太过自信的|猪头|沈默|自弃|头目|行窃|死蚊子|哀怨|外强中干|背静|以偏概全|发毛|抗拒|恶煞煞|可忍受的|外伤用|糟|愚民|喷粪|变得模糊|偷偷地行动|逃税|穷|逼退回|绊脚石|狞|皱眉|塞你娘鸡吧|不够的|以貌取人|微不足道的|易变|不确的|灼痛|不定的|默默|反击|清苦|滞|箪食瓢饮|疑难|久经|臭美|肚量小|侏儒|出局|逞凶|槁木死灰|畸形的人|什麽态度|哗众取宠|爆炸性|乱子|横着|找碴|耍奸|发红|齿冷|说谎者|厚颜薄耻|成为障碍|人不为己，天诛地灭|不景气|轰鸣|浪费的|扼死|受阻止|动手|难看的|冤苦|体恤|毒蛇一样的家伙|似乎|准备参加战斗|使发狂|虚情假意|不辨菽麦|使用计谋的|以为不可|倒爷|四处觅食|没脑袋|陷身|久经世故|沈重缓慢|无聊死了|泪流满面|孟浪|幻想|怯|滥砍|可有可无|僄|嫉羡|有罪|不必要的|增剧|随便的|烂家伙|戟指|驶你母|遇刺|不如人意|乱批评|搬弄是非|奸细|武装部队|一掴|卑微的|吵死|恨铁不成钢|马大哈|变复杂|透露|险象环生|蠢蛋|肢解|怒潮|混杂|被遗弃|贼溜溜|证明..是虚假|兵差|出乎意料|贱命一条|未被|等着瞧|小家子气|使休克|草菅|颛|哀叹|贩私|多阴雨|公私不分|乖舛|有难度|冷静下来|撺|惨境|不对付|患者|错的是你|隐退处|试尝辄止|不问青红皂白|鄙称|动荡不安|笑骂|喷出|稂莠|俗套|拦路虎|大叫大嚷着要求|发出呻吟声|男盗女娼|不道德的|不恰当|盗骗|直呆呆|衰弱的|危害物|难办|不可收拾|不均等|使脱轨|使起皱纹|自以为|屠夫|绊脚索|苴|强盗罪|警惕|没完没了|忿恨的|仰赖|含恨|使敌对|不要脸|迷途地|狷急|歇斯底里的|破口大骂|欠完善|砰然作声地|有失身分|欲坠|走散|不知的|未经检查的|篡权|很丑|漂泊的|游街示众|贫穷的|反派|浊|长长短短|灰蒙蒙|烧毁|食人|痴愣|使加深|用不着|恶事|狠命|抢占|枝蔓|可作两种解释|勒死|震|放弃权利|不相上下|枯寂|抓住|兀突|贫困的|使伤残|惹事|爪牙|伎俩|呶呶|脚步沈重地走|背谬|使恶化|惨剧|做坏事|发软|聒|信口开河|不堪入目|傻|磨坏|痈疽|使气馁|剽袭|对健康有害的|回避|不整齐|象征性|受损害|憋|厚颜无耻的|呆帐|敌特|逼走|黑暗的|绑匪|有恶意的|白白|阴霾|来之不易|秽闻|处於支配地位|失调的|下跌|蔑|骇人听闻|使钝|使离婚|被驱逐的人|掳掠|歉疚|无休止|零|虚诞|坑坑洼洼|不守规矩|不顺当地|愧对|令人不愉快|供给..过强|一肚子坏水|不安全|耍心机|夙仇|孑然一身|心惊胆颤|大祸|油嘴|溃逃|蜕化变质|昏天黑地|不平常|昏昏欲睡的|拳打脚踢|威力|惴惴不安|渺渺|嗔斥|有恃无恐|起阻碍作用|暧昧的|最坏|嘲谑|抗辩的|讳言|敢骗我|使贫穷|一手遮天|令人窒息的浓烟|跺脚|紧急事件|浅学|豺狼当道|次等|自不量力|触礁|干瘪瘪|神经过敏的|使失去光泽|澹然|弄复杂|泄劲|恶魔的|困迫|逃学|云谲波诡|一簧两舌|可怜的|悲观地|阙陋|严冷|半新不旧|预示..的凶兆|嘲笑着说|潜行|驳斥|愕然|每况愈下|雨打|生恨|暗|不务|冤家|脏|头脑空虚|污名|懒洋洋|不确定|分心的事物|不平等的|不宜|消沈|起意|悸栗|妄断|陈陈相因|凛凛|自慰|大败|愚蠢的人|违抗命令|打耳光|血腥的|悬念|招风|后人|推波助澜|未必|私底下|不忠|不引人注意|死薪水|使停顿|没什么了不得|恶疾|使激动|冤钱|太过自信|吃不准|暗害|丧乱|乱结|生活放荡|小孩没屁眼|否决|芜|变皱|窘涩|一团乱麻|使厌恶|罪证|亢|难驯服|花招|辞职|豺狼|跌眼镜|祸殃|挥猛烈冲打|贱种|错漏|游手好闲|手法|被骗|令人烦恼|使丧失|灯火阑珊|难控制|裙带|风吹日晒|假毒品|惭惶|猎食|黩|不合时令|有困难|动不动就发脾气|含怨|厌烦的|愁城|混杂的|讨人厌|会蔓延|滑稽|太迟的|排场|烂上|焦急|懦怯|依仗|撬动|羞怯|酸臭|无理|国贼|不纯洁|匪类|答非所问|情节剧似|鸠集|妖里妖气|同床异梦|盛怒|次要|远去|不适于居住|使失望|坐地虎|有特权|黑黝黝|呱哒|把子|错会|酸腐的|脾气坏|无端|没来由|受害的|奈何|迍邅|阻梗|蚩|原|泥泞|威慑的|暗朦|有..倾向|颟顸|平白|怫|讹|束手|挤占|拖拖拉拉|不易了解的|犯急|过度的疲劳|世仇|错觉|喧杂|假|不习惯的|年迈力衰|仰攀|小冲突|乱吃豆腐|瞽|加负荷於|漠不|挑逗|营私|扒皮|半心半意|少烦|不太可能的|喃喃|不正直|惨|很惨|喧嚷的|讨厌的|耍我|冷然|拖着|闪烁|不自然|忿恨的|过早|罪在不赦|碾碎|拍击|贼去关门|庸|可憎的|骂得狗血喷头|恶魔般|面色蜡黄|断绝|寒冷刺骨的|花着|形影相吊|怪异风格|抹杀|使蛀坏|蠢举|内阻|啰里啰嗦|无地自容|不合时宜的|靡丽|淡淡|诱入|窃听|当紧|殷勤|狼藉|猛然地|可忍受|人声鼎沸|煞风景|与..斗拳|鄙人|动武|乱丢|不肯定|畏缩的|贬抑|整垮|瓜田李下之嫌|沈默不语|通俗的|缠手|屁股|侵略的|体弱|恶势力|不安宁的|与..竞争|使成废墟|土|玩世不恭|有恶意|不及格|听之任之|急拉|很混|粗鲁的人|猛抛|炮灰|充斥|喋喋不休地讲话|贬责|好责骂|松懈|犯过错|好事的人|破产者|细|怄|庸庸碌碌|腐蚀的|呆愣愣|挂|烂源|没有观察到的|难看死了|生裂缝|殷|有个屁用|沦丧|不逞|不确|凶器|盗匪|风凉话|沈沈不乐|怨苦|搞不懂|喜夸耀的|荒唐无稽|墙头草两边倒|漆黑|随便地放置|反抗的|搜索|顽强地|柔肠寸断|去世|付之一笑|不受感动|言而无信|容忍|恍恍惚惚|匪首|关我辟事|爱莫能助|宣告放弃|右倾|硬性|婊子|讽剌|遏制|打人喊救人|使瓦解|羞涩|一无是处|恐怖病|闲言碎语|吃苦|骂娘|气死了|钻牛角|发狂的|驳难|溃败|奸|诱惑物|贸然轻率|窘况|未成熟的|自轻自贱|噩兆|警报|粗蛮|饥饿|使孤寂|不存在|将信将疑|皱眉头|攀诬|报忧|骗人|委罪|怪异|亏本|失控|危言耸听|险峻|皮条客|挖掘地基|伤口|晃悠悠|起绉|洪流|缥缈|外伤的|痛心疾首|猛夺|偷偷取得|酷吏|灰秃秃|无法解决的|声音|深以为异|隔绝掉|使不合格|野人|千钧一发|俘虏|惊悚|意气相投|眼光短浅|杌|使断念|无意义的事|不够意思|创痛|鬼物|傀儡|强要|横生枝节|招致毁灭的|赤字|来气|夺取之物|使昏乱|杂种|粗制|渗透活动|责斥|杀|挹|用嘶哑|懒虫|可怕的事物|邪僻|缩小|出卖身体|放屁|瘦的|生硬的|不流行|不适|打死|耗损|小报告|费精神|糟朽|哀悯|有诡计的|失去母兽|沈下|奢侈的|背运|发臭的|运气好|喧闹的|浑浑噩噩|压碎|泼皮|冗|臭架子|不可信赖|昏暗的|俱焚|不平衡|使发烧|处置|对立的|人为的|施展|无声音|亏死|漏子|不出|落井下石|会来事|使不高兴|阿斗|惝恍|忸怩作态|自作多情|没能力|调拨|轧|否决权|难以沟通|去死|臭男人|突发|背弃|从..清除|不清|游移|没动逃|不尽如人意|设伏|乞得|疝气|病弱的人|宣告无效|利用别人|苦差|恨死你|志大才疏|使羞愧|专擅|结怨|愀然|海匪|不起|窄|吵别人|使变黑|摆治|讥笑|洗劫一空|祸事|陷住|惊|褊|危如累卵|獐头鼠目|极蠢|不好过|耍滑|没脚|自诩为|气闷|神气十足|畏忌|书生气|不寻常的|必死|难上难|谫|不悦耳|嫉俗|牙痒痒|灾荒|畸形人|局促不安|怃|功败垂成|昏昏欲睡|死心眼儿|人人自危|惊奇|欺诈的|抱憾|失礼的|猛烈的|挑肥拣瘦|零落|握风揖缝|矮子|古怪的人|狗眼|之嫌|一文不名|敬陪末座|嗲|捞一把|极度悲哀|重浊|笨猪|心粗|功利论者|忌讳的|狂乱地说|负隅顽抗|心惊胆寒|使遭受|吵吵闹闹|拿大|揪心|割让|猛砍|苦的东西|穿不得|闹革命|灰茫茫|积弊|卤莽|多馀|漫无目标|远点|失去光泽|规避|破约|浮艳|不妥当的|严重破坏|侮辱的|色魔|赶出|裂开|糊糊涂涂|错误地处理|生怕|娼妇|无风起浪|无感情|墓穴|残货|惹人厌|出事|受害者|装门面|怏然|喃喃自语|冒险假设|害群之马|概念化|叫苦连天|种族隔离|哇勒塞你娘|易生气的|庸医|极度兴奋|闹腾|操贱役的人|不足额|侈谈|愁肠|颤颤悠悠|病狂|离开正道的|无知觉|秕糠|天南地北|势成骑虎|甩了|缭乱|愧赧|拔高|被玩弄的人|殆|手生|单调枯燥|白痴般的|发作|敷衍|怨艾|烧制|自炫|真他妈|逼使|愤愤然|瘆得慌|沈重缓慢地走|有瑕疵的|训戒|魔鬼般|勒索所得之款|绷紧的|屁事|战争|发动|恐怖行动|顽固的|凹痕|似是而非|机买|磨不开|划破|陷於困境|贼赃|在..搜寻|尽力睁大|灰心丧气|逼近|降低..的地位|丢份|压破|威迫|嫌贫|怨恨引起|哀哀切切|面带怒色|做鬼|僵持状态|胁从|把你打死|无人理睬的|咆哮|窃取|未上班者|器焰嚣张|放荡的|砍下|赊帐|权宜之计|偏爱|有毒性|酗酒|败家女|不悦耳的|辛苦|命苦|迷雾|骄弱|迂气|冤魂|灼伤|娄子|不甘寂寞|淘气|把头|没有考虑的|异常的人或物|无力的|使蒙羞|士气低落|胡匪|手头紧|有够蠢|噪叫|荒歉|空腹的|易坏的|不法行为|骨鲠在喉|使负重担|使惊惶失措|莫明|坏脾气|一箭之仇|不亲切的|头壳坏掉|复杂多变|失业者的|臭你老师咧|没有防备|空洞无物|娇惯|满脸烂肉|直愣愣|难取悦|危急|坑洼|恐|没注意到|争执|低标准|迂回|人声嘈杂|使倾覆|啁哳|输光|醉翁之意不在酒|无情|缺乏感情或兴趣|自夸的|把戏|使感觉不满|令人生气|复合|卖假毒品给人|引起疼痛|痔疮|不精密|搞屁啊|没有自信|不能矫正|没手|利己主义|矮|垢|爱管闲事的人|坎坷不平|粗枝大叶|烫伤|懒趴|黢黑|流浪人|使束手无策|艰难|嘴馋|幻|劣等的|旷课者|残余|不屑做|贱|不合规格之物|为富不仁|贪心不足|垂死|发出尖锐的声音|亮红灯|匆匆忙忙的|猫哭老鼠|不断引起苦恼|不可讳言|急眼|乱砍|敌巢|昏倒|蒙蒙胧胧|臭话|报歉|必修|秽迹|伤..的感情|睁一眼闭一眼|摧折|变空|背阴|缺少的东西|不得当|有出息|嘈杂声|坏心|嫌恶的|安慰|狗仗人势|搏斗|脾气爆躁|犯忌|瘆|触及|狂奔|低哼|老气|不能容忍|真他ㄉ滥|无计可施|网罗|不理智|倨|倚老卖老|不称心|馋嘴|亏损|无所不至|打鼾|不民主|失去勇气|变成废墟|说来话长|艰|天南海北|狠劲|冒..的危险|败子|未下定义|畏缩不前|承受不住|冰炭不相容|白吃|使失调|烦乱的|险|甩不甩|火暴|乱吼|孤独的|变态性欲者|恫|凋谢的|偷偷摸摸的人|麻烦的|疲塌|斗|砍得很深|使骨折|纰漏|违反教规|塞哩几抠碗粿|含混不清|作伪|提心吊胆的|免谈|做秀|流痞|被遗弃的|使无资格|更坏|该咒骂的|煎熬|苦头|浅|策动|暴虐的|猥贱|自负的|造成错觉|厮混|诽谤者|死赖|沦落|回击|匪徒|自咎|烟雾腾腾|后悔莫及|烦|严酷的|莽|天下大乱|凄惨的|胆大|恝然|复旧|畏惧|诓骗|抢掠|辫子|区区|瑟缩|奇丑无比|极小|靠不住的|说模棱两可的话|揍一顿|贱女人|厌薄|杂|惨然|傻头傻脑|不光明|黑窝|坏的东西或情形|恶劣地|没心眼儿|喧闹|虚谎|憎|傲气|使胆寒|投入深渊|整死|令人不满意的|没有防备的|闲散|病殃殃|臆造|憋闷|视而不见|祸胎|拳头|怀恨在心|亲信|遮蔽|不公正|惊讶|担心|存有偏见|油渍渍|使烦燥|呲|烂戏|无聊人做无聊事|夜盗|擦痕|有差别|死去活来|股匪|泛泛|不务正业|偷税|使遭受海难|厕足|衣冠禽兽|大乱|倭寇|可疑的|交战国|滂|使空转|不好意思|逢迎|落荒|应斥责的|作战|手脚不干净|暗示|诪张|消耗性的|凄恻|受抑止|占便宜|该罚|狡计多端|凶虐|震怒|未完成的|嚣闹|复仇|发动突然袭击|扒手|尖声发出|临死的痛苦|白|恼羞成怒|乱诌|申述|抑止|绕圈子的话|机八毛|痛|供给..过强的力量|对..徵税|制止|骨折|潜行於|流放|咬字不清晰|鸟话|撑着|加障碍於|落俗套|重|慢性|暴风|废止|闹闹哄哄|战云|自认为|敦促|愤愤|示不同意|忿怒|可恶的|易爆发|痴肥|没意思|老狐狸|背光|太随便|格外|咒死|愁思|背咽|前功尽弃|不切实际|出错|惹人恼怒|贼喊捉贼|不正派|走内线|骄奢淫逸|战火|易烦恼|生|使放纵|不充足的|追诉时效|存心的|存偏见|加剧|讶异|拮据|无恶不作|钻后门|旷工|邪神|劣质的|针刺|混兄弟|土里土气|纷|多馀的|抓来打一打|赃官|雾朦胧|畸|反托拉斯|阵痛|归咎|专制的|屈膝|拖拉|找谁干啊|外寇|刺痛|啪地落下|坏掉|未受过教育|被控犯罪|迷蒙蒙|小家子相|讪讪|窟宅|後悔|癌症|癌|胃癌|肝癌|肺癌|乳腺癌|脑癌|喷溅|脑残|下等的|蟊贼|暗箭|生锈的|使局限於狭小空间|闹嚷嚷|大跌眼镜|取消|秽乱|捣蛋鬼|不满意的|吞吃|被抑制状态|诈骗|疏|干声连连|进犯|搁浅|暴利|谗言|污|离散|木讷|不为人知|该责备的|扭伤|隐隐约约|大伤|骄|真假可疑的|东山再起|莫明奇妙|本本主义|不能容忍的|陷入僵局|狂热者|窝主|凄凉的|冲天骂娘|不完美的|没落|半信半疑|未解决|难解的|斥逐|琐碎|打怵|机变|熹微|缺损|寂寞的|血口|扰民|挂念|坑洼不平|小规模战斗|辛|困死|变卦|不负责任|昏头昏脑|毛子|看不起|跛足的|不在意的|凿死理儿|早衰|不关心的|使人反感的|含含糊糊|使悲痛|为..斗争|害人精|草率的|分裂|使复杂|嘴长|那里惹到你|他妈的|胀大|疯疯癫癫|设陷阱捕捉|慑|暴发出来|酸不溜丢|缠结|无智|不体面的|皱巴巴|未受制止的|老油条|诧愕|打乱|耍什麽狠|申明|骂粗话|拥塞|颓废派艺术家|混淆是非|昏沉|老练|使人厌烦|不敢苟同|大爷|奴化|才怪|孬|坚持|复杂化|令人愤慨的|依然如故|追踪|臭蚊子|卑鄙小人|哭诉|气绝身亡|时弊|限制因素|心急如火|刺儿头|马的逼|贷|没有考虑|被擦模糊|结党营私|悬系|被腐蚀|有危险|理由不充分|课刑|虚惊|但愿|乱|咬伤|浪荡的|破绽百出|一屁股|无光泽|肿瘤|哀伤|愤然|憾恨|乱腾腾|冷|不习惯|杂税|精神病患者|未列计划|压制性的|策划|胆小的|不精密的|恶煞|有害的植物|不可抵抗|悱恻|胆颤心惊|涣散|末日审判|心眼儿窄|怀疑宗教教条的|樊笼|踌躇不决|臭德性|狯|疾言厉色|阴暗的|辁|没水准|怨气|使变模糊|操纵|复合式|气味相投|利诱|搞迷信|被击中的|四大皆空|不足为奇|犯疑心病|不适应环境的|心黑手辣|不划算|乌托邦|丑的|骂出来|不平衡的|首犯|不经济|口头上|气乎乎|睁一只眼闭一只眼|了草|粗劣的|暗地里破坏|土豪|找岔子|不详|处心积虑|明火执仗|幽黯|称臣|爆破|赘|前愆|火冒三丈|猥亵的|不科学|良心不安|魔掌|缺席的|惦念|不绝如缕|有顾忌|意志消沈|消灭|大意|曲折的|杀人的|蒙羞|惹是生非|权贵|肠断|祸心|伏法|萎缩|三天打鱼两天晒网|反叛|极不|进行威胁|不重要之人|格斗|没效|仇怨|行贿|犯法|聚敛|拐带|丑丑的|吵闹的|用沸水烫|世情冷暖|串骗|不寒而栗|希图|不妥|说鸟话|流毒|哭丧着脸|荏弱|乘势|不好看|烦愁|不听话的|不注意|气冲牛斗|不着边际|使破裂|罪恶多端|不相信|惹恼|覆雨翻云|风刀霜剑|同情的|单调的|贩子|溃退|糟践|狞笑|心地狭窄|不顺当|使乾枯|怒火中烧|姑宽|得不到|欲壑难填|流浪者|使坏|伏击|偷摸行走|半半拉拉|多刺的|使跛行|冷噤|失职|作祟|粗鲁无礼的|雪上加霜|窳败|找碴儿|发誓|不干不净|不可抵抗的|无稽|弄错|作秀|搞这一套|鄙贱|冲蚀|不关痛痒|坚决主张|击成..|兵灾|深恨|愆尤|贰心|秽恶|憷场|微小|没规矩的|不安稳的|不妊的|要死|发出颤声|查禁|冷眼旁观|粗糙的|桎梏|乾枯|使烦躁|可惜|诡异|后怕|不流动|变弱|冷酷的|寂寞|吹擂|死了算了|莫名|不重要|匪患|伤风败俗|保皇|竹篮子打水|重新陷入|刑事|疯的|死乞白赖|举止失礼|觉得自己理亏|令人敬畏|倒灶|变质|想不到的|变本加厉|悠谬|有点火|使人厌恶|危机四伏|蔽政|不能解释的|擦伤|狂热地|乱骂人|遇险|火急火燎|疑惧的|大变动|咕哝|自作主张|沈浸|结伙|骈枝|越想越气|瞀|不端|发愁的人|没有礼貌|口吃|自卑|长的丑|差池|高度兴奋|熬刑|不稳固的|板起脸|大声|森|看轻|家徒壁立|狗屁不通|不真实的|杠上|索要|暴力引起的|干嚎|烦腻|幻灭|拒人于千里之外|什|非真正的|斗筲|仗势|有危险的|二乎|恟|觖望|阴冷的|郁|阎罗|忿恨|墨|狃|耗竭|啪地一声放下|嗾使|花痴|宽贷|怀恶意的|溢价|粗心的|没辄|朦朦胧胧|可容忍的|冥冥|失手|起皱|结局|未被通知的|走卒|大放厥词|让渡|挫损|怛|惭不惭愧|耍色|不堪|潜藏|走油|附会|变幻无常的|凌迟|自我中心|颠连|敲诈者|隐|使成残废|私吞|窳|无趣的|慢性的|灯红酒绿|坏话|癫狂者|乱用|走投无路|养尊处优|不尊重|布置地雷或水雷|不打紧|无救|越气|被俘|死脑筋|无志气|佶屈聱牙|乏人|崒|隔靴搔痒|离群|失措|发腻|隐秘|重担|躲藏者|垃圾场|去你妈|使混乱|拆台|严惩|罪魁|心术|积满灰尘|心神不定|迷离扑朔|莫能|飞溅|不合语法|无理性的|邋邋遢遢|螳臂当车|邋遢女人|桀|大屠杀|失效|水性杨花的女人|使不安|谬说|变态的|气忿忿|迷路的|忮|用尽|不和的|鸣不平|干你娘|怔|喽啰|冒失的|得意忘形|东西|意见分歧|令人不安|怀疑论|詟|毫不留情|未定的|约略|不安稳|面有愠色|不可爱的|使变空|暴虐行为|皮毛|以怨报怨|同情|荒谬的|干巴巴|不伦不类|犯禁|荒落|受过|变暗|无趣味的|迟误|滥捕|盗印|缺憾|蛮横行为|鸟态度|贪官|滑头滑脑|老大难|摭|使腐败|阴雨|没种|自取灭亡|糠|妄言|无礼|未加|凝滞|讹误|过激的|危机重重|从中作梗|喃喃低语|不可预测的|倾销|赶尽杀绝|强嘴|恶念|清冷|沈沦|不屑於|通奸行为|孤单|撒气|恶语|絮烦|假扮|逼缴|胡言乱语|矍|心胸狭隘|繁复|不是滋味儿|灰头土脸|火头上|骚|宿命论|假仁假义|远离|刀割|疼痛的|奴颜媚骨|脏兮兮|塞八|走险|脱落|伤害..的感情|干你老师|暝|弱|乱了营|失去法律保护|非刑|二五眼|在那边混|未完全发展|舛误|狂妄的|做死做活|周折|使上瘾|绝境|直眉瞪眼|谋反者|饶人|颠倒|翻版|忪|心智衰弱|耸人听闻的|誓不两立|令人怀疑的|死澳门仔|抓来|示怒|极度渴望的|强迫徵兵|辱没|偷取|甘居下游|株连|随风倒|峭直|不友好的|未被证明为正当|臆说|不巧|花花搭搭|宠幸|不合适地代表|追诉|声名狼藉的|窘困|老掉牙|生吞活剥|杂念|惴|心毒|适於屠宰|泥沙俱下|落後的|成碎片|伤人感情|难达成的|祸乱|糙|可争论的|臆|臭铜钱|翻倒|蹈常袭故|阴私|受穷|成废物的|碌碌无为|反扑|下半身思考|使头晕眼花|费用浩大|羞惭|搞新闻|虚矫|不顾一切|扒窃|怠惰地|不为人喜的|严苛|孤|达不到|搜捕|黑幕|妄想|矛盾|吓了一跳|含糊地说|恶神|鸷|没趣|愚|使焦虑|失序|破旧的|机八|臭味|冲击|罪的|无人理睬|冲突|搞阶级斗争|别来惹我|故意|表面粗糙|使大伤元气|脾气|懒惰的|怪诞的事物|踌躇|妖|袒护|卖不动|不洁净的|讷|使悲伤|浸水而沈没|大破坏|漠不关心的|畸轻畸重|渺|下道儿|险毒|加重压於|援交|想呕吐的|窥测|虚无|大手大脚|抨|不雅致|两难|恚|懔|心灰意冷|疑神疑鬼|狂乱的|凄苦|废墟|狂怒|暗射|忏|隐伏的|恐怖时期|四散|怒骂|试图|不充分|深仇大恨|严寒的|秘教|淫画|活宝|苦命|破财|差强人意|发爆震声|黑漆漆|小心|死心眼|狼子野心|坡|腐坏|劣中之劣|负荷|承受不住的|使荒芜|炸|挤过去|提出..来反对|茫茫|不诚实的|成为空的|豢养|私密|溃疡|系念|愚懦|怨懑|使黑暗|安然无恙|夭逝|杀千刀|未经训练|蛀虫|不适任|与..扭打|事端|噩耗|埋葬|恶意的|纵恣|不扬|忏悔|恼人事|迷信引起的|无人过问|索然乏味|放恣|烦人的|奸淫|不知不觉的|咯咯声|固陋|被绞死|沉痼|论争的|使跛|吃惊|马脚|有毒|虚骄|掺假货|原谅|费神|怵然|想方设法|发誓要|做坏|威慑力量|忘恩|使咬字不清晰|皱皱巴巴|徵税|臭老师|恨极|天怒人怨|慌慌张张|处罚|误用|令人失望|赶这样说|厚脸皮的|不相宜|兴妖作怪|犬牙交错|惊跳|以喧闹声扰|惹人恼怒的事|使中断|不情愿|无用的|恶少|粗|不宽容|无意识|腐蚀物|不甩|什锦|败|村话|地位低下|愠怒的|死臭酸|空洞的|砍得|苦楚|使渗漏|使复杂的因素|撤退|伤脑筋|切齿痛恨|令人讨厌的事物|模糊的|烟雾弥漫的|苍白无力|自我本位|失却|因袭|意图|怒斥|拿乔|非命|加深|罢工|天杀的|没手没脚|撕破脸|蠕动|受累|费尽心机|悲情|落伍的士兵|矮胖|非正义|高难|藏掖|气盛|蒙受|忧沈|没边儿|木|极坏|精力枯竭|垂头丧气的|拔份儿|自求多福|结巴|倔强的|捆住|防守状态|被迷住|死鱼|浮漂|势焰|掣肘|死光光|学识谫陋|睁大|做手脚|臭|神经质|倒下|不足轻重|白字|不要命|阴沈沈|逐渐消耗|套近乎|落下|百孔千疮|骄人|行骗|横七竖八|贪生怕死|地狱般|出神|阴沈|嬉皮士|糟糠|铁杆儿|岌岌不可终日|不断唠叨|赧然|着忙|皮囊|刚愎的|要求|未下定义的|神不知，鬼不觉|临阵脱逃|未加抑制|偷摸行走的人|卖好|不值得羡慕|从事伪造活动|无关紧要|拥挤不堪|瘠|逃避职责|训诫|万念俱灰|醉汉|难解|罪情|好呕|蔓延|向..挑战|痛苦的根源|赤佬|地煞|数落|寡淡|较坏|使受伤|冷清|击中|大兵|刺儿话|恶报|糟透了的|语病|暴|不畏|厌世|没办法|鄙视|火烧火燎|扭斗|真他妈贱|敢死你|亏负|说客|饶|不惧|坏帐|热病|掺和|激烈进行|刺入|破口|使糊涂|不登大雅之堂|愚钝的|心生畏惧|不告而别|笨伯|惶惑|诬栽|牛气|粉碎|作弄|土气|摧残|舌头断掉|变化万千|不肯|为非作歹|鱼肉|怒叱|误认|困惑|鼾声|唠唠叨叨|消散|贪得|气昏|用尖锐的声音说|不问是非情由|示众|仗恃|盗用|啰啰唆唆|走失的家畜|闷死|无所帮助|急切|养伤|破坏性的|精疲力尽的|幽冥|郁悒|气息奄奄|隔离|匿名|用心良苦|意乱|桀骜不驯|喋喋不休|下陷|抹黑|碎片|不等|一发千钧|泼冷水|学究气|拍打|失焦|悻悻然|狂|嫌东嫌西|中伤性|虚怯|犯案|自居|伤痛欲绝|孤寂|花钱浪费|心如蛇蝎|闹得不可开交|不能医治|狗杂碎|难达成|不管三七二十一|落马|口腹蜜剑|翻天|逼不得已|使人痛苦的|不住|拘留所|痛哭|贝戈戈|有啥|乱世|难处|违纪|涉世不深|糜|沈重的|使难办|恐怖手段|差事|耸肩|干他|违宪|断念|奚幸|大悲|不够格|乱辩|哩哩啦啦|行为不良|蛮|尖声喊叫|啼哭|绞死|制服|夹生|打击|断代|蹒跚地走|鞭挞|遮掩|苟且偷生|得计|沈寂|不满足|屌屁|质地薄|逼死|眩惑|频仍|催吐剂|肇祸|感到不适|蚀坏的|贮藏货物|过得去|装肖唯|灾殃|使灰心|滞背|惶然不安|痴心妄想|粪尿|土头土脑|猪八戒|滥挖|使反感|歉然|迫不及待|重压|长短|香艳|入迷的|甩得一乾二净|出丑|中溜儿|荒年|负隅|缓慢|气馁的|狠打|无道德|不合群|绝不原谅你|马的咧|德薄望轻|心如刀绞|噲|不规则的事物|地痞|蠢牛|否定的|地下|荡|最没有|无道德观念|肆行无忌|浪费时间|怯然|大力|独吞|忧国忧民|死了|低声|声明放弃|干礁|恹|失掉|疚愧|不以为然|啰啰嗦嗦|切断|愁眉锁眼|大面额|示弱|从动|捏一把汗|击溃|分割|惯窃|不眠的|轻易停止的人|羞羞羞|不生育的|较量|承受|漫不经心的|祸祟|悲悯|蠢材|大批出没|惊栗|有点儿|毒资|满腹|磨烦|正式脱离或退出|相撞|隐君子|马贼|割据|有什麽了不起|心急火燎|夷灭|靠母|串通|臭气冲天|死家伙|好不|不道德|完全丧失的|编派|使赤贫|厉声|使抽动|乱想|衰替|使恐惧|摆布|潸然泪下|武装部队的|败将|走开|旧帐|使震动|弃信忘义|可怜的人|丑诋|使人疲劳|轧轧|邪行|野鸡|卑|狭路|徘徊|东窗事发|宠坏|收罗|徇私|不公平|鸡八|包办|爬行|操你|去除|诡不诡异|稀薄|藩篱|斗殴|不慎|纳贿|闲闲没事|羞答答|儿戏|黝|臭不可闻|不顺眼|显怒容|横|一窍不通|红眼|头痛|歪理|貌似真实的|异乎寻常的|突然止步不前|凭空|机关算尽|拍案而起|气愤填膺|勒派|自鸣得意|未知|白区|噪聒|屁啦|无耻之尤|惧色|扣住|不友善|无可置疑|跅弛|流泪|炸毁|秀逗|一哭二闹三上吊|分隔|你管我|极危险之物|心死|干的好事|偷运|过世|谋陷|扫地|侈|撸|松弛|煞车|笼络|淫秽的|招致不幸|龃龉|海底捞针|混吃混住|错误百出|小看|看不见|粗浮|使失事|哩溜歪斜|私下里|费功夫|非常饥饿的|猛扔|猖獗的|没受过教育|偷骂|轰动|使..失去法律保护|用嘶哑的声音说|愣怔|不健全的|莽莽撞撞|未缓和的|流浪的|勒除器|犷|去死吧|散乱|吹牛皮|冒昧的|易受骗|胖子|颓废期|疼痛|内耗|加重|无力|使陷入|归咎於|料想不到的|含糊话|不置可否|村气|受感情驱使|骄傲的|作死|不名誉的|有愧|去死啦|怒火冲天|发指|焦燥|不健全|与..争辩|价值不高的|易生气|引咎自责|恝|人事不省|强光|没礼貌|自食恶果|嬉皮笑脸|厉|侈糜|青面獠牙|啪的一声甩|淌混水|喷溅出来的东西|不美观|挂一漏万|昂贵|恶性的|窃|逊位|鸡巴|甜言蜜语|辩解|长肥|荡妇|刺痛人|黑钱|率尔|悒|不和蔼|穷极无聊|日薄西山|狂荡|反叛者|又气|暴客|心脏受不了|耍起狠|低水平|家破人亡|有啥了不起|捧场|不可避免的|致死|缺席者|勾当|谅解|败胃|凋落|甩得|堵塞|分离|落落寡合|哽咽|鬼叫|盲信的|干到最高点|封闭型|叛国者|富余|转嫁|搞援交|剿袭|面黄肌瘦|玄|装死|剧跳|坐卧不安|忍耐|凹下|怀敌意的|与世无争|学不来|吆五喝六|大胆|生厌|後退|公愤|不检|急促|难题|倒不如|怪里怪气|反唇相讥|拉出来|大夸|别别扭扭|入侵|风霜|野性的|抛费|卒仔|压治|撕毁|垂下|刁恶|脏污|心不甘情不愿|奢糜|诽谤的|瘟神|邋里邋遢|惊惶失措|荒诞派|东洋鬼子|菜色|喧嚣的|杂糅|穷苦|不便之处|无法忍受|妖媚|嫌忌|花容失色|甩都甩不掉|发疝气|使蓬乱|长篇累牍|拉交情|虚造|使发愣|凶宅|耗尽的|悲剧的|摸不清|抱恨|多嘴|叫化子|逆境|挥击|被抑制|草率从事|靠啊|清高|板着脸|敲竹杠|不充分的|猛然地一拉|弄混|少给|亏死了|破落的|硬气|已过盛年的|不幸之事|奸情|夸夸其谈|打蔫儿|无魅力|妖孽|被击中|迷离倘恍|挑唆|陈言|沦陷|不佳|插足|小瞧|打颤|无意识的|枯燥乏味|分歧|最小限度|脸红脖子粗|不是省油的灯|宽免|卑猥|发怔|睨|蓬头散发|跅驰|使人痛苦|捉弄|使狼狈|钻牛角尖儿|萋迷|草野|不活泼的|惋惜|满目疮痍|使缠结|心酸|偏心的|难信的|患..病|寒颤|杂烩|自相残杀|死死|绝对地|飞灾|朽腐|蹦达|不适应|臭烘烘|赝|锋芒毕露|使不足|变化多端|易怒|复发|败草|令人无法忍受|谪|令人厌恶|呜咽地说|乖违|欠揍|窜改|穷乏|空虚的|安心|颤抖|胡子拉碴|严加|拐骗|病害|朝令夕改|冤头|颤动|锥心|错误的|不耐烦|担忧|遗祸|违拗|做人情|擅自摸弄|积聚钱财|伤感情的|胡里胡涂|发生矛盾|外伤|贬谪|恶声|独霸|宣告有罪|老大|难事|放一个屁|落寞|惨祸|臭虫|暴发出|死三八|不大|花拳绣腿|冤枉|夸大的|产生纹裂|吓跑|外患|关节|流行病|嗲声嗲气|踟|不整齐的|疾走|不足为外人道|不合情理之事|前嫌|中伤者|毫无意义|变乱|勾通|走私|赤裸裸的|体力不支|惊诧|极苦闷|辛辛苦苦|忌恨|哭幺|我靠|低质|悔不当初|勒诈|拉屎|危险的|怀有恶意|呆钝|无效果的|掉价|痴话|优柔|明知故犯|昏黑|沈下脸|迷迷蒙蒙|失去知觉|使皱缩|滞缓|神伤|有缺陷|腼腆|顾念|缺乏绅士风度|不乐|招牌|骭林娘|黑金|笃|倥|白眼|似|丑丑|渗透物|任其自流|献媚|横冲直撞|私|断路|痛打|挑剔的|旷废|邪恶的|坏孩子|机车|蔓生|抓伤|使混淆|薄命|空落落|纵恿|坑蒙|挑毛病|监牢|莫须有|拘礼|掩护|必死无疑|杀人不见血|傒倖|无人遵守的|使困惑|有困难的|认死理|倔头倔脑|小题大作|愚笨的|恍惚|复活|哀怜|有够累|妨碍者|忧心如焚|无光|郁郁不乐|不可接受|臭哄哄|不足的|大便|疑有|惧|倒楣的|对进行报复|偏听偏信|恶心鬼|犯罪的|罪恶昭著|斥|狎|罪责|阻碍..的发育|用力|烂污|冷清清|不可读|沆瀣一气|没想到|糊弄|二手|哀愁|当不了|失业者|品头论足|羞恶|兔死狗烹|忿恚|劈啪声|告诫|毁灭性|唯恐不及|犯难|孤家寡人|威压|千金一掷|净余|不幸的人|没有目标的|犯罪者|使人反感|还想怎样|粗略|搞乱|难说话|受罪|饕餮|巧黠|坐食|搞投机|以商逼政|弊害|居心剖测|猪狗不如|讨厌的人或东西|暗箭伤人|一无所得|抛荒|翻滚|强烈的欲望|由爱生恨|无所事事|撤回|死刑|不能征服的|下流的|刮出刺耳声|交疲|动粗|毒蛇一样|猛拉|紧张不安|盲人瞎马|妓女|坐监|偷偷地做|使士气低落|串秧儿|膻气|凋萎|梦魇|口渴|完完全全|怔神儿|忧|开小差儿|险境|赋闲无事|顶嘴|呆|若隐若现|反|赤贫者|国耻|使倾侧|低人一等|情况不好的|束手无策|杂物|沉郁|败坏的|怜惜|多疑的|沉疴|零七八碎|倒算|空想的|烦厌|恶言|使分裂|流血|影影绰绰|乏|遭报|冒充的|辛辣|审判|无知识|迫使|破坏的|批臭|孤单的|俗丽|老娘|万劫不复|搞独立|老式|煮豆燃萁|有名无实|摇摇欲坠|诅骂|死老头|变忧沈|阴沈沈的样子|骇惧|乖蹇|令人悲痛|塌陷|令人沮丧的|向上倾斜|看淡|恐怖主义|低声含糊|何必|无特色|咆哮得使|犹豫的|不听话|嫌|不好吃|劈开|乱丢垃圾|紧迫|分开|不明了的|蹙额|肮髒|挂气|死的|零零碎碎|推挤|浮礼|硬生生|败俗|逋欠|价高|摆脱了|疵点|休止|品性不端的|使受危困|紧张的|无缘无故|将..弄糟|淹没|胆战心惊|旧|迷迷怔怔|异常的|搞政治|不确信|强盗行为|教条|背叛者|违背习俗|过多|模糊不清的事物|无人情味的|正颜厉色|兜售|讽刺的|使凹下|自缚|无聊毙|朝不保夕|不正当的|叛逆的|低吼|根本不是我|贫气|使朦胧|火拼|非笑|隔阂|谬|被泼水弄湿|心眼坏|缩减|莽苍|板|低卑|岸然|无政府状态|神志委靡|虚名|小辫子|强权|低端|忍气吞声|冲出|怅然|砸锅|气得|袖手旁观|烂货|倾侧|庸才|惊奇不已|失去..的|计策|不受|顶撞|怜悯|非正式|虞|复古|引起震惊的事件|左|渺然|误入|臭名|不断骚扰|难以|发痴|熬心|烂掉|不痛不痒|迫不得已|匪盗|恕宥|嫩|打..的屁股|欺诈者|薄地|世弊|没受教育|辗转|打滚|伪君子|放低|昏晕|斗嘴|滋长|殒越|臭青蛙|不冷不热|未被证明为正当的|瞧不起人的|昏厥|比肩接踵|零星|迷糊|你是怎样啊|奸商|最恨|昏昧|不爱交际|连屁都不如|漏损量|使含糊|魔爪|使摆脱|傲慢无礼|闹灾|奸男女|停业|发脾气|有够|恶作剧的|追杀|互吵|面斥|粗卤|政客|感染|挤对|祸从天降|暗指|贫|绵里藏针|特贫|极可厌的|不堪设想|凶猛的|寡|弄鬼|顺从|开倒车|高不成，低不就|意见不合|别来烦我|蓬头垢面|忍下来|不劳|苦苦|杂多|蓬首垢面|熟视无睹|险厄|发出刺耳的声音|回护|酸的|狠狠|任纵|误人|畏|伤怀|私运|减去|看不过去|汽车扣押场|不顾後果|命运注定|不周到的|大杂烩|板脸|变得阴沈|腐蚀性的|受感情驱使的|离乡背井|变软弱|不参加|怒容|只听楼梯响，不见人下来|煞气|凶蛮|不甘心|险恶的|畸形物|放狗|斗不过|凶多吉少|费力的|没理|受痛苦|粗线条|发愣|眼巴巴|超重|萧条的|阴沉沉|我咧|否|控告|私枭|亳不留情|不耐|说梦|偾事|寡了叭叽|黑市|祸患|一脚踹开|傻气|被刺痛|不易弯曲的|愧色|瞠然|阴狠|搞什麽名堂|蹇|馀|三八|发育不全|毁弃|冲口|抽搐|强挤|完了|下毒|不可降解|行为不检|被玩弄|蛮横的|乌云|不可能的|疲乏|差强|下场|应该谴责|倔犟|忉|倥侗|白搞|拖沓地进行|遮暗|造谣中伤的|没觉察到的|倒行逆施|基卖|顽固地|背靠背|小心眼儿|语焉不详|穷凶|狂暴地|沉痛|一手|费|无情无义|逾分|骂不绝口|吃不下|作废|重击声|神经质的|帮会|鼓舌|不信|丧失亲人的|後座力|渐渐破坏|黑黢黢|叫苦|摈斥|我好恨|那麽没用|良莠不齐|不平|敷衍塞责|易坏|屈节辱命|灼痛感|操心|难以取悦的|无故|歪|糊里糊涂|摇尾乞怜|匆忙地走|拉下脸来|失悔|将浮渣去除掉|艰深|懈弛|敌军|肆|大恐慌|受苦|愤怒的|死地|给..不快之感|更坏地|强挤入|差强人意的|恨得牙痒痒|难以捉摸的|无威严|拒付|亏待|横穿|寡言少语|打退|瞎抓|被吼叫着表达出来|批评别人|未获情报的|监禁|是非不分|伤亡|孑身|揭穿|惊慌失措|好容易|争辩|光棍|瘦削|出风头|叱呵|剔除|长期争斗|耍赖|高价|免职|疹子|难达到的|易损坏|阴性|枯|玩|担惊受怕|强奸|不完全的|娇弱|擦脂抹粉|使病弱|暮色苍茫|疮痍满目|懵|严寒|滥|颓风|滑坡|破烂的|食言|流弊|色情|悲|逆流|点火|懒散地|求饶|不智|应负责的|阴郁的|栽诬|偷偷摸摸地行走|更恶劣的事|搬弄|水火不容|横着的|被狗吃|孤负|媚态|崽子|兔子尾巴长不了|吓一跳|好事多磨|诡计多端的|拒绝..|仿制品|没精打彩|彻底的失败|罚金|异乎寻常|受贿|支绌|懒|对峙|毫无办法的|卒仔脸|叨唠|呕吐|抽象|不法的|腥|动不动|手段|哀悼者|呜咽|作孽|交媾|不知去向|恣纵|洪水|不可更新|无信用|产生反作用|玩笑|极无礼|离我远一点|孱头|易受..影响|浓烟|焦灼|万难|有好有坏|猫腻|畸型|纠集|空手而归|倒霉|暴民|放弃|悚|空头|潜|含糊其词|缺席|平铺直叙|恶气|啪嗒|拿捏|吐一口痰|不管|心眼坏的|保命|大惑不解|押往|忸|关上|异常|勒除|贱招|不断地找..的岔子|冷门|危亡|退避|激怒|冒冷汗|宣判|平白无故|使窘迫不安|扯后腿|走散的人|刺死|陷於|不近情理|晦|谄谀|火大|长篇大论|同性恋者|疑窦|辞呈|屁眼|难相处|横刀夺爱|扯腿|浅的|肤皮潦草|财迷|弄碎|活该|绷紧|寡断|丑化|极端|不平常的|劫持|摇晃|吹胡子瞪眼|傻里傻气|恶梦|无孔不入|不同意|危急的|千人一面|盗墓|令人齿冷|颓|论争|不得已的|心眼儿小|弱势|神经错乱|强硬|喝叱|晕眩|反动主义|抵制|打断|骇怕|世界末日|自命|逋逃|耳热|使不知所措|忧怨|如履薄冰|骂得狗血淋头|混|边患|不新鲜的|不妥当|负约|未经检查|楞住|羞怯怯|饥饿的|死路|造谣中伤|失计|己见|刺客|死屌|无关|怵|浮动|暗礁|动干戈|私念|损失惨重|无法挽回|不适时|假情假意|卖弄风骚的人|日本鬼子|称大|一贫如洗|不信任的|贝哥哥|不履行|心情浮动|空疏|狗腿子|黯淡的|酥|多虑|无决断力|乌沉沉|使复杂化|贫寒|贫贱|哀凄|无依|杀人罪|饶舌|不对头|疲惫|隐患|秉性剌戾|含含混混|呼幺喝六|变得渺茫|奇货可居|蠢毙|死胖女|激烈|不能解决问题的|住监狱|大吵大闹|细瘦|安于现状|游荡的|变化无常|身败名裂|渎|缠扰|抵抗|活动|敌台|失眠的|茫茫然|怨声载道|党徒|嘴笨|极愚蠢|无威严的|溜边|冤死|毫无价值|对..施暴|被利用|奸笑|焦愁|漏球|忤逆|残怍|沉冤|退落|嘘|臭老猴|变黑暗|合谋|新手|想入非非|同日而语|勘漏|你完了|大举|软磨|侵犯的|复杂的|欠佳|出圈儿|满腹疑云|皱巴|鸡犬不留|胡涂|不得劲|呼啸|腐蚀性|野蛮人|孤单单|不庄重|彷|保护伞|迂执|意外|倒坍|经验不足|荒年的|不得人心|羞人答答|亦步亦趋|任意的|怒视|寸草不生|突然的|加罪於|离婚|不屑一顾|诬害|未便|对..处以缺席裁判|价格高昂|短促频繁|未开化|使模糊|毒液|失怙|伏罪|冤屈|健忘|诟|忧悒|罄竹难书|舛错|急性|不便的|颓废期的|深渊|罢市|羽毛未丰|拖着脚走|粮食不足|腐朽没落|虚华|低产|恣意妄为|使处於不利|愧|鬼魅|肘掖生变|指靠|装腔|皱|病弱|吃亏|痴人|未指明的|对健康有害|西化|乱烘烘|你以为自己|死里逃生|无限制|卑鄙无耻|吃劲|小里小气|无能力的|去你|气狠狠|睡不着|掌掴|等量齐观|遭罪|愤而|介意|黠|凌侮|窘迫不安|口角|怀恶意|无依无靠的|搞什麽飞机|焦虑的事|劈开的|乱杀|教训|危困|无病呻吟|艰巨的|颓放|陋|徵收报复性关税|不懂|团伙|马屁话|气冲冲|损公肥私|嘲哳|发飙|假装神圣|劣|不寻常|陈|大发雷霆|犬儒主义|单寒|消瘦|狂吠|不彰|不适时的|坚硬的|外侮|极不协调|徒托空言|丧失公权者|缝你嘴巴|侵略者|无目的的|赘词|涵容|冤愤|轫|有瘾的人|不体面|抓取|气呼呼|破坏性|使碎裂|有病|窝赃|纵欲|使人厌恶的|偷工减料|慨叹|宰杀|离开正道|落後|敏感的|招致|动作迟顿|贱男人|失落|强梁|使竞争|祸延|无能为力|不实|冒昧|喧闹的谈笑|吓坏|不像真实的|蛆虫|猥辞|创痍|局限於狭小空间|不能解决的|恶言相向|魔鬼似|悲哀地说|大错|捣鬼|私见|忡|惊险动作|冒|伸手|故意的|无常|还可以的|压制性|使稀薄|混账|招摇|受惊|扣帽子|骇愕|错杂|买好|叛逆|相同|有瘾|如野兽般|沈溺|无聊的想法|幌子|过节|怪力乱神|死性|使迟钝|惹是非|骗吃混喝|寄食|诬陷|跟..纠缠不休|吵翻天|老马|留难|懆懆|趁乱抢劫|强压的|难驾驭|吃屎|无人情味|凶悍|户斥|帮派|死狗|在..埋地雷|起褶子|胶柱鼓瑟|支使|罪尤|斗拳|狂人|鱼龙混杂|头晕|祸不单行|人为|饿得|唾沫飞溅|破败的|味同嚼醋|爱面子|竟然一直给我|劝告|不宜说出口|不愉快的事|顽固不化|无济于事|骗|对手|贪念|驱散|撺掇|僵痛|混血|盘问|名义上|窄狭|未确定的|气头上|受闷|缺乏感情的|强行|拗客|荒谬的言行|孤零零|借刀杀人|名义|不甘不愿|与..战斗|灰沉沉|扭歪|派系|苶|恶质|蹀血|谎报|弄死|凶神|精神溜号|够不爽|喊叫|没天理|难接近的|感到难过|慢吞吞地|降低..的品格|不得|怊|欠缺的|跳梁|无利益|去你妈的|嘴巴烂掉|陌生的|杆子|贪婪地注视|神经过敏|不规则的|很深的裂缝|凄迷|浑名|错综|愚不可及|拒绝接受|打压|神经病患者|血雨腥风|爆发|失实|笑话|不适当|恶作剧|倜然|砰声|多余|祸水|有气|民贼|轰击|压倒性的|起疑心|呵|嗜血|琐细的|宰|捏弄|昂贵地|作威作福|巨物|浅尝|病人|陷入|万花筒似|傻呵呵|表里不一|怔忪|叫屈|里通外国|酸涩|送死|抱头鼠窜|趋炎附势|仇隙|洋洋得意|使发愁|没去|横祸|受挫折的|避免|使惊恐|狂怒的|羞臊|使疲劳|跛行|混流氓|使有危险|不可补救|裂痕|心不在焉|不正确的|误期的|老处女|不雅观|倒垃圾|瑕玷|奓着头发|各行其是|真他妈的|官气|悔|强制性|目光短浅的|怨怼|死猪头|毛头毛脑|脾气暴躁|不可容忍|发怵|捣乱|摆款儿|不成材|瞒哄|杂七杂八|空中楼阁|犯杀人罪|矫情造作|不加|失去知觉的|死囡仔|贱役|牛刀小试|吝|如泣如诉|分泌毒液的|削减|眷顾|忸忸怩怩|定罪|骞|围攻|漫漶|自甘堕落|蔫不唧儿|不在乎的|脏乱差|入迷的人|打谎|凄婉|刺眼的强光|暴尸|家贫如洗|浸没|没得|混充|死人|感到灼痛|无兴趣|逼政|恨死|轻率的|次|痴想|懊糟|鹰犬|被浮渣覆盖|黝黝|无法预料的|可容忍|感到遗憾|渎职|没治|对..不忠|草鸡|疯话|鞭打|拖后腿|灰心的|无感觉|从事小争论|胖的|新仇旧恨|饮泣|对证|吼叫着表达|勾引到|惴惴|发愣的|纷繁|凋零|祟|泥坑|狩猎|猪哥|后辈|精神分裂|歪门邪道|拘囿|酶烂|乱纷纷|弱不胜衣|流浪|霸持|淡而无味|无诚意|激进分子|反动派|感慨|人心惶惶|与..不符|吹拍|灾难性|隐秘的|扼腕|绕圈子的|笨拙的|不长眼睛|失身|限度|夹痛|虚荣的|感到痛苦|贰臣|发贱|怨|夹七夹八|搞斗争|挣扎|着魔|暴力引起|日暮途穷|守财奴|词穷理屈|狐假虎威|未经通知|太过|前途渺茫|怪人|顿挫|觖|神不知鬼不觉|混混儿|大咧咧|闲闲没事做|批斗|傲物|使茫然|恶搞|弄歪|饥谨|溃乱|孩子气的|难人|反胃|小视|剌|茕茕|说嘴|难驾驭的|不知所措|令人伤心的|出乎意料地|作对|刻苦|急切的|不得体|带有敌意|矛盾的|申讨|遭受风吹雨打的|家丑|混淆|黄毒|排揎|穷困|无把握的事|糟透了|不完美|极恶|折本|使心智衰弱|泪下|装模做样|心甘情愿|露怯|好自为之|发急|赛人|不清不白|擢发难数|劳神|气咻咻|驽|雷霹|一气|妄图|清贫|拷问的|变得微弱|毒刑|以呻吟声说出|铁杆|不服从的|痴人说梦|乾阴阳|佻巧|七窍生烟|战战兢兢|疑|不合理|言行不一|手腕|不名一文|极小的空间|惆|油煎火燎|世侩|踟蹰|吃力|不善交谈|愤愤不平|大骂|窜犯|沈沈不乐的|怀恨者|花插着|不关|伤人|坐享其成|附庸|贼眼|背离|无语|犷悍|禽兽不如|空腹|卑下的|冲头|岂有此理|铁蹄|缺乏教养|恚愤|无秩序的|遭劫|呆头呆脑|烧坏|抱疚|满脸愁雾|没卫生|孤陋寡闻|居心|扣留|野蛮的|赘言|坐误|拒绝给予|不合时宜|不定|恸哭|撬起|缺乏感情|乱真|虚脱|木然|臭脸|心胸狭窄|弥漫|使摔倒|渺茫|不可|以邻为壑|刺骨|卑鄙的|塞你祖马勒|勾联|不符|败坏道德之事|肝肠寸断|贪生|一怒之下|下地狱|私下|骇异|不贞洁|造孽|憋死|心猿意马|倾卸|使变得无耻|止步|苦大仇深|引咎|私仇|忌惮|异议|好争论的|不羁|替..报仇|哀鸿|邪|鬼玩意|问心有愧|反对者|不清楚的|使恼火|未遂|快滚|风吹|过意|不卫生|废除|无纪律|骂他神经病|祸首|嘀里嘟噜|死鱼脸|不像真实|赖帐|硗|死心塌地|武装|不义|少烦我|作俑|误期|服麻醉品|踩踏|险峭|游街|杀人者|等外|死亡状态|不明不白|疵品|过分操心|上吊|不舒适|色欲|搞飞机|否认|大而无当|加害|吃后悔药|鼓惑|怕生|极度痛苦|咒诅|准备参加战斗的|背货|寒|价值不高|不高|臆见|私生|白食|颇有微词|不精确|使紊乱|浑说|虎视|恐怖统治|急性子|皮脸|烟雾|介怀|饿昏|不清不楚|诛戮|尚未|反动的|有碍|毛坑|孤儿|气急|异乎|暗自|茕茕孑立，形影相吊|没能|浅薄的|肥大|败家精|伪造品|辩驳|奸贼|随风使舵|现世|骄傲自满|怨怒|杀人如麻|减低|疣赘|惋|干恁老老鸡掰|骂骂咧咧|艽|克制|使惊讶|不可否认|巫婆|愣怔怔|呛声|骇然失色|赤裸裸淫秽|凝重|不可能之事|难以置信|不严密|干干巴巴|愍|偏执狂患者|花搭着|不识字|残破不全|可疑分子|无法计数的|表面粗糙的|冷血|戚戚|神经病|哂笑|侵略国|一脸稚气|头子|过剩的|携贰|干你娘老鸡巴|逞威|不值一文|超常|哭得使..|根绝|损伤痕|说打就打|占用|使恐慌|怪癖|空洞无聊|阎王|还不够乱吗|道德不好的|大故|假充|没法|漏损物|霉气|不测|传染性的|阻挠|疲弱|油腻|现实的|不光明正大|烈|进攻|冗长的|复杂的事物|气愤地说粗话|砰然|乌灯黑火|哄然|求助|宽宥|卑鄙的人|不忠的|悲哀的|残敌|奸恶|响而刺耳的|不情愿的|啪嗒一声关上|百无聊赖|穷途潦倒|怎样|涂炭|阴森森|密|机械式|未成熟|大大咧咧|旧式|走失动物认领栏|宠儿|桀纣|绵软|淡|搜括|无风三尺浪|声名狼藉|不可恢复|弱小|魔窟|苦工|感到疼痛|更坏的事|使举止失礼|不确切|刍|秽行|无法忍受的|拒绝承兑|自吹自擂|自怨|孽种|不宜的|禁止接近|朋比为奸|妖艳|独裁者的|不虔诚|笨手笨脚地做|油汪汪|笨手笨脚|丑陋的|脸皮薄|砍倒|槁|争论|恶心的|驽马|猛击|报废|明枪暗箭|怏然不悦|突然|脆而不坚|牵念|利己主义的|无把握|傥荡|仇杀|差迟|退坡|盘陁|毫不在乎|不成功的|舔鸟蛋|忧患|斜|徒然的|操你母|愣|不可告人|隐然|糟透|囊中羞涩|衰萎|扰攘|使不关心|不得要领的|一隅|杀人|没教养|毒杀|死一般|不成样子|痛心的|鞍伤|较坏者|滥用职权|懂个屁|谤书|费用浩大的|暴风雨|漫不经心|坑害|娇生惯养|苛杂|率然|兽行|光怪陆离|减损|使失去勇气|不可挽回|仓皇失措|虎踞龙蟠|拿人|不合标准|胡干|抛弃|破绽|怆怳|飞溅出|怏|尸体|责罚|亳不|联络|空洞洞|犯错|不信实的|想呕吐|阿谀逢迎|厌气|被扯破|行刺|盲目的|混淆国际视听|克扣|偷安|不实在的|临时地|罪的宣告|避免直接答覆|堕落者|污垢|告诉错误|诮|贼巢|造反的|臭棋|苛|偏向|畸形的|嗓子不好|乞降|干走|离索|无情的|无法|不小心|无稽之谈|不小心的|不成体统|相差的|苦不唧|严厉的|惨怛|呆笨的|说蠢话|击退|阴凄|细碎|谎|短气|要吐的|浮荡|鸟样|鸷悍|失恋|神秘|杂交|被撕破|谩|讹诈|虫害|过强|骄躁|报仇|哭妈|啼笑皆非|过分简单化|破麻|失业人数|废弃|变淡|若明若暗|面生|不雅|隐身|跩什麽鬼|不愉快的|罢了|白痴的|偷偷摸摸的勾当|继承者|夸耀的|盲信|受挫折|满腹牢骚|抽风|玩人家|别离|缛|断魂|反侧|称霸|怪诞的行动|诈唬|痴傻|阿Q|不成话|不方便|使受严重损伤|闷热|没羞|徒劳无益|罗哩吧唆|走马观花|锯掉|重打|煽惑|理不直不壮|台湾之耻|斩首|抖搂|管我|宣布中止|拜金|异形|讽|相差|独裁的|参差|哀|漠|病歪歪|不可预知|扭捏作态|油腻的|谬误的|魂飞天外|负气|孤寡|圆|使极度痛苦|听不清|唱衰|名落孙山|不得人心的|荒凉的|多阴雨的|胆大妄为的|粗暴的|赛你娘|肏你|有失偏颇|使暴露|受损失|被议论|使逆行|气愤|惨笑|害羞|未减轻|不名誉|不现实|诧异|自专|含羞|搞什麽鬼|淫词|诡|吵扰|老猴|懈劲|快活|嗟悔|闹性子|娄|搞了再说|老窝|不合宜的|好挖苦人|认输|害臊|一拳|肇事|向隅|该死的|浮夸|疲困|沦为乞丐|紧张不安的|把持|旧病复发|加罪|无端端|妖术|透顶|遗失|复杂|挑弄|等因奉此|兵乱|强加|虚伪的|含糊地说话|过量的|暴风雨的|围困|不可靠的|悔恨|无语问苍天|殚|前後颠倒|偿付|打斗|鸟屎|骑虎难下|浮渣|讶然失色|反反复复|科以|陈货|瓜田李下|不明显|手黑|貌似强大|说话不算话|后患无穷|宠爱|禁止使用|不逊的|败德|被扼死|由他去|企图|过河拆桥|疏阔|投井下石|放任自流|粗鲁无礼|匪巢|吼道|垮掉|短见|暗藏|阴云|罗嗦|瞎眼|有得瞧|之恨|家长式|砍击|气焰|奔逃|专门|奸刁|极恶的|泡病号|背人|怆恻|失色|哙|没有能力|眼花缭乱|毁害|成问题|作嗓子|装作|用矛刺|一张臭脸|大吃一惊的|误导的|瓦全|不忠实|闷闷不乐|不生育|无可|找事|篡国|无能力者|炮击|囚徒|忧郁的|鬼天气|不结果|画皮|怍|失去能力|贪得无厌的|禁忌|不留神的|夙怨|愣神儿|滔天|不幸的|发出砰声|不实在|恶劣的|气死|恶根|黯然销魂|闷郁|狂风大浪|烧伤|调唆|苟延残喘|不适宜|制止物|极端的|鸣冤叫屈|鸟不拉机|老态龙锺|诽谤罪|无益|背信|伤害的|搞屁|无家可归的|不正常的兴奋|权门|破坏我的心情|反其道而行|硬逼|曲曲折折|惦记|麻醉药物|带赛|作梦|再犯|得不到休息的|逼宫|看不上|打入地狱的|愤激|发出嘈杂的声音|密不透风|拳打|打手|屌ㄌ|闷沉沉|越礼|令人寒心|斜歪|侮蔑|反冲的|破机八|仗持|忍受不了|猪狗|役使|凹凸不平|老二|不尽|牛|破脸|用诡计取得|不成功|恶名昭张的|不值|蛇蝎|孤高|杀死|讨厌鬼|疯癫癫|甩不掉|抠|反证|辱命|下垂|不值得|心有余悸|狡|愁|真给他|一点点|越轨|成事不足，败事有余|发酒疯|模糊不清地说|椎心泣血|挡开|破裂处|毛骨悚然的|猛冲|有差异|低层|破坏名誉|惘然|不安定的|渗漏|被控|急急巴巴|含怒|无关重要|枪声|狂言|匆匆忙忙|拖紧|得宠|起诉状|油|推涛作浪|虚诳|围住|光亮|真气|痛恶|矫揉|茫然|分裂的|暴卒|言不及义|精疲力尽|逃不过|不近|蒙冤|吊儿郎当|侵入者|射击|招致毁灭|反攻|找茬|轻蔑|娇贵|素昧平生|紧巴巴|扩张|暗娼|大胆的|使失宠|金刚努目|捞取|娇嫩|不友善地|刺打|低效|对付不了|脱离|极可厌|不正直的|套话|无望|撤销|愤怒|藐小|用滥的|无理由的|孤傲不群|诡辩的|逆向的|找茬儿|说不过去|虚无缥缈|闷住|爱挑剔的|吠尽|使恐怖|脆弱的|围城|玄虚|奸徒|惊异|干你|无远见的|秽土|不活泼|低声含糊地说|敌探|麻木的|难点|居然|反作用|苟合|暗中来回寻觅|厄难|可望|牟取|吐痰|老生常谈|死不瞑目|卑屈|哀惜|绝路|昏庸无能|儇|强击|急促地说|克星|蠢才|喃喃地说出|嗒丧|间不容发|没受教育的|泪如雨下|气疯|恶性肿瘤|不肯越过障碍物|竟敢|局促|变化无穷|怒目注视|灰溜溜|逆向|咋舌|下手|冥顽不灵|拦劫|不好使|受诅咒|应斥责|使烦恼|过得去的|门外汉|啥玩意|置之度外|鄙|未必的|失魂落魄|不受欢迎的|使凌乱|不宜居住|爱吃|失着|难以取悦|相异的|冤狱|迷濛|单挑|无行|不如|捕捉器|隐隐绰绰|碌碌|一不小心|芴|蛮悍|鸡歪|心情不好|没法儿|挤过|道德不好|差可|迷茫|关我什麽事|穷寇|呜咽着说|沉陷|算了|蠢头蠢脑|淡而无味的|黑洞洞|充血|悲观主义的|使堵塞|傥|灰朦朦|专断|不祥的|爱搭不理|斑驳的|幽幽|鸨母|质量差|势不两立|沉渣|急煞车声|使纯|效尤|黑话|抹去|劫难|黑森森|怪异的东西|心绪沉落|浊世|不知所云|特权|没到|使污浊|勾连|不熟悉|紧巴|哑的|逞性子|极蠢之人|痴呆呆|撒旦|错误地|窝憋|使厌倦|砰地|息息相关|传染性|未获|使用计谋|谋害|奸宄|气急败坏地说|强使|束缚物|密告|古怪的|脸上发红的|使减少|湎|霸权|可怜|对..提出质疑|求情|用带捆住|持异议|差的|尔虞我诈|没什么了不起|污秽的|没骨头|惊爆|流亡者|白日梦|大材小用|假装的|嗤笑|相提并论|使迷惑|弄虚作假|流出|歇斯底里症|炸药|喧嚣声|狂怒的人|不成|打碎|面有愧色|激烈的|毒草|诱使|尘嚣|宁可|以..为赌注|不着|心虚的|揩油|大吃一惊|自任|拍马|完全不重要|被分解|胡|未归类|饿死光|贫乏的|走得慢|穷人|野草|狂恣|贪求|诳语|当不起|嘶哑|人云亦云|耸肩|心里堵得慌|佻薄|猛攻|妄语|急走|不省|是我的错吗|无常的|国难|未经通知的|遗恨|愠怒|战乱|劳累|损失物|苦脸|过敏的|无补于事|示不满|不一致|饿死|怆然|下不来台|非正常|敌伪|心浮|蹉跎|不合理的|品行不端|良心被狗吃|感到可怜的|以牙还牙|缺德的|负数|挤巴|拐卖|詈|异说|私弊|任重道远|分心|软弱无力|酥软|痴痴|不耻|落泪|谋略|胡思乱想的|不正确|呆滞的|不可信|使挨饿|使破产|卑劣的|迂|行径|用愤怒|动荡的局面|愎|不赚钱|毒蛇|造次|错愕|引起死亡|次要的|消磨|行为不端|结结巴巴地说话|迟到的|不顺利的|悒悒不乐|不能压制的|使僵持|将心比心|乖张的|黠棍|闪人|逼上梁山|虎口|病毒|不理会|吓呆的|不合规定|大笨蛋|不值钱的|獠|分泌毒液|横冲|作势|诚惶诚恐|出糗|死得难看|问罪|使惨败|标榜|可鄙的|拆桥|挤向前|令人生厌|一脸横肉|低微|一下子爆发|阽|其反|操贱役|疑虑重重|卸磨杀驴|厌恶的|烂污货|攀附|报应|辐射性微尘|不仁不义|攀高枝儿|轻描淡写|叛离|价格不菲|不长|口舌|乾咳|小心眼|指鹿为马|外来|乱盖|啧有烦言|完全丧失|杏眼圆睁|投诉|蹩脚的|忌|吹嘘说|残|诛求|擅离|发怒|卡住|不甚重要|节外生枝|皮|自卑感|要挟|刻板的|耗费的|追击|流窜|不纯的|窝火|长线|大量喷出|无权|烂帐|不会|点卯|败笔|不分青红皂白|感叹|干醮|服罪|包藏祸心|恣|迂回说法|傲|传染病|涩苦|疙里疙瘩|机械性|毒品交易中收钱而不给货|离题|乱撕|遭难|减小|拉后腿|不是人|矢序|丧亲|声明拒付|多风暴的|毒药|文抄公|讥讪|设圈套|不值得的|杜撰|敲诈勒索|中山狼|等而下之|事倍功半|外面儿光|吃错药|未见过的|战役|鸡零狗碎|告诉错误的消息|战兢兢|不成熟的|随声附和|不恰当地|衔冤|裂缝|嚎啕|围殴|寥|自以为了不起|艰难的|取得|现行|偷偷地吃|误区|无补|跌跤|是怎样|不平坦|我恨你|声色俱厉|夸张的言语|与..打仗|嘎|弄翻|用力击|看不开|崎岖|有害的|貌合神离|相反的|苦果|不幸事件|可惜的|躁动|不受尊重|捞本|死黑店|极可憎的|荒|使晕眩|够呛|该罚下地狱的|自求|抨击|机机歪歪|患得患失|劣马|愤世嫉俗的|旷费|伤元气|吃得过饱|不和谐|烂校鸟系|喧噪|挖空心思|干犯|乱乎|挑逗性|从严|勒逼|哀痛欲绝|死要面子|斗争|造反|躲懒|输理|匕首|局限|海底捞月|失去感觉|闲磨|互撞|恶名昭着|悲辛|心眼小|无法计数|吵嚷|酷刑|悲痛欲绝|见识短浅|被扼杀|持续的叫喊|鬼祟|串连|强求|无秩序|变化不定|后顾之忧|失志|辛苦地|拒给|逆|大意的|烦神|衰朽|强辩|臭味相投|死命|眼皮子高|默默承受|不疼不痒|造成破坏|婞直|愁云|微弱的|变破烂|哄诱|激浪|惊惧|尖嘴猴腮|用欺骗致使|无病自灸|忿忿|惨状|难为情|被泼水弄湿的|窘|求乞|公敌|左右为难|抱歉的|雕琢|坑骗|引起震惊|置于脑后|怒|怒火|千部一腔|馁|吓跑|外来的|硕大|搞钱|淆乱|低值|贬损的|冠冕堂皇|羞窘|厝火积薪|说模棱两可|气不平|求教|葬送|空袭|在困难中|对头|有病的|不肯接受|烈酒|罗唆|妄|痛苦的经验|优柔寡断的|减少之量|荆棘载途|丧失亲人|肋脦|故步自封|干扰者|不纯|使讨厌|因魂不散|不能区别的|利益输送|创痕|郁热|臭名昭彰|白忙|蓬散|反驳的|掉魂|伸腿|禁制|有矛盾情绪|实利|佻|冷峻|磨损的|草率从事的|数说|翻手为云，覆手为雨|危地|受不了|使阴暗|不是滋味|零丁|借古讽今|难捉摸|不雅观的|支付利息|造假|不为|不开化|够戗|未发觉的|蒙事|不应该|懒人|发出咯咯声|无效果|好战的|悔悟|踟躇|烟幕|狡计|滋生|劝阻|关他屁事|债务|贬低..|没关系|生活放荡的人|亳不留情的|贿金|下不了台|不宁|毛躁|妖魔|离开|坐守|恃才傲物|媸|无眉目|昂贵的|巴掌|水妖|失常|六亲不认|偷偷摸摸的|非常悲哀|不合意|迷迷茫茫|奸诈的|挟持|不胜任|豪绅|求救|丑不拉叽|碍事|妄动的|垂头|平淡无味|风浪|鸡巴毛|没救了|痛苦|小儿科|急功近利|使丢脸|疙疙瘩瘩|无可置疑的|闪失|哝|怀恨的|化脓|原始|蛀坏|丑角|蒙胧|自怨自艾|总是|愁惨|泡汤|一团漆黑|铩羽|逞能|阢|曲折|患病的|弄皱|推托|遮盖|酸辛|空幻|捶胸顿足|放刁|惶惶不安|卮|变得无耻|渐失|欠骂|烂学校|使人产生不愉快的感觉|阿谀奉承|无耻的|倾斜|铤而走险|半疯儿|散|心高气傲|仇外情节|智障|猖|愤恨|寡言|未完全发展的|绑票|浑头浑脑|俗丽的|搞统一|谲|猛烈抨击|固定不变|冷销|使毁灭|非正式的|守株待兔|图|救我|詈骂|不够完善|鞭子|蚍蜉撼大树|短缺|发牢骚|轻易|卖弄风骚|匆忙地做|波谲云诡|拒绝|含糊的|不自在的|无可争辩|使失败|与虎谋皮|严峻的|悖理|文句不通|管你去死|养肥|使发怒|开玩笑|宿命论的|使过早硫化|可骇|有仇|恻然|明争暗斗|在..留下疤痕|工作过度的|猴儿急|畏罪|各色|出气|无救的|发昏|抵罪|砰击声|评头品足|指手画脚|孽根|乏善|侵越|索价|以怨|品性不端|使消散|无稽谰言|含混的|残忍的|倥偬|寡廉鲜耻|肉欲|变幻无常|偷闲|佞幸|白饶|仆人的|愧痛|不引人注意的|一再|对不起|掠夺行为|顿足捶胸|窜扰|阴骘|颓势|之仇|形单影只|秘|无声音的|掉下|苦口|使降级品格|讹赖|怒气|起鸡皮疙瘩|惭愧的|歼灭|憋气|脱轨|转移性|隐隐|无助的|蠢货|前後矛盾|短暂的|敢喵|丑死了|风暴|不可避免|肮里肮脏|凶犯|令人讨厌|寞|发泄|危险物|孤独的人|凄寒|荒芜的|赌运气|毛毛躁躁|慢吞吞|变旧|拜托|难以明了的|不是味儿|家徒四壁|混浊状态|媚世|虫子|炮轰|挫赛|低姿态|叹气|狮子大开口|不牢固的|哇咧|傅会|哗变|筋疲力尽|啜泣|落网|惹到|恶脸|聒耳|绷着|低智|抵消|倾巢|穷兵黩武|蠢翻|透不过气来|冤情|激愤|打憷|逼视|担负|抑郁寡欢|缺心眼|白受气|愁容满面|毒气影响|横过|匪祸|老调|无可奈何状态|火坑|凶年|芜劣|迟钝的|论战|歹|强|战栗|见利忘义|难|贿款|枯萎|陈套|性格内向|谇|破洞|假的|被碾碎|响而刺耳|从重|差失|饥寒|仇佛蔑僧|供认|寒冷刺骨|打哈欠|眼泪|不长进|首恶|背后|贬职|大胖子|引起反感|脂肪|霭霭|要命|卷逃|怒喝|惶惧|惹怒|自杀|邪魔|不赞同|不切实际的|幽|陋俗|可悲|骂他|讶|怕事|乘人之危|浩劫|喜欢吵架的|无风生浪|干戈|越权|充数|难治疗|惯纵|料想不到|不稳固|糟透的|追逐|横财|使退却|悲号|拒绝..的要求|凶巴巴|不健康的|看不惯|令人毛骨悚然|挤满|自任不凡|闵|讨|跩的二五八万|手紧|违章式|暗中|奇怪|急死|令人折断腰|使沦为乞丐|穿不出去|未解决的|打入地狱|意外事件|荒弃|宿命|不毛的|夷平|不结果实的|冷言冷语|无端生事|趋奉|靠夭|冥顽不化|烧包|懊|他马|好吃懒做|得罪人的人|瘟疫|灼枯|涉嫌|诱胁|残酷的行为|闹脾气|无决断力的|鼎沸|违悖|生病的|漏损|溃散|不能胜任的|质地薄的|颠沛|与..匹敌|自私的|犯浑|使人不愉快|冷遇|拉帮结伙|死灰复燃|摔倒|没有勇气|下三赖|无价值的|急流|掊击|蔓生的|烙跑|搞了鬼|使沈没|火并|肤浅的|拥挤的|地牢|习惯|漏气|吓出|诘屈聱牙|狎亵|失业的|压迫的|闲言闲语|不准|威慑|搞性|胡乱搞|斜体|会蔓延的|自豪|处刑|随风转舵|乏善可陈|使更坏|使凹陷|腹诽|走着瞧|反对称|无生命的|挤出前进|没有用|激动|狂骂|丢魂|邋遢的|惑乱|忍痛|引起嘲笑|骂名|没事|幽灵|秃|处於不利|逛荡|处境艰难|遭遇|进行恐吓|乞食|无魅力的|谣传|损失者|背兴|一般|难接近|混吃等死|愀|窃据|尚武的|没用的家伙|怀敌意|割下|面无表情|恐怖症|使无能为力|惯犯|不讲信用|轰炸|煞费|好假|僵直的|使变得低劣|度烂|拷问|泪动|提出论据反对|无深虑|食而不化|自欺|小鞋|经不起|狗男女|改变成|敌寇|怨尤|拘板|粗暴地|一无所长|痞棍|吸血鬼|甩掉|翻找|彻头彻尾|擦痛|令人沮丧|斑驳|无变化|不可信的事物|生搬硬套|塌落|难相处的|梼昧|死肥猪|狠狠抨击|催促|老实|顿生疑窦|做梦|委婉|不讲道理的|四面楚歌|败兵|气的半死|狂乱|带来痛苦|折旧|用旧|使散落|芭乐问题|前怕狼后怕虎|名不副实|不关心|骗取|看扁|鲰|追捕|看不顺眼|续貂|耀武扬威|近视的|懒骨头|泄恨|细弱|简陋的|绝对|狗屁|不问三七二十一|操你个鬼|微弱|自以为清高|窒息噎|过剩|宽赦|不重要的|投合|退场|心情浮动的|使厌倦的|搜刮|死猫|不熟练|摆脱的|侜张|荒漠|气汹汹|义愤|如兽的|轻佻的|落市|扯懒蛋|一巴掌|杂凑|鹑衣|寒苦|跩屁|沦亡|复杂的因素|借题发挥|一气之下|挤轧|死者|歪歪扭扭|黑漆寥光|强迫..服务|不省人事的|睖睁|羞赧|哭妖|抽抽儿|不便|造成损害|放狗咬我啊|天昏地暗|丧命|砰击|厉害|道貌岸然|伥鬼|中饱私囊|裹足不前|不管用|死老百姓|坚持己见的|难治疗的|噘起|舍本逐末|缺欠|污物|模棱两可的话|非婚生|用滥|延期|狂傲|妖雾|受到阻滞|套购|肉|脏话|不两立|悲泣|反话|精神错乱|低哦|不可否认的|自傲|纷纭|龟缩|解体|怪胎|干谯|肆意妄为|无关痛痒|不能矫正的|打败|跌份|被闷死|真他x的虽|逃亡者|绞杀|挤得要命|脑满肠肥|当头棒喝|被弄死|被压坏|丑男|丢丑的人|强夺|如野兽般的|懒到极点|艰难险阻|恐布份子|鬼|无理性|犟嘴|责备话|有目的|怫然不悦|断然拒绝|千方百计|吵到|久坐|嫉妒的|半真半假|令人恶心|恐布|求求|可耻的|将交保释放|飞语|违法的|松垮|惶恐不安|唾沫|办错|自闭|叱令|冷厉|昏|无名火起|停业清理|搞分裂|呕吐物|不快乐|没个好脸|丧友|总行了吧|黑乎乎|未详细说明的|耗神|施以|六神无主|瞬息万变|遭受风吹雨打|宗派|不可理喻|一再叮嘱|傲慢无礼的行为|扬长|过量|悱|觉得疼痛|作贼|有毒腺|淫污|晒焦|下垂度|形同虚设|破门盗窃|弄权|饿殍遍野|西风|骄傲|沈沈|怨恨引起的|该咒骂|套汇|恶毒的|残酷无情|惶惶然|偷偷|孱|照本宣科|琐细|复合型|绕圈子|患|可怕的|你就完了|千疮百孔|鼠窜|失明|强迫..入伍|老赶|不守规矩的|糟蹋|气坏|同病相怜|大而笨拙|不称心地|不相容|神神秘秘|塞拎娘|通牒|生番|不到案|诽谤性的|如死一般地|使不正常|感到後悔|凄怨|不人道|减少|更呕|翻然悔悟|密藏的金钱|不确定的|坟墓|荏|噩|软|倒毙|屌琅当|烦言|嗒然|怒气冲冲|困乏|郁郁寡欢|一厢情愿|低廉|指使|丘八|长痔疮|减弱|党棍|恹恹|不愉快|妄取|气死我了|不顾一切地|未揭露|代价|死板板|躁|不新鲜|变幻莫测|后患|重击|混交|屠宰|不友善的|容易受惊的|哀嚎|诬告|形格势禁|哄骗做|暗暗|玩忽行为|忽略|冲犯|一掷千金|悻悻|有诡计|铁石心肠|群魔乱舞|用树篱围|挂名|哀悼|窳惰|劣根性|扯碎|四分五裂|味道不好|鲁莽的|哀鸣|关碍|虚幻的|赖子|恶脸相向|谁来救救我|卷土重来|事情|搪塞过去|愚氓|搁下|嘴硬|应该谴责的|令人头痛之事|使一蹶不振|刽子手|受阻|为祸|消耗热的|滋事|极度悲伤|外伤用的|泼|骂一顿|拿腔拿调|恝置|帮闲|徵收|嘲弄的物件|吹求|缺乏自信|恧|险象|亏累|低效能|羞|闷着|伤耗|不善交际|争气点|急忙|歪缠|目中无人的|耍小姐脾气|搞公关|撒村|不平整|伧|诱捕野兽|流空|诘|隐僻|怀恨|自私到极点|正式放弃|凶狠的|隐伏|尖啸|拉帮结派|纵情於|枯燥无味|脱口|政变|闹法庭|鬼怪|机歪|你妈的|联合|较劲|无远见|拐子|何不|拖延|妄人|催逼|丢人|沉吟|交战国的|黑帮|不舒服|使疏远|笨脚|瞧不起|后门|哑口无言|弱小的|赖学|杞人忧天|硬|违约|歪门外道|在..下挖掘|使陷危地|猛然一动|冲压机|祸端|嘲弄的话|心惊肉跳|不齿|晕眩的|狗肺狼心|猛烈的力量|困局|抽打|未指明|延缓|悍然不顾|通告废除|鸡屎肚|心急|闷闷|抄袭|秽|干你祖宗十八代|降低..|面如死灰|抽噎|没规矩|悒郁寡欢|扰扰|走神|被打碎|多病|形同路人|切齿|使堕落|亚|心胆俱裂|砍痕|易受..影响的|多馀物|馀地|引颈企盼|不合标准的|残忍或好色之人|起诉人|夫子|惨不忍睹|鼓捣|杂事|潜入|坏去|启衅|不好听|什麽东西|冒失女孩|抱歉|破|欲望|毁约|痛心|无能力|利用我们|不自在|沈迷|没觉察到|复杂性|告负|打岔|脏乎乎|腐败堕落|矜|高谈阔论|文过饰非|猛烈的抨击|寄生|漫无边际|风雨飘摇|串供|腐烂的|黩武|荒唐的|暗黑|猛地落下|胆小怕事|忘情|悄悄踱步|逞威风的|不平均的|敌手|丧失的|不留心的|变污|假想|驳回|脾气坏的|令人不满意|陨灭|挂牵|不信任|恶兆|拂逆|可疑|哭爸|无遮蔽的|了不起|嗜血成性|黑枪|拙涩|邪财|呱嗒|敲打|忧思|急于|掉泪|浮光掠影|惨绿|忷|疯癫的|墨守成规|夭寿|谗害|乌涂|流逝|不礼貌|闹情绪|坠毁|滞後|怯生生|沉默|使透不过气来|遗臭万年|通奸|心狠手辣|没样儿|心力交疲|花言巧语|喷溅出来|慧黠|猛然|盲干|奸计|空谈|挪用|一团糟|险兆|有种|不适应环境|过度的|凄|杂音|心狠|遇害|货损|饮恨|拉山头儿|交迫|尖叫声|谬错|唯恐天下不乱|很蠢|不能的|邪曲|兵痞|充军|淫荡样|违抗命令的|不均匀的|不太|不起作用|倾倒|心碎|假话|悄悄|放诞|出格|宁愿|疯狂地|劣绅|暴雨|使疲倦|烂摊子|忿恨|浓艳|包涵|官场|潮|金玉其外败絮其中|纵情|浮华|不均匀|自作聪明|无重要性|癃|愁眉紧锁|真烂|不留神|竹篮子打水一场空|使泛滥|难以相信|反复|不眠|背信弃义的|暗杀者|数不上|窒息的|塞到|争论的|派不是|破碎|暗算|混淆不清|贪生不死|发抖|失范|银根紧|反讽|干恁|老虎屁股摸不得|僵硬的|怨仇|卑鄙地|势均力敌|违误|脆的|口齿不清|弃义|诡秘|为..感到遗憾|为人作嫁|谈不拢|悲愁|破衣服|纳粹|脚踢|开小差|不懂事的|受窘|松散散|复辟|死缠活缠|无所不为|睁只眼闭只眼|骂出|低级的|鬼鬼祟祟做事|不顾後果的|不重视|零零散散|倒置|恶兆的|使无法动棋子|呜呜咽咽|没受|想不到|沽名|嘈|烟雾弥漫|给...一点颜色看看|吼叫|使恶心|猛踢|死东西|贪婪地吃|讹传|悻然|奇形怪状|髒唐烂汉|臭气|绷着脸|闹得不愉快|皱纹|不利于健康|黑灯瞎火|行为不检的|放黜|变得更坏|迫切的|狡兔三窟|羁勒|欠钱|散落|揉磨|走失的|表功|不明智|间杂|艰辛|酸溜溜|搅缠|沈闷|作奸犯科|惊醒|怀疑宗教教条|不为人喜|腐蚀剂|不可救药|身无分文|心神不安|船失事|吃饱撑着|刑事被告|哎呀|树敌|随你便|怠惰的|歌功颂德|奢华的|虚假的|冲三小|顾忌|撞击声|凄酸|不文雅|爆炸的|褶|苦海|使痛苦|受诅咒的|轻侮|雷同|失去母兽的小动物|啷|过意不去|轻信的|后果|显示|自我|抑制的|无足轻重|脚步沈重|令人愤慨|黑咕隆咚|逃亡的|谅|无节制|顽强|被掩饰|忘记|落荒而逃|薄|疏失|郁气|栽跟头|脱离常规|刀光剑影|愚昧无知|妈的|敌焰|拂意|疾苦|通病|暴怒|无谓|权谋|臊|谗佞|愤懑|歉甚|背井|呆气|夙嫌|无聊的|吃同类|内幕|稀罕|不明了|仓皇|魂飞魄散|帮凶|驱逐|怕死鬼|欺哄|脚步沈重地行走|掉以轻心|毒谋|揶揄者|砍伤|死爱滋|使断裂|放毒|剧痛|迫切|规章制度|朋党|盗卖|交恶运的|使载重|哀鸿遍野|说含沙射影|狼狈不堪|悬空|改变不了|欲哭无泪|徒然|微尘|未达到|频繁|母夜叉|这麽烂|阴森地逼近|失去感觉的|像哈巴狗一样|难民|歪的|叨叨|不知羞耻的|幽怨|裂隙|水火不相容|背信弃义的人|告密者|微暗的|大动肝火|刺耳的|无政府主义者|好恨|恶骂|扁一扁|死得很难看|原子尘|干麻|有弊|病人的|急巴巴|遭瘟|乾燥的|不下|贸然轻率的|生疏的|使失去能力|不易弯曲|功利主义的|双关话|窥伺|不经意说出|他妈妈|使下垂|皮里阳秋|错|大摇大摆|锱铢必较|喀嚓|大声要求的|置若罔闻|体惜|不安的|感到抱歉|毒化|清算|不大重要|不对头地|惮|不正当|拗口|发出嘈杂|子虚乌有|浮皮蹭痒|晦冥|不相适应|高不成低不就|不大可能之事|刺目|模糊不清|懒怠|怕羞|嗜杀的|使沮丧|庸人|雾里看花|元恶|干娘|慢的|肆扰|抱恨终天|要饭|转向|对..起反作用|拼命|输家|谢绝|招供|使挫折|炫弄|废然|二流子|面无人色|腻人|删去|喧|哀伤的|冗员|絮叨|花腔|喜怒无常|不死心|教得烂|添堵|悍|易怒的|挤挤插插|斗起来|瞧不上|狠很|反悔|变阴沈|如死一般|自怜|致命的|低级庸俗的|烫手|毙了他|体念|嗜杀|该责备|枉费心机|无计划|半路出家|无目的|洗劫|假模假式|心如铁石|不牢靠的|不予|鬼计多端|乏人问津|不能辨别的|吃同类的动物|轻慢|排外|乞丐|泪流|黑茫茫|空转|赃款|马屁|打问号|眼花缭乱的|权诈|鱼游釜中|惊呆|纷争|抛头露面|染缸|犹豫不前|向隅而泣|拉拉杂杂|无效率|危险|发火|泄漏|冲打|没头脑|作茧自缚|恩将仇报|爱管闲事|拆散|不妊|劣学生|南辕北辙|酥松|逐出教会|凶焰|报怨|受制|沈闷的|怀着恶意|自封|不胜任的|诬蔑|自任不凡的|罪咎|匪帮|不能解救|使惊惧|不足取|碜|高成本|虚报|秽亵|不正的|恶臭的|打出|不胜|战争的|不可行|不稂不莠|生疑|不易的|巧取豪夺|挨饿|危险期|破灭|恨入骨髓|模糊不清地说话|闭门造车|不管怎样地|被诅咒的|悲观的|未确定|黯|颤颤巍巍|自责|不得力|恬不知耻|恶魔般的|有意|罪恶昭彰|旗号|不对茬儿|永诀|稗|没见过世面|自命为|弹丸|轻蔑地笑|怏怏不乐|用力按|辣|插手|伤疤|多义|迎合|中计|大叫|迂儒|突如其来|不结果的|荒废的|牲畜栏|渔利|被告|满|恬淡|送葬|凡人|叫吠|惨景|意见|漠然视之|搞的鬼|彷徨|大谬不然|老辣|潜伏|酸刻|取巧|神经紧张的|判决|晦暗|忘本|经济拮据|榨取|不说话的|得饶人处且饶人|妈ㄉ|江河日下|愚蠢的|你他妈|错字|得势|使一团糟|口诛笔伐|反复告诉|攻击性|大错特错|懦|走人|轻易停止|滥竽充数|不吉利|窭|明目张胆|吹毛求疵|大噪|好斗的|有碍观瞻|漂泊者|搜罗|不高兴|摩擦|使有缺陷|耍横|弱智|不透气|自负的地方|呕气|忿忿不平|怔怔|死记硬背功课|最屌|裹胁|战败|混事|走过场|气昂昂|仇冤|应名儿|恚恨|廪|残疾者|自掘坟墓|喀嚓喀嚓行进|海损|摸不准|不忠实的|破烂不堪|征服|蠢蠢欲动|不坚固|惘|无效能的|琐|烟鬼|猜想|迂拘|物伤其类|无帮助的|发出嘈杂声|不吉利的|潜伏者|暴躁的|好死不死|搞什麽|无子|负屈|人头攒动|势利眼|心情不稳的|造成损害的|破门|搀杂|碎裂|淫威|羞恼|拘|诱获|追赶|损污|丢脸的|虚张|漠然|嗟叹|不能说明的|碌|战场|溲|拍拍屁股找不着人|压下|熊包|不着调|被逐出的|荒诞无稽|不懂事|体谅|鼠辈|草|尖锐的|娆|赌掉|隐密的|欠你的|灭绝|屌什麽|使失明|降低|数不着|丑态|不依|乳臭未干|荼毒|恤|疯狂的|骂髒话|冤诬|噩梦|想不开|装备不良|搞妇运|硗瘠|令人作呕|退回|白事|低首下心|工作过度|耳生|恶名昭着的|逃犯|荒无人烟|烂女人|暗地|没有目标|使惊呆|躲避|道歉|自作|变凌乱|使人生气|疑心的|未得到|凌轹|做戏|离乱|给你们好看|成为空|余剩|教唆|险僻|情急|不愉快|赘余|作犯规动作|毒犯|死掉|怒冲冲|搅扰|打家劫道|没有头脑|困穷|警报器|惯贼|漆黑一团|好逸恶劳|歹人|打入十八层地狱|求全|恐怕|有..倾向的|瘫软|没两下子|关在|矫揉造作的|油脂麻花|失闪|不负责任的|恣睢|闲言杂语|乱臣|应声虫|天杀|抱憾终身|挤|悒闷|悖|罗网|戕害|着火|极愚蠢的|真假可疑|不合适的|有差异的|反对改革的|过火|煽动者|惊险|绌|对付|失去理性|愁眉不展|窒息状态|相异|震惊|爆炸物|跌价|虑|缺乏的|繁言|绊倒|高压|内奸|目无余子|粗鲁无礼的人|斗气|不信实|误入歧途地|痛责|木棍|卖不掉|暴君|失调|病病歪歪|贩黄|执傲|极不协调的|咎由自取|瞧不起人|败家子|放纵的|软弱的|郁然|拍击..使之前进|倔强|粉屌|顽皮|错处|敌国|惦挂|惯家|挑拨离间|扁到你说不出话|不悦之色|使延期|私藏|不郎不秀|衰竭|冒险|人生不就是如此|浑蛋|噩运|待价出售|娇|让你好看|妖精|泥泞的|瘦|滥调|尸位|半疯子|上瘾|不灵敏|满面愁容|给...当头棒喝|反垄断的|抱愧|共谋|死气沈沈|功利主义者|烂仗|不像|形容枯槁的|置之脑后|惊呼出来|废|伤心的|拘留|大洪水|烧焦|反覆|幽晦|散布|五味杂陈|碰运气的|狂放|不忠诚|幺麽|土得掉渣|残骸|排挤|失盲|效率很差|通俗|吃饱太闲|未缓和|争嘴|虐政|变迟钝|膈应|冷酷无情|去搞|刁蛮|假面目|油水|算啥|不完全|误入歧途|打着哈欠说|惊呼|疏远的|虎狼|筋疲|使变暗淡|易被瞒|认死理儿|呆呆|恶运|使惊愕|暗沉沉|恶浪|不安的状态|毕露|瞎闹|假装|挑眼|含冤|横蛮|出逃|国故|荫|自我本位的|羞于|刮走|弄凹|犯过失|落入|挑衅的|荒淫无耻|诱捕|苦的|权臣|怅|气不忿|盘踞|任人唯亲|业障|强占|吝啬的|官逼民反|狙|零碎|牵累|微茫|怎麽混|变动|草寇|误人子弟|谤毁|诱..入圈套|不坦率|遁词|风险|装糊涂|存有偏见的|闲荡|流亡|变得紧张|被迷住的|罪状|错乱地做事|红脸|坐立不安|鼓噪|菲薄|泡影|不韪|码的|负的|无法预料|鸟尽弓藏|陈旧的|乱兵|滴里嘟噜|中不溜儿|荒寂|毁伤|警惕的|不顺利|不能胜任|不充足|投弹|憋屈|使受电击|情结|磨缠|无生气|宰割|节节败退|有差别地对待|非婚生子|低声地|熊|狞恶|作惊人表演|败军|背包袱|傅粉施朱|戳壁脚|无用|含愤|魄散魂飞|文盲|胆小的人|婞|神经|阿飞|意义不明确|巨澜|使极|委屈|一阵紧张|意欲|倾销商品|令人讨厌的|有失检点|搅局|虐杀|恨|露骨|死胖子|偏心眼|卑贱的|滞钝|假冒的|冤抑|豪|心疼|烦燥|不休|信不过|你去死|丢脸的事|匆忙咽下|乱哄哄地跑|地震|谫陋|浮噪|剽悍|使不相宜|娇憨|坏情|话柄|不洁净|肮髒的|粗鲁地对待|东倒西歪|毒素|易爆发的|头壳坏去|咆哮着说|昏迷的|小鼻子|假正经|无感觉的|反覆无常的|未完成|曲意逢迎|强制的|不受欢迎|作态|积习|惦|招灾|使极痛苦|不详尽|用碎纸机撕毁|私愤|大声的要求|板板六十四|骂得很惨|戚然|扎眼|家伙|违抗|轸|爱挑剔|中毒|悲切切|哀戚|贿选|白面儿|寒冷的|引起紧张的|憋着一肚子气|悚然|发麻|未减轻的|颤巍巍|混球|勒抑|闲混|威|官迷|屈节|沈重地走|古旧|善变的|折断|与..格斗|怨怪|被勒死|吵的像什麽鬼一样|遏制的|使充满臭气|狂暴的|声称|利已|不得力的|不友好|虚构|毒贩|要紧|欺软怕硬|敛财|倒悬|赧颜|隔心|参错|谴责|一阵狂风|使爆炸|窈冥|权宜|乌漆墨黑|如丧考妣|稀碎|烂车|隐蔽的|批驳|不庄重的|拉长个脸|纹裂|撕裂|狡赖|不洁|宽恕|佯装|毙了|说风凉话|无价值|怫然作色|堙|沮|增恶|哀矜|失眠|沸沸扬扬|风风火火|禁止的|差别|公然|未完成体|囚首垢面|淆惑|心情沉重|滥老师|不努力|翻车|寂寥|胡搅|倚靠|喜怒无常的|不良的|逐出|禁令|犬儒|枉法|作乱|不谨慎的|娇痴|善罢干休|冒渎|贝戈哥|偏枯|冤气|劳民伤财|慑服|操切|怪话|前科|蒙蒙|纰缪|依赖他人者|飞扬跋扈|胡思|闹别扭|丧心|掊|不能决定|犯有罪行|唯恐|没有学问|犯傻|真他ㄇㄉ|蛀牙|残局|屠场|奇怪的|有点旧|搅和|伤感情|敢骗|心切|老是|死小鬼|无可奈何|不能决定的|老羞成怒|掩蔽|把工作搞糟|死寂|踌躇不前|钝|各别|丑恶的|无知觉的|开枪|胡说八道|寒素|蠢动|不合逻辑的|不安定|错失|有矛盾情绪的|不值钱的东西|嘲骂|残疾的|封闭|使发出撞击声|浑|起诉|蒙骗|彻底击溃|二百五|毒计|更恶劣地|饿殍|犹疑|凄冷|退役|慢吞吞地行进|纠缠不休|不在乎|说怪话|摸弄|催吐|纳罕|狗眼看人低|使得灾祸|陋规|罪愆|掇弄|信口雌黄|泞|费用大的|未经|芥蒂|不能信赖|问道于盲|不知道|残匪|破产了的|忝|撕裂处|不振|过头|看不见的|悔之晚矣|朦|邪祟|很臭|最糟的是|淤积|缠绕|逃兵|辛辣的|引起紧张|怨偶|刺耳声|得过且过|强烈|抹不开|是非|情急拼命的|在乎|雌伏|专横跋扈|疾|使无效|冷嘲的|虎着脸|以退为进|末路|推残|阴湿|落後程度|异端|呜哩哩|狂风|低等|使後退|成零|过分单纯化的|窝气|干燥|嫌贫爱富|冤大头|窄小|尖着声音讲|人穷志短|细菌|让你死|可怕的事|使人厌烦的|突然不见|谪居|凄楚|卖友|脱离常规的人|迷蒙|避讳|勃然大怒|羡余|十室九空|惨变|愚蠢地说出|望而生畏|走失|迷路|大烂人|败落|肥的|抢走|累赘的|成为零|怕死|巧舌如簧|义愤填膺|喜夸耀|没想|非自愿的|冤结|不敬|市侩|直撞|不消化|闹闹嚷嚷|伤|惊天动地|不像话|扭捏|沈重的脚步声|粗陋的|怔住|死沉沉|故意少给|擦破|口渴的|未击中|救命|小提大做|无子的|难捕捉之物|穷困的|赶快消失|邪道|向..开枪|仿造品|蠢|贪贿|反对..提案|使隔离|尖叫着说|咕哝着说|变得有缺陷|戏侮|肿痛|丢脸的人|豪奢|向下倾斜|卑琐|痉挛|吝啬鬼|窑子|步入歧途的|发疯似|形容枯槁|为人作嫁衣裳|危在旦夕|首鼠两端|易瞒|关押|设陷阱|批评家|监狱|使苦恼|不知道的|无道德的|疲劳|猛闯|压皱|卑躬屈膝|不肯定的|摆脱了的|奸伪|钩心斗角|致命之物|过桥抽板|盘根错节|死气|痴|不合规定的|惶|庸俗的|他妈|胡搞|矮的|扬言|马的|消极的|嗔|对牛弹琴|噪嚷|含泪|震悚|吃不开|怨愤|犯戒|一把死拿|斑点|艰苦|遍寻|羼|匹夫|挑动|泥古|不长果实|撮弄|摧毁|追究|有毒的|凄惶|摆设|不赚钱的|前後颠倒的|诬枉|构陷|叛变|拍马屁|令人失望的人|恶俗|内乱|死活|偷盗|打抱不平|缺乏才智|使心慌|困扰|山南海北|阴险毒辣|吵闹声|恣意的|杂讯|呆怔|小家伙|落难|毕命|清淡|贬低..的身份|里出外进|可悲的|飞短流长|不直截了当的|恼|羞耻的|肚烂|铁公鸡一毛不拔|不耐烦的|讪笑|超自然的|被议论的|弱不禁风|隐蔽|着三不着两|空论|不安|赛林良|旧病|满脸横肉|闹翻|拨弄|不悦|使费解|发狠|尖叫|任性的举动|失礼|自视|残废的人|迂远|僵死|瞎了眼|混混沌沌|盗劫|不长果实的|微不足道|拥有压倒优势|无靠|不近人情|不厚道|虚无飘渺|好唠叨|皱眉|有资格|被打|作贼喊捉贼|受腐蚀|隐退|羞羞答答|过不去|离题万里|盲动|不合法|不要紧|赊欠|蚀本|瞎|渺若烟云|不中用|闷热的|无重要性的|怒容的|焦躁的|法术|催迫|未开化的|背约|困穷的|龉|积重难返|高速疾驶|少惹|无味|铜臭|停止|不合格|怎麽混的|狗嘴吐不出象牙|堵得慌|萧飒|拉下水|积欠|谈何容易|跛足|烂到|顽皮的|芜鄙|竞争|易碎的|无形的|风头|饿得要死|妖风|挖苦的|殖民|沉湎|俗辣|欠周到|着急|恶霸|无家|障碍船具|危及|易被瞒的|三流'
neg2 = '被捕|腐败|涉嫌贪污|涉嫌受贿|涉嫌行贿|涉嫌违法|涉嫌违规|被调查|落马|遭调查|逃税|被处罚|刑事处罚|经济处罚|偷税|漏税|财务造假|假账|虚增利润|违纪|上市造假|侵吞国有资产|包装上市|虚假上市|被拘|被刑拘|跑路|失联|涉黑|遭立案调查|遭举报|经济犯罪|玩忽职守|徇私舞弊|抗税|私自挪用资金|挪用公款|非法吸储|非法集资|诈骗|非法经营|信用诈骗|操纵股价|虚假广告|假冒专利|非法拆借|内幕交易|泄露内幕消息|骗取出口退税|虚假信息|伪劣产品|合同诈骗|贷款诈骗|虚假陈述|违规担保|向大股东违规提供借款|内部治理违规|信息披露违规|信息披露不准确|重大信息遗漏|内部治理违规|未及时披露重大事项|信息披露存在误导|非法套汇|高管未履行职责|违规炒股|虚假记载主营收入|虚假记载利润|欺诈发行股票|操纵证券市场|操纵证券价格|集资诈骗|非法销售|股票诈骗|风险控制指标违规|大股东占用上市公司资金|误导性陈述|破产|遭起诉|资金断裂|遭调查|巨亏|利润暴跌|利润巨降|退市|非法获利|业绩骤降|立案稽查|违约|伪造|资金链断裂|侵占国资|商业诈骗|信披漏洞|信披缺失|公司造假|欺诈上市|骗补门|被约谈|涉嫌虚增利润|信贷危机|事故|大股东内斗|涉牟私利|资产冻结|破产清算|老鼠仓|暂停执业|暂停营业|吊销执照|退市|乌龙指|处罚禁入|纪律处分|开除党籍|权色交易|权钱交易|内斗|资产遭封|不正当竞争|重大安全事故|行政处罚|恶斗|信任危机|销售欺诈|重组失败|退市边缘|造假门|经济诈骗|股权纠纷|环保违规|恶性竞争|黑幕|窃取商业机密|情报战|恶性骂战|口水战|被出具警示函|遭警示|内讧|争权|吞补偿款|被监视|遭点名|财报虚假记载|数据造假|公款旅游|套利|遭逼宫|未批先建|面临易主|短线交易违规|遭问询|坏账风波|黑名单|遭集体索赔|宫斗|非法理财|业绩恶化|财务危机|财务管理危机|浑水做空|罢工|霸王条款|兑付危机|财务迷局|美化业绩|遭巨额索赔|涉嫌违法经营|掺假|交易系统漏洞|单方变更合同|案中案|内幕信息泄露|审查遭中止|财报造假|夺权战|劣迹斑斑|高管密集离职|信用证逾期|风险提示缺失|利润造假|退市危机|税务处罚|存款失踪|重组流产|拖欠工程款|净利恶化|非法吸收公众存款|遭通报批评|逼宫战|安全门|含糊公告|被曝光|遭冻结|遭重罚|败诉|要约收购失败|遭公开谴责|遭谴责|安全漏洞|遭警告|被移送司法机关|被暂停上市|吃罚单|被暂停债务融资业|内警告处分|遭处分|被处分|决策程序违规|偷工减料|被罚|被带走|资本黑洞|违规挪用|操纵利润|业绩注水|财务舞弊|股东违规举牌|合同纠纷|名誉侵权|重组被否|涉嫌侵权|隐藏利润|不履行承诺|恶斗不休|诉讼战|间谍门|行贿门|资金诈骗|信息披露不作为|污染门|屡遭投诉|借贷纠纷|涉嫌虚增业绩|信披非诚|假冒伪劣产品|涉嫌虚高偿债能力|信披真假难辨|违法领取报酬|兼职违法|违法兼职|欠款未付清|迫近退市|同城暗战|以身试法|违规兼职|裁员风波|会计违规|恶意造假|腐败窝案|信披瞒报|亏损黑洞|取消投标资格|被指不务正业|债务扯皮|定增遭否决|隐瞒真实情况|汇票丢失告上法庭|担保黑洞|恶意侵权|舞弊收买|套取职工持股|管理存漏洞|股权司法冻结|经营持续恶化|借势减持惹质疑|缺乏法律保障|股东出逃|盲目扩张|高管涉案|天价罚单|自毁再融资|民事诉讼|非法交易|浮华业绩|暗中操盘|亏损巨大|高管出逃|泄露客户信息|季报存疑|侵权|提案遭抵制|违反规定|触红线|遭调查|募投疑云|不合法|遭反对|财务黑洞|资金蒸发|拆借黑洞|违规拆借|遭抵制|数据乌龙|财务疑云|财报作废|财务数据搬家|混改失败|被查|接受组织调查|高层动荡|被抓|违规批贷|主业濒临死亡|生存危机|遭群众举报|资金链告急|实质违约|本金违约|刚性兑付|官司门|被重组|IPO受挫|募投迷雾|收入无从印证|资金来源成迷|欺诈|配合调查|遭上交所问询|遭深交所问询|遭证监会问询|遭监管部门问询|被警示|遭公检法调查|资质被停|信披瑕疵|项目手续不全|遭做空机构狙杀|兑付违约|亏损王|签字伪造|与事实不符|遭证监会点名|并购迷局|存货暴增|使用假汇票|被指做局|涉贿|涉嫌行贿|举牌战|隐瞒交易|重组如儿戏|窃取|中止审查|债务黑洞|调出两融标的|官司缠身|经营恶化|被销毁|吃官司|拒不履约|违约事件|资金被冻结|截留货款|被提起仲裁|状告|高管震荡期|股东闹翻|股东起争执|存重大风险|坏账|损害投资人利益|股价雪崩|退约风险|摊上大事了|虚列费用|失败收购|疑点重重|商业间谍|业绩持续恶化|员工被欠薪|终身市场禁入|主业风险大|遭业界质疑|人为虚增|失信被执行人|接盘方爽约|欠缺商业道德|重组遭否|股权激励议案被否|质询|市场操纵|操纵市场|连环诉讼|黑幕交易|前科|司法冻结|提前终止重组|乌龙公告|故意违规|募资失踪|管理漏洞|招标内幕|披露存瑕疵|定增梦碎|股权争夺战|拒绝兑付|玩弄定增|保壳堪危|股东交恶|被内部处理|销售迷局|巨亏黑洞|扩张失速|管理藏隐患|资金链疑云|巨亏泥潭|定增困局|涉嫌越权|业务存水分|重组夭折|保壳无望|超警戒线|忽悠投资者|提前泄露|举牌易行权难|债务乱局|存款丢失|冒险定增|账目造假|成败存疑|重组搁浅|虚增存货|疑点频现|敲响警钟|业绩蒙阴|逾期贷款陡增|负面缠身|受处分|提货危机|未能守约|被诉|负面舆情|股债双杀|负债率高企|蹊跷交易|惹官司|现金流不足|盈利恶化|大股东失诺|粉饰报表|信披不充分|国资流失|虚构交易|虚假存单|借款纠纷|高新资质存疑|洗钱|募投之殇|同业竞争|圈钱谜局|招股书大缩水|成长性受质疑|投资款蒸发|缺乏核心技术|议案遭否|假担保真圈钱|坏账风险|回收风险|应收账款激增|不良贷款高企|信披遭质疑|收购争议|财务风险|挑战监管|环境污染|骗巨额担|遭投资者质疑|涉嫌逃税|发生安全事故|废水超标|违法排污|在逃|污染环境|曝安全问题|遭整顿|涉污染|涉污案|独立性存疑|非法|查封|索赔案|贿赂|未及时披露|违规行为|重罚|违规决策|公款吃喝|公款抽雪茄|敛财|顶风作案|公款大吃大喝|绕开监管|自曝家丑|债券违约|新闻腐败|违约债券|腐败案|监管漏洞|遭约谈|公款高消费|检举|揭发|非法生产|严重违纪|蒙混过会|涉国资流失|涉嫌围标|管控危机|摘牌风险|恶意退市|雇佣童工|涉嫌玩忽职守|被免职|非法转移|索贿|被逮捕|遭市场禁入|对簿公堂|被举牌|违反契约|深陷反腐漩涡|虚报债务|合同欺诈|失联风波|监管处罚|信披不及时|不良资产爆发|停产整顿|大股东爆仓|大股东遭平仓|强制平仓|遭实名举报|稽查|违规减持|被双开|遭遇强平|遭监管通报|虚报利润|内控重大缺陷|虚构应收账款|重大会计错误|点名处罚|信息提前泄露|顶格处罚|责令停产|抽逃资金|窗口期提前买入股票|信披失误|退市风险警示|信披滞后|信披意识缺失|借壳方造假案|融债违约|被警方控制|被立案调查|违法生产|股权遭冻结|隐瞒重大诉讼|假仲裁|触犯环保法|遭污染|洗钱案|拖欠增值税|污染案|对薄公堂|对赌失败|收购案遭否|质押股爆仓|账本失踪|被诉讼|信披违规|遭证监会立案|未合法披露|员工涉嫌泄密|涉信披违规|涉嫌虚增营收|公开谴责处分|严重超标|被监管方问询|涉嫌违规任职|关联交易存疑|遭深交所处分|失联黑名单|环保“黑榜”|董事长失联|遭深交所公开谴责|高管集体泄密|业绩预告被指违规|诉讼未披|涉嫌渎职|违规占用资金|操纵招标|有期徒刑|构成犯罪|犯有|审判|违建|恶性事件取保候审|串供|翻案|诬告|偷税漏税|知法犯法|收受贿赂|坐牢|缉拿|收押|作案|贪污|判刑受审|落网|犯罪活动|犯罪|执行逮捕|抢劫|行政诉讼|偷逃税款|涉赌|甲醛超标|不法行为|镉超标|判处死刑|批捕|犯法|提出诉讼|有法不依|监视居住|留党察看|二氧化硫超标|候审|徇私枉法|行贿|拘留|遭证监会|起诉|服刑|判处|犯案|贪污受贿|定罪|依法逮捕|违法犯罪|缓刑|自首|案发|锒铛入狱|令计划案|抓捕|归案|刑拘|通缉|骗税|判罚|行贿受贿|定案|索贿受贿|判赔|刑侦|作奸犯科|上诉|上访|押解|违法违纪|批准逮捕|拘捕|抓获归案|偷漏税|报案|贪污腐败|贪腐案|逮捕|诉讼|违法|受贿获刑|陷诉讼门|涉嫌违法|立案调查投资者|诉诸法律|涉嫌输送|侵权案|被证监会立案|企业受罚|涉违法|涉嫌渎职犯罪|违反证券法律法规|遭证监会处罚|涉嫌利益输送|洗钱罪|涉嫌受贿案|披违法|被起诉|被深交所问询|披露不规范|信披重大遗漏|公司涉嫌|行贿罪|被双规|违反证券法|管理与控制违规|受贿案|被环保责令整改|涉嫌无照经营|遭证监会立案调查|涉资金池违规遭罚|诉讼案|涉隐秘利益输送|遭证监会调查|涉土地违规|违约门|遭商务部立案调查|处罚环境违法企业|被控受贿|涉嫌单位行贿罪|违反八项规定|违反反洗钱规定|被司法强制划转|涉嫌股价操纵|信披违法|被环保部门查处|涉欺诈发行|遭立案|重组报告书造假|遭商务部立案|立案调查股|涉嫌国有资产流失|卷入造假案|涉嫌内幕交易|立案调查函|监管层处罚|面临一系列诉讼|存在粉饰业绩之嫌|重组信批违规|被控行贿受贿|集体失踪|被查封|巨额索赔|涉嫌虚假宣传|被证监会警示|踩《证券法》红线|违规占资|收到证监会关注函|涉官员受贿案|立案处罚|遭保监局处罚|遭证监局出具|骗补名单|遭证监局监管关注|收到监管局警示函|被公诉|违规经营|面临股民诉讼|遭监管严查|遭证监局处罚|调查通知书|强制摘牌|被强制摘牌|警示处罚|涉嫌不当关联交易|遭食药监局|被证监局责令整改|遭食药监局通报|机构许可违规|发案率高|虚假材料|涉案金额大|受监管警示|卷入安全事故|违反相关卫生|接罚单|被采取责令改正措施|最大罚单落定|被债权人申请破产|不服监管斗胆上诉|纠纷升级|被监管盯上|引发深交所关注|收证监局警示函|侵权现象|被判败诉|遭证监会行政处罚|证监局处罚|曝违法违规|被其勒索|侵犯专利|采取行政监管措施|多处造假|遭监管双重处罚|虚假银行汇票业务|操纵市场案|被指多处造假|虚假宣传|获刑|禁锢|罢免|毒死|举报|经济问题|受贿|违规|通奸|立案调查|恶意做空|恶意做多|组织审查|政治攀附|隐藏性腐败|嫌受贿罪|伪造公文印章|违规买卖股票|贪官|塌方式腐败|送上法庭|双重狩猎|双规|人情执法|权力寻租|培养自己的势力|没躲得过狩猎|立案侦查|决不姑息|监管俘获|监督责任缺失|毫不讳言地拿股权|行政开除处分|腐败朋友圈|非法行为|倒卖名单|大老虎|打虎拍蝇|部门小鬼|不法利益|被开除党籍和公职|被开除党籍公职|窃国者侯|调查|不正当关系|情妇|非婚生子|配合调查被警察带走|涉嫌严重违纪|利用职务便利收受贿赂|移送公安|移送司法|利用非法手段|接受组织审查|处分|外逃|违规出国|幕后操纵|监管不作为|监管失职|限制出境|违法乱政|金融大虎|违规出境|被开除公职|被开除党籍|发审腐败|做假账|设局欺骗投资者|投诉举报|盗买账户|萝卜章|被警察带走|实名举报|免去其职务|IPO带病|带病闯关|白粉高利'
no = '不大|不丁点儿|不甚|不怎么|聊|没怎么|不可以|怎么不|几乎不|从来不|从不|不用|不曾|不该|不必|不会|不好|不能|很少|极少|没有|不是|难以|放下|扼杀|终止|停止|放弃|反对|缺乏|缺少|不|甭|勿|别|未|反|没|否|木有|非|无|请勿|无须|并非|毫无|决不|休想|永不|不要|未尝|未曾|毋|莫|从未|从未有过|尚未|一无|并未|尚无|从没|绝非|远非|切莫|绝不|毫不|禁止|忌|拒绝|杜绝|弗'

ad_keywords = "创始人|董事|经理|董事长|高管|实控人|股东.{0,10}(矛盾|处罚|分歧|反对|利益|违规|转手|被否|变换|举报|变更|通报|\
争执|放弃|控制|转让|冻结|退休|掏空|入主|当|短线|交易|陷|违约|提名|罢免|举报|大战|变动|免去|风险|\
减持|侵占|辞|出逃|回购|晃点|生变|打|实控人)|\
(出席|起诉|辞任|清退|违规|指责|收购|打架).*股东|\
内控风险|独董|监事|董事会|控股股东|实际控制人|党委书记|总监|采购员|职工\
|科长|行长|高层|经纪人|组长|镇长|局长|市长|员工|掌门|副总|主管|总裁|一致行动人|责任人|职员|执董|主席|管理人|秘书|\
法定代表人|当事人|业务员|法人|技术员|董秘|总助|代理人|所长|负责人|操作员|掌舵者|中层|管理层|总工|财务顾问|财务官|审计机构\
|股权之争|股权争夺|股权结构|股权转让|(出让|受让|甩卖).{0,30}股权|股东大战|私有化|控制权|收购|举牌者|实控权|要约收购|\
入主|增持|出售|减持|易主|控股权|内斗|并购|私有化|股权易手|关联方|裁员|欠薪|辞职|裁撤|跳槽|拖欠|裁人\
|人员编制|解约|精减|管理人员|减员|辞退"
not_ad_keywords = '透露|出售信息|(年报|季报).*营收|本管理人|完成出售|披露.{0,10}责任人|上市公司并购重组|国家高层|\
出售资产|接到.{0,10}控股股东|收购.*股权.*一致|本公司.*董事.*保证信息.*|造假.*规定|信用社|担任.{0,15}组长'#|转让.{0,10}控股股东'
ad1_keywords = '履职|失误|免.*职|失联|内控|纷争|留置|转让|失联|掏空|罢免|犯.*罪|诈骗|处分|套现'
ad2_keywords = '调查|涉嫌|落马|违规|获刑|受贿|判刑|带走|被查|行贿|查封|贿送|泄密|监视|侵占|违纪|违法|谴责|被判|\
涉诈|贪污|索贿|缓刑|有期徒刑'
not_ad2_keywords = '翔实调查|不得违规|标的调查'
ad3_keywords = '掌舵者|离职|辞别|辞任|辞呈|免职|履新|降级|辞职|解聘|调整|退任|辞去.*职务|易|换帅|加盟|解职|变更|变动'
not_ad3_keywords = '交易日|人才加盟|方案.{0,15}调整|交易|价.{0,10}调整|离职员工|员工离职|不会.{0,20}变更'
ad4_keywords = '打架|遭殃|内讧|不一致|反对|未出席|放弃|否决|变脸|撤离|内斗|被否|闹剧|指责|失控|\
恩怨|情仇|冲突'
not_ad4_keywords = '发审委否决|被否.*月|精彩.*变脸|风险失控|业绩.{0,10}变脸|程序.{0,10}冲突|自愿放弃|放弃缴纳'
ad5_keywords = '裁员|欠薪|减员|拖欠'
not_ad5_keywords = '拖欠.{0,10}欠款'
print ('ad_keywords loading successful')


ass_keywords = '担保|抵押'
not_ass_keywords = '担保物|担保权益|担保导致|谎称.*担保'
ass1_keywords = '违约|风险|披露|逾期|乱象|终止|被罚|蒸发|纠纷|借款|违规|反对|官司|罚单|监管|冻结|寒冬|欠款|担保.{0,15}额.{0,15}超|\
弃权|造假|涉嫌|伪造|拖欠|追回|危机|疑云|陷|大坑|出事|整顿|堪忧|存疑|索债|自救|关注|催债'
ass2_keywords = '(追加|提供|增加|对外|融资|作|做|责任|关联|贷款|互相|反|连带|保证)担保|担保(额度|总额|公告|事项)'
print ('assure_keywords loading successful')

credit_keywords = '承诺|信用|诚信|失信|未达预期|业绩补偿未支付|未能支付业绩补偿|业绩大幅低|失约|诈骗\
|无法实现|打脸|忽悠|难兑现|逾期|变脸|爽约|信披|违诺|老赖|信任|履约|瞒天过海|质疑|失联|信任危机|信用|隐瞒|黑名单|\
消失|不翼而飞|挪用|资金占用|占用资金|用募资|资金去向不明|资金.{0,10}变更|占资|资金.{0,15}存疑|钱荒|挪为他用\
|资金.{0,15}用途|拆解资金|偿还|去向不明|募资用途|变更.*用途|募资理财|动用|运用.{0,15}资金|虚假信息|募资闲置|降级\
|连降|等级|涉嫌|吹牛|违法|虚假|造假|虚增|虚构|误导|卖假|诈骗|非法经营|骗补|忽悠|谎言|危机|操纵|侵害|打假|真假|欺诈\
|伪造|骗局|舞弊|腾挪|伪造|隐瞒|欺骗|逃避|举债|挪作他用|巨亏|债务|退市|警示|债务|受累|避税|更改.{0,15}用途\
|欠债|执行.{0,15}名单|追讨|持续经营|冒用|不良记录|异常|代偿|假冒|破产|违约|清偿|冻结|烂账|逃往|还款|展期|偿债\
|延长|追债|偿付'
not_credit_keywords = '(不存在|没有)虚假.*误导.*陈述|信用鉴证|度假|违约事件频发|收效未达预期|违法所得|警示市场|内部通报|认为.*信用等级|\
退还款|信用评级|参与质押式回购|不存在虚假.*误导|无需承担违约责任|公司承诺|现金支付|募集.*延长|有无造假|不会.*(警示|退市)|并.*承诺|\
异常波动|支付.*现金对价|业绩.*承诺|增强.*持续经营|股东承诺|支付.*现金.*方式|下调管理费|承诺.*净利润.*不低|支付方式|报酬.*计提|\
信用.*业务|异常波动|业绩承诺|承诺函|造假.*规定|违约金|私有化退市|媒体通报|通报会|准备.{0,10}偿付|保护区.*违法|违法开垦|不能挪用'
cre1_keywords = '承诺|失信|未达预期|诚信|违诺|不达标|老赖|是否具备.*履约能力|发布承诺.*增持'
not_cre1_keywords = '中诚信托|失信.{0,10}制度|接受诚信|诚信信息|诚信建设|失信.{0,10}名单'
cre2_keywords = '挪用|占用|使用.*(资金|募资)资金.*使用|(变更|改变).*用途|占资|拆借|侵占|腾挪|去向不明|动用|挪为他用'
not_cre2_keywords = '变更集中|动用账号|车道占用|通道占用|侵占.{0,15}自然|侵占破坏|侵占保护区|侵占区域|侵占林地|占用实验区|\
占用林地'
cre3_keywords = '评级|下调|降级|信用等级'
not_cre3_keywords = '下调换股价|政务降级|降级处分'
cre4_keywords = '抄袭|误导|故事|虚假|欺诈|制假|售假|造假|忽悠|虚增|卖假|诈骗|假章|假账|骗补|诈骗|伪造|涉嫌|虚构|舞弊|\
欺骗|失实|失真'
not_cre4_keywords = '虚假整改|反欺诈|反诈骗'
cre5_keywords = '黑名单|黑榜|欠薪|贷款|违建|欠债'
not_cre5_keywords = '小额贷款'
cre6_keywords = '债务|违约|水漂|逾期|冻结|深陷|抵债|清偿|偿还'
not_cre6_keywords = '冻结账号|逾期不整改'
print ('credit_keywords loading successful')

fin_keywords = '流动性|亏|现金流|利润|财务|债务|资产|净利|自融|融资|收入|同期下滑\
|坏账|负债|营收|关联交易|财报|资不抵债|老赖|冻结|费用猛增|业绩|审计|造假|账务|存账|销售额\
|会计|无法表示意见|否定意见|损失|盈利|由盈转亏|套现|款项|账款|收益|计提|败家|年报|杠杆\
|现金|回购|中报|季报|同比|盈利|投资.{0,15}(占比.*超|失败|赔)|募资|财报|利息|毛利|年度报告\
|会所|非标|快报|事务所|下调|外强中干|虚增|造假|变脸|调节|操纵|利益输送|涉嫌|迷雾|伪造|粉饰|刷假\
|假利|存疑|无法披露|注水|假账|两套账本|失信|不一致|夸张|财务之谜|质询|账实不符|嫌疑|更正|离奇|疑云\
|真实|谎称|略逊|净利润减少|净利减少|资产负债|托管经营|偿债|欠债|抵押|注资|流动性\
|现金流|借款|违约|无法支付|欠款|债务危机|拖累|无法.*保证.*真实|业绩下滑'
not_fin_keywords = '审计部|客观真实|若.{0,30}未能披露.{0,30}年度报告|固定收益证券|利息种类|真实性|内容真实|业绩漂亮|有无造假|\
资产重组|信息披露.*真实|唯一真实|数据.*下调|真实信息|统计年报|收入增长|偿债获股|青年报|新快报'
not_fin_keywords1 = '增长|审计部|同增|增加|盈利|提升|大增|升|增长|提高|添加'
not_fin_keywords2 = '减少|下滑|下降|亏损'
fin1_keywords = '账实不符|造假|虚增|真实性|虚假|谎称|存疑|欺骗|质疑|虚夸|子虚乌有|异常|隐瞒|欺诈|垫资|疑点|疑云|存疑|假账|\
不同.*数据|数据.*不|伪造'
fin2_keywords = '亏损|少赚|下滑|亏了|净亏|下降|下跌|巨亏|减少'
fin3_keywords = '审计机构|业绩修正|无保留意见|审计报告|会计师事务所|会计事务所|无法保证|审计意见|非标|会计师|拒绝审计|\
无法表示意见|修正|出具保留意见|会所|会计所'
fin4_keywords = '资不抵债|负债|债务危机|债务'
fin5_keywords = '资金(紧张|不足|风险|吃紧|危机)|来源不明|现金流.*(锐减|负|承压|风险)|(没有|创造|吞噬).*现金流|\
维系.*资金链|资金链.*(断裂|紧|问题|危机)|筹钱|融资徐明|还不上钱|流动性.*危机|欠款|付不起\
'
print ('finance_keywords loading successful')

manage_keywords = '到期未付|坏账|收回.{0,10}风险|款.{0,20}收回|追收|坏账|负债|依赖.{0,10}补助|补助.{0,10}(难解|保壳)|借款|\
欠款|追回|回收|计提|收回|偿还|债务.{0,20}(缠身|纠纷|危机|逾期)|归还|巨额资金.{1,10}陷|贷款逾期|财产.{1,10}查封|回款.{1,10}慢|\
还钱|还款|拆借|资金.{0,10}(压力|困难|紧张|占用|告急|危机|深陷|问题|链困境|链危机|回笼|危局)|拖欠|金.{0,20}退回|欠.{0,20}(万|元)|\
讨.*质押金|追债|不良率|发不起工资|(债务|兑付)危机|押.{0,20}股权|现金流.{0,20}(吃紧|紧张)|背.{0,20}债|欠.{0,20}债|\
营销费用|欠.{0,20}(薪|费|亿|未还|钱|资)|资金链(问题|危机|吃紧|临危|断裂|告急|状况|紧张)|合同诈骗|强制平仓|\
股权质押违约|巨亏|回收.{0,20}(难度|堪忧)|业绩.{0,20}未达标|拖款|负债率超|宣告破产|没钱|解冻资产|经营管理|划转.{0,10}资金\
(账户|资金|持股|股份|资产|股票|账号|银行|股权|存款|股|公司|资产).{0,20}冻结|(公司|冻结|司法|连累).{0,20}(崩溃|存款|查封)|\
强行划扣|冻结|伪造.{0,20}款|逾期.{0,20}(债务|本息|资金)|私下融资|阴阳贷|缺钱|偿债能力|拍卖|(财产|资产).{0,20}查封|账户.{0,20}保全|\
资产.{0,20}抵押|票据诈骗|股份.{0,20}划转|IPO.{0,30}(摘牌|搁浅|撤退|撤回|被否|终止|撤单|过会率|冲击)|发行终止|\
(终止|忽悠式|问|搅黄|遭罚|不会|抬价|放弃|撤回|中止|暂缓).{0,20}(定增|A股|募资|公开|审核|项目|审查|挂牌|上市|合并|\
IPO|重大|转让|并购|发行|重组|收购|认购|筹划|辅导)|(冻结|连累).{0,20}公司|\
收购.{0,20}(失败|终止|内讧|闹剧|爆雷|终止|告吹|资金来源|被否|疑云|变数)|\
并购.{0,20}(受挫|问题)|购买资产|受让.{0,10}股权|\
重组.{0,20}(告吹|夭折|落空|质疑|自救|终止|未果|失败|风险|告败|迷雾|通过率|屡战屡败|变更)|\
股权之争|出售股权|溢价收购|业绩.{0,20}爽约|支付.{0,20}转让|关联交易折戟|借壳.{0,20}(搁浅|延期)|募资.{0,20}不给钱|上市.{0,20}破灭|\
取消.{0,20}(发行|配股)|定增.*(失效|告吹|失败|缩水)|延长.{0,20}增发|(配额|融资).*被否|违规.{0,15}挪用|\
原材料.{0,10}(价|经营)|一季度.*景气度|推进.*未达预期|影响.{0,30}业务|业务.{0,30}(变更|少)|禁售|制裁|主业退出|转型|政策风险|\
产品关税|销售.{0,20}终止|暂时停产|跨界|扩张乏力|主业.{0,20}天花板|布局.{0,20}产业|行业.*变局|调.{0,30}价|暂停生产|工作.*延迟|开发.{0,20}产品|\
生产.{0,20}关闭|收.{0,20}税|成本.*(加剧|上升)|停产|税.{0,20}政策|供不应求|限产|生产经营.*(变化|压力)|外部环境.*(困境|影响)|暂停批设|\
停售|终止.{0,20}(合作|设立)|需求.{0,20}(软|低迷)|扇贝.{0,20}死亡|环境异常|生产.{0,10}停滞|贸易争端|经营活动.{0,10}变化|面临.{0,10}风险|复工复产|\
出事|损失|事故|中毒|安全(隐患|生产)|火灾|爆炸|灾害|塌方|倒塌|坍塌|\
索赔|上诉|判罚|产权案件|纠纷|清还方案|诉讼|维权|控诉|起诉|变卖|侵权|清盘呈请|被判|诉.{0,10}专利|赔偿|被告|起诉|仲裁|资产.*划走|\
发放.*清算款|起诉|败诉|判决|被诉|法院(传票|回|维持)|反诉|\
投资损失|亏损|市值(萧瑟|狂泻)|灰飞烟灭|未获回报|专户浮亏|愿赌.{0,20}服输|浮亏|基金.{0,20}影响|深套|微乎其微|拖累.{0,20}信托|理亏|\
(跌停|亿).{0,20}蒸发|蒸发.{0,20}亿|资金失踪|(业绩|信托)惨亏|跌停|出逃|踩雷|血亏|投资难收|巨亏|亏.{0,20}亿|惨套|业务败局|被套|投资腰斩|\
炒股亏|身陷.{0,20}违约|信托.{0,20}亏|损失.{0,20}元|套牢|跌破.{0,20}平仓线|亏.{0,20}亿|拖累|\
(利润|营收|业绩|收入|毛利率|价|营业额|产品|用户量|份额|出货量|业务|销量|净利|销售|营收|增速|营收).{0,30}\
(锐减|大挫|减少|下滑|低迷|锐减|跌|放缓|淡季|萎靡|腰斩|下行)|\
关闭.{0,20}馆|拉低.{0,20}业绩|闭.{0,20}店|滞销|挤压下滑|营收为零|利润.{0,20}暴跌|房地产.{0,20}同比减少|业务.{0,20}承压|\
应收账款|欠款|贷款|借款|拖欠.*款|欠债不还|\
转让|(卖|出售|出让|转让|甩卖|剥离|收购|置出|出清|抛|售卖|甩手|开售).{0,30}(资源|企|价格|物业|债权|公司|股|项目|资产|业务|所持)|\
(资产|公司|股权|PE|设备|股份|业务).{0,30}(剥离|变卖|转让|租赁|甩卖|出售|卖出|置出|收购)|蛇吞象|卖壳|\
破产|减资|合并|解散.{0,10}公司|翻盘|重整|退市|清盘|倒闭|清算|收缩.*业务|注销.{0,15}公司|公司.{0,15}注销|企业.*解散|\
(迷恋|投资).{0,20}副业|民间(借贷|集资)|主业|扩张|扩产|\
环保|环评|排污|污染|油耗.{0,20}未达标|(终止|客户).{0,30}合作|环境.*(违法|问题)|合作.{0,30}(终止|低)|破坏.{0,20}环境|不续约|不续签|停止.{0,20}供货|\
禁止.{0,20}产品|排污|废渣|营收为负|中美贸易(摩擦|战)|债务.{0,20}爆雷|采购.{0,20}预期|收购.{0,20}亏损|巨亏.*接盘|贸易风险|成本抬升|行业低迷|\
持续经营能力.*不确定|使用.*不合规|业绩不如预期|流动性问题|董事长跳楼|互撕|受贿|收益.{0,20}下滑|估值.{0,20}异常|怒怼|不尽职|\
转型不顺|合同纠纷'
not_man_keywords = '显示.{0,20}主营|增长.{0,20}转型|(特征|信息)损失|强化.*污染.*防控|IPO.{0,30}企业|反馈冻结|转让日.*暂停.*转让|\
基金转型|偿债能力较强|负债.*额下降|跨界合作|客户.*获取.*通过.*合作|爆炸式|贷款.{0,15}余额|污染.*方案|土地拍卖|私有化退市|抛光设备|\
转让.*细则.*公司|卖空指定.*名单|各项贷款.{0,15}元|不良贷款率|出售.*(建立|来源).*公司|迎来转型期|资金.{0,15}问题受到.{0,15}重视|\
基金.{0,20}影响力|调研.{0,30}价|竞价转让|对于布局|真的合并|合并报表|帮卖.*项目'

man1_keywords = '破产|重整|减资|收缩.{0,15}业务|重组|公司.{0,15}注销|注销.{0,15}公司|解散清算'
man2_keywords = '非法(排污|倾倒)|环评.*未.*通过|环保.{0,15}(违法|高压|问责|违规|问题|风险)|油耗未达标|\
终止.{0,15}(入|合作|合同)|(曝光|废气|企业).{0,15}污染|废水排放|合作.{0,15}终结|环境(违法|污染)|协议.{0,15}不续约|\
污染环境|收购.{0,15}终止|失.{0,15}联|纠纷.{0,15}赔|(违法|违规)排污'
man3_keywords = '(沉迷|迷恋).{0,15}副业|民间借贷|生产.{0,15}检修|责令停产|盲目扩张|传统.*业务.*承压|陷.{0,15}资金危机|\
布局多元化|转型|扩张.*盲目|主业.{0,15}下跌|陷.*扩张.*症|扩张.{0,15}(质疑|亏损|需.*理智)|布局.{0,15}产业|发展.{0,15}承压|\
民间集资|跨界|主业.{0,15}(变更|困局|遇考)'
print ('manage_keywords loading successful')

mar_keywords = '减持|转让|出售.{1,20}股|沽清|套现|抽血|受让|持有.*股份.{0,20}减少|持股.{0,30}减少|平仓|强平|清仓|质押|\
冻结|拍卖|爆仓|(收购|IPO).{0,15}终止|摘牌|戴帽|退市|暂停上市|终止上市|撤回IPO|清退|终止挂牌|喊停|除牌|清盘|终止审查|被.{0,10}ST|\
风险警示|风险提示|终止挂牌|关联交易|操纵|炒作|交易异常|新低|跳空低开|腰斩|新低|蒸发|破发|重挫|拖累|\
折半|新低|折价|狂砍|沽售|跑输大市|与大市同步|与大市同步|(降|下调).{0,10}评级|评级.{0,10}降|(价|股).{0,15}降至|(遭|评级).\
{0,15}下调|中性|调低|砍掉|沽空|重挫|踩雷|负面|消减|沽出|撤销|卖出|消减|被砍|下调.{0.15}预测|下调.{0,15}(至|预期|估值|价)|\
终止.{0,15}(计划|事项|挂牌|发行|辅导|上市)'
not_mar_keywords = '避免.*摘牌|增持|风险提示(：|:)|转让系统|指数.{0,15}新低|增速.*降至|未能.*披露.*(转让|终止)|\
数据.*降至|下调趋势|终止维护|公开转让说明书'
mar1_keywords = '转让|减持|清仓|沽清|套现|出售.*股|强平|清盘|受让.*股'
mar2_keywords = '质押|冻结|拍卖|爆仓'
mar3_keywords = '摘牌|终止挂牌|终止.{0,5}发行|除牌|暂停买卖|取消上市|风险警示|退市风险|终止上市|暂停转让|取消股票发行|临停|\
暂停上市|退市|风险提示'
mar4_keywords = '跌|新低|拖累股价|踩雷|闪崩|重挫|跳水|蒸发|崩盘|破发|异常波动|腰斩|卖出|下挫'
mar5_keywords = '下调|估值|估值调整|削目标价|削减|评级|做空|沽空|调低|预估'
print ('market_keywords loading successful')

pro_keywords = '投诉|曝光|不合格|黑榜|造假|召回|违规生产|缺陷|强索|陷入.{0,15}事件|隐患|产品质量|\
质量.{0,15}(不合格|不可靠|不过关|缺陷|关注)|抽检|不合规|生产.{0,15}不合格\
不靠谱|315|故障|(质量|机油|引擎|车型|召回|施工|卫生|车辆).{0,15}问题|问题不断|不达标|缺失|质检|侵犯|侵权'

not_pro_keywords = '生产厂商|(主营|从事).*生产|从事.*设计|符合设计|回应.*事件|管理.*缺失|曝光量|进行生产|申请.*生产|\
集产.*生产|生产厂家|设计.*方案|陷入.*窘境|技术不达标|曝光率|生产安全|产品的.{0,10}生产|陷入.{0,15}(思考|合同纠纷)|\
处境陷入'
pro1_keywords = '车.*召回|召回.*车|不良反应|安全性|曝光.{0,10}问题|不合格|上.{0,10}黑榜|造假|违规生产|\
召回.{0,10}(产品|笔|台|部分)|质量.{0,10}(不过关|缺陷|问题)|产品.{0,10}(陷|风险|质量)|安全隐患|掺假|查封'
pro2_keywords = '侵犯.{0,10}专利|侵权|专利战|专利涉及'
print ('product_keywords loading sucessful')

proj_keywords = '项目.{0,15}(烂尾|停产|时长超|时间超|停工|审批|未果|无法|暂停|起诉|终止|调整|延迟|延误|\
完成|计提|进展|暂缓|遥遥无期|青黄不接|陷|延期|停摆|撂荒|如意|进展|违反|缓慢)|\
(暂停|退出|终止|清出|放弃|暂缓|干扰|分离|阻扰|阻挠|投入).{0,15}项目|\
计划.{0,15}(搁浅|暂停)|延迟动工'
not_proj_keywords = '一个标杆项目|提升.*项目.*合作|关注.{0,10}项目|开工.*项目|根据项目进展|等项目|缺陷.{0,15}识别|故障巡检|\
'
proj1_keywords = '项目.{0,20}(延迟|延误|延期|停建|投资多年|暂停|停产|终止|难以启动|超|停工|未果|暂缓|停滞|停工|停售|停摆)|\
工程.{0,15}审批|(延期|停建|暂停|停产|退出|终止|放弃).{0,20}项目'
proj2_keywords = '项目.{0,20}(手续|审批)|资料不齐'
proj3_keywords = '项目收益未达预期|票房惨败|过于乐观|亏损.{0,20}延续|(无法达到|未|不及)预期|难盈利|项目.{0,20}亏损'
print ('project_keywords loading sucessful')

reg_keywords = '问询|质询|过会|审核|被否|驳回|IPO.{0,30}(过会|取消|撤单|变|不足|核查|否|通过率|审核|通关|中止|终止)|\
监管|叫停|注销|暂停.{0,15}审核|审核.{0,15}暂停|否决|未.{0,30}通过|挂牌|被停|\
核准|暂缓表决|整改|政策抑制|停发|搜查|抽查|检查|证监|上交所|深交所|中国证券监督管理委员会|股转|深圳证券交易所|\
中小板公司|保监局|公安机关|环保局|消保委|药监局|交易所|环境保护局|检察院|罚款|罚单|处罚|被罚|受罚|罚决|罚没|\
计罚|处分|遭罚|罚逾'
not_reg_keywords = '向.*(上交所|深交所|深圳证券交易所|上海证券交易所|证监).*(申请|提交)|(归属于|推荐).*挂牌|挂牌.*(板|公司)|\
交易所.*(上市规则|运作指引)|公司.{0,10}关注|股转系统|方案.{0,10}被否|整改.{0,10}问题|应深交所的要求|施工.*暂停|\
不按要求整改|回复深交所|敬请.{0,10}关注|交易所.*接受.*报表|IPO审核趋严|获.*证监会.*受理|避免.*审核|\
通过.*上交所.*交易系统|法院.*驳回|资质审核|证监会查证|生产.*流程|产品质量优势|未经审核|暂停键|上交所.*发行|\
登陆深交所|刑罚.{0,10}处罚|深交所.{0,10}获悉|深交所.{0,10}介绍|深圳证券交易所.{0,10}发行|公开挂牌|挂牌转让|\
经.*证监.*核准|交易所.*(发行|研究|弱点)|证监会批文|违反.*深圳证券交易所.*规定|支出.{0,15}通过审核|问题.{0,15}审核|\
以交易所通知|(跟踪|结算)审核|发现.{0,15}整改|处罚.{0,15}吸烟'
print ('regulate_keywords loading successful')

unf_keywords = '水|火|风|雨|电|雷|灾|事故|雪|天气|坍塌|死亡|地震|洪涝|燃|爆炸|遇难|埋|倒塌|昏迷|惊险|意外|\
矿震|闪爆|病毒|洗劫|抢劫|爆炸|瓦斯|落石|泄露'
not_unf_keywords = '山水|水泥|环保风暴'
print ('unforce_keywords loading successful')

oth_keywords = '关于.*培养.*考核.*通知|业绩.*增长.*增长|业绩预增'
print ('other_keywords loading successful')
app = Flask(__name__)
app.debug = True
app.config.update(RESTFUL_JSON=dict(ensure_ascii=False))
api = Api(app)

@app.route('/')
def hello_world():
    return 'hello world'

@app.route('/SVM_TextSort/', methods=['POST'])
def add_task():
    time_start=time.time()
    
    #url = request.form.get('siteDomain')
    #entitylist = request.form.get('entityList')
    #text = request.form.get('content')
    #title = request.form.get('title')
    
    url = request.json['siteDomain']    
    entitylist = request.json['entityList']
    text = request.json['content']
    title = request.json['title']
    
    
    content = title + text
    lable = ''
    #####不参与分类文章的关键词
    title_keywords = '企业参考价格|政策解读.*补贴.*方案|法律风险与防范|增持.*评级|促销|汇率.*表|图片新闻|\
    信用卡逾期|发起.*招标项目|食材.*名单|参考均价|意向登记|参考价格|报名|操盘必读|行情观点|上调业绩预期|超预期|\
    业绩预增|参考价格|推荐评级|优于大市评级|扭亏为盈|增持|发行与上市提示|预增|股推荐|遗失启事|新车抢鲜看|有趣的经济学|\
    停水预告|信用卡逾期|理财产品一览|公告速递|发行起始日|发行截止日|售.*元.*上市|人民币理财计划产品.*公告|一览表|\
    车.*售.*元|起付息|分类广告|分类信息|月薪.*元|问题.*解析|临时股东大会|广告|直播|补贴.*通知|公告精选|\
    现场检查全面启动|知识宣传|价格行情|业绩增长|复牌时间公告|业绩同比增长|车直降.*元|预告|利润预增|行情一览\
    汇率.*表|经营状态稳健|招标项目|宣传册|新资料一览|名单发布|价格信息|一览表|信访案件|演练|预防.*事故发生|执法监察|\
    表彰|培训|从你我做起|迁址|深交所投教|中标|稳步增长|利率.*公告|排名升至|调研报告|下调.*关税|圆满落幕|\
    Pre-A轮融资|上市公司列表|发行情况公告|上市.*公告|付息公告|盛大开班|保证金.*通知|到期日.*通知|行权日.*通知|\
    交易日.*通知|新股日历|人才集聚高地|审计报告|收费站.*启用|净利.*增|金洽会.*开幕|赴港IPO|入选.*福布斯|金条.*价格.*多少|\
    物联网.*举办|了解.*套路|创想会.*召开|.*涨停|楼.*在售|酒会.*开幕|报告.*企业市值|任.*长|权益分派实施公告|合作洽谈会|\
    选房细则|美元兑人民币汇率|关于.*培养.*考核.*通知|召开工作会议.*通知|研讨会的预通知|交易提示|限售总体情况一览|\
    报告解析|中国企业500强发布|排行榜|年度报告摘要|签署.*协议.*公告|债券.*挂牌.*公告|发行.*债|赚钱企业出炉|\
    营收超|500强排名|招股意向书摘要|保荐工作报告|赴美上市|增资协议.*公告|[互动]|人民币汇率中间价走势|债券.上市|\
    债券.*回售.*公告|转让服务.*(公告|通知)|会议决议公告|专项补贴|摩根士丹利.*看好|募集.*公告|分红公告|决议生效公告|\
    部署.*工作|融资券兑付(完成|公告)|网络问政|投资有望提速|国际软博会|督导意见|到期购回.*公告|药.*降价|担保.*实施公告|\
    现金管理.*公告|股权.*划转.*进展.*公告|日.*吸金.*亿|公告.*系列|民生.*新规|撤销.*名单.*公示|活期存款利率|法院.*打击.*拒执|\
    房企.*冲刺|财险.*出炉|取得.*核发.*公告|GSP认证公示|资产.*专项.*获批|检验.*结论.*有.*异议|募集资金|上市.*未敲定|\
    价格波动.*公告|采购.*公开.*招标公告|修订.*合同.*公告|变更.*基准.*公告|发售.*机构.*公告|赎回业务.*通知|\
    采购项目.*公示|IPO过会|博览会|债.*交易|利润.*低估|售.*穿山甲|失信.*对象公示|采购项目.*公告|\
    项目.*招标公告|招标公告|前世今生|风险提示.*公告|政策.*实施|交采暖费|拟.*上市|获.*贷款|亲情节|测评结果|IPO快报|\
    股价.*创.*新高|案件公布|挂牌出让公告|提示性公告|新增.*公告|高创会|职场报告|启动.*调查|上线.*平台|消费.*排|募.*资.*元|\
    异动统计|合作模式|房企流量|最新进展|印发|涨跌停板幅度.*调整|公告|采购通告|启动.*活动|债.*提速|开幕|寻求合作|参观访问|\
    宽带|榜单出炉|享受.*新政|公开投标|榜单公布|前景.*报告|证监会.*修.*规|火热上市|分析报告|研究报告|每股收益可增|\
    修改.*通知|评级.*资质|名单公布|评级行业|环评报告|评级资质|价格对比|销售额前.*名|下调.*利率|调查项目|网友.*留言|\
    关于.*批复|超.*倍PE发行|会.*开启|早评|发行.*CMBN|价格统计|派资本公积|最新调价|变更规则.*通知|高洽会|销量分析|\
    取得.*证书|征求.*通知|关于.*通知|享.*优惠|峰会|募集.*元|下调.*元|下降.*元|中性评级|董事会.*评述|今日.*最新.*价|\
    每周债评|评级.*上升|门票价|晨会纪要|升.*价|评级.*无|销量.*增|销量.*超|无新股发行.*上市|复牌时间|慈善|名单|\
    案例|油价.*涨|上市.*规则|一览|文化节|离婚|表彰大会|成功举办|获.*融资|停电|生效.*区别|高利贷|影讯|中超|\
    记录.*研究|首先.*要做到|缴费标准|新四板挂牌.*融资|专访|外资买卖免费分享|获注册|降杠杆|土地流拍|病毒营销|还款时间.*梳理|\
    趋势预测|规范.*通过|好评|政经谭|邀您参加|专采项目|球童招募|成功上线|网络安全|车展|成语故事|语文|股权布局|佳泽问候|\
    债.*发行|价调整消息|国务院.{0,10}关税|专题研究|定期支付表|晒榜|酒驾|品牌日|大市分析|加征关税|创业担保|战略投资|纪念币|\
    招.*岗|校园招聘|招聘.*汇总|法律依据汇总|报告.*研究|一体化赔偿|配置解读|退.*赛|跳崖|土地.*流拍|之旅|优惠专场|优惠券|\
    坚果.*新闻|炒货.*新闻|采购清单|《.*》|会员福利|秘籍|实盘.*记录|实盘.*分析|八卦|娱乐圈|品牌.*强|房企.*强|蝉联.*强|\
    小三房|(购|买).*二手车|餐厅.*账单|资产管理计划|地块项目|新增.*股|贫困户|道士|监管加码|官赖|酒吧|征求意见|荣膺|\
    通知.*整治.*乱象|喜登|盛况空前|招乘|香港上市(优势|条件|流程|费用|模式|方案|案例)|房屋征收|新增.*IPO.*申请|发行提示|\
    发行.*融资券|助力.*业务|基金净值|禁止新建|指引防洗钱|创业大赛|保持.*平稳过渡|TOP.*榜单发布|路.*问题.*回复|\
    位列.*首位|环境.*督查.*调度表|财务咨询.*靠谱|特佳.*榜|更名.*批复|任职.*批复|售.*理财产品|助残卡|治污方案|组合贷款担保|\
    净值更新|假期.*安排|政策.*问题.*解答|收入.*模式.*详解|申请IPO|同比增长|上市公司.*强|商务部.*倾销|整治.*乱象|融资担保基金|\
    银行业面临.*压力|财务审核要点|公司.*股权转让.*问题|案例分析|策略.*全解析|月.*新规|推.*支付方式|办理.*号码业务|停水通知|\
    项目获预售证|计息新规|视频监控.*覆盖|开发商推盘|趋于行业领先水平|物联网.*兴起|讲物联网|了解.*光储|质押.*解析|增资潮|\
    过会.*登陆.*股|大气治理方案|得.*奖|强制退市.{0,10}制度|推荐给您|车辆款型.*贷款购车.*车辆颜色.*车辆排量|上市公司董事长大起底|\
    发挥担保.{0,20}作用|增长转型|推.*支付方式|企业.*强|结算方式.*调整|国标.*获批|网购.*额.*亿.*交易份额|新能源政策|货车通检|\
    使用.*注意事项|银行监管指标压力|电影票房|民企杠杆|环保令.*关停|信托计划|修改.*法规.*决定|月.*日.*报价|宣传片.*出品|\
    资产评估说明|大气.*方案发布|(季|年)报预喜|业绩.*翻番|门票购买攻略|门票.*购票|演出安排|演唱会|公路工程|年.*月.*投资策略|\
    公开招标|分期提前还款|采购项目|社科院报告|预计.*经济增长|手机.*占.*份额|增速放缓|看待未来一年|法律误区|签署.*共享协议|\
    法律风险有哪些|风险治理框架|公安部.*限制.*购票|关于.*框架结构|对.*模块.*分析|关于.*物联网|出口化肥|土地成交明细|\
    租房找房|二手买卖|生活信息|企业.*成为.*重要力量|新增.*独角兽|胡润.*百富榜|金融风险防范|走红华尔街|募资额超|助小微|\
    企业.*发展纪实|赢得好口碑|涨.*元.*涨价|上调.*待遇|关于.*承诺函|发行股份.*核查意见|IPO.*热情渐退|农机抢收|个省.*建设.*完成|\
    方案.*披露对照表|投教下午茶|可行性报告|考.*知识点|发.*可换股债|种业务模式|高院新规|逾期.*赖账.*后果|欠钱.*财产.*不.*起诉|\
    借款人.*支付.*利息.*银行.*复利|最高院|最高法院|银行.*首推.*支付|审计.*重点.*关注.*事项|工程项目审计结果|月.*日.*采购价格|\
    电影.*市场.*格局|平台上线|月.*日.*价格政策|持续督导现场检查报告|基建信托|月.*日.*价格播报|月.*日.*现货价格|重登.*首富|\
    标准.*由.*编制|地方.*债.*方案.*制定|荣耀.*揭榜|配股提示|激励计划.*摘要|获.*正式.*牌照|系列资管|收购价格.*上涨|抽检.*全部\
    .*合格|上调.*业绩|地方.*债.*制定|打响.*地方债|群猜谜|环境信息.*披露.*质量.*提升|债.*成立.*募.*规模|产品推介|\
    经济.*效益.*增长|套取.*公积金.*纳.*征信|企业.*免征.*税|救市|发展趋势预测报告|创业创新项目揭晓|扶持.*优秀.*项目|\
    两部委.*明确.*房产税|财政部.*去产能|推进去产能|税收优惠政策'
    #not_title_keywords = '拉.*涨停'
    con_keywords = '评级.*买入|买入.*评级|评级.*增持|增持.*评级|债券.*在本所挂牌|代码.*简称.*实施日期.*增发价|公告速递\
    |董秘需知|监察.*重点工作安排|促销活动|迁址|产品名称.*发行机构.*发行时间|深交所投教|专项计划.*发行规模|房企.*进驻|\
    (予|维持).*(推荐|买入|增持)|递交招股书|持有评级|互动平台上询问|公司.*业绩.*产生积极|博览会.*举办|推荐.*评级|\
    重申.*买入|开幕|发布.*公告|农村金融时报|网民留言|公告基本信息|深圳证券交易所.{0,10}年.*月.*日|片详情介绍|致力.*公开课|\
    病毒营销|安全宣传|酒驾|大市分析|优于大市.*评级|招聘汇总|法律依据汇总|免费获取资源|看看电影|行程特色|享.{0,10}充值优惠|\
    导演.*编剧.*主演|资讯一手掌握|当日成交明细|当日成交汇总|当日成交思路|创新大会|招聘结果|招聘活动|网红|小三房|假道士|\
    印发.{0,15}提出|公职人员|公开征求意见|天然气.*价格.*政策.*调整|招聘要求|客户满意度指数.{0,15}出炉|召开.{0,15}临时股东大会\
    .*债权登记日.*权益登记日|宣传.*活动.*铺开|担保基金成立|铁腕治|股转.*发布.{0,20}通知|发布.{0,20}意见.{0,10}决定|\
    与.{0,20}讨论.{0,20}问题|个税.{0,15}新规.{0,15}实施|一周楼市回顾|地点.*国债期限.*票面利率.*国债全称|股吧.*股吧.*股吧.*股吧.*股吧|\
    发布.*通知.*指出|定价.*集资.*挂牌|假期.*工作.*安排.*通知|每百元面值利息.*每百元面值利息.*每百元面值利息.*每百元面值利息|\
    公告.*公告.*公告.*公告.*公告.*公告.*公告|投诉编号.*投诉时间.*投诉品牌.*投诉内容|公告速览|造假.*案例分析|信托计划.*资金用途\
    .*还款来源|00.*00.*00.*00.*00.*00.*00.*00.*00.*00|资管规模.*预期收益.*资金用途|科技大会.{0,15}召开|个股利好：|上榜.*强|\
    国家风险.*上升.*表现.*方面'
    url_keywords = 'guba|question|Question'
    
    #title = '2017证券从业《金融市场基础》知识：基金与股票'
    #url = 'http%3A%2F%2Firm.cninfo.com.cn%2Fircs%2Finteraction%2FviewQuestionForSzse.do%3FquestionId%3D6126764'
    not_tit = re.search(title_keywords,title)
    #not2_tit = re.search(not_title_keywords,title)
    not_con = re.search(con_keywords,content)
    not_url = re.search(url_keywords,url)
    
    ####判断是否属于研报
    research_report_TK = '.*证券--.*行业研究|(予|维持|花旗|对).*(评级|目标价)|证券.*(：|:)|投资评级|\
    (降|升|下调|调高|调低).*目标价|策略.*看好'
    not_research_report_TK = '证券从业《金融市场基础》知识：|证券.*(：|:).*净偿还累计'
    RRTK = re.search(research_report_TK,title)
    not_RRTK = re.search(not_research_report_TK,title)
    if RRTK and not not_RRTK:
        lable = '研报'
    '''
    #####判断是否属于公告
    announcement_TK = '(花园|厕所|车|房屋|住房|水库|节能|采购|政务|农路|采购|整治|道路|评审|获奖|设施|燃气|\
    学院|校区|节能|应用|旅游|改造|宅|工程|风景.*提示|下达.*资金|业务外包|提升|服务|房地产|保养|消防|\
    清洁|扶贫|迁址|管网|国网|发电|建设|评审|承包|改造|教学楼).*项目|\
    (专项|图书|设备|电缆|展示架).*采购|\
    (公路|灯|拆除|车间|弱电|用电|提标|环路|道路|供电|箱变|地下水|电.*站重建|提升|维修|翻修|服务|配电|改造|市政|\
    道路|驳岸|专变).*工程|\
    (招标|中标|采购|征求意见|评审|获奖|调整|项目|上市公司).*(公告|公示)|\
    文化.*研讨会|安全.*背熟|验收意见|专项规划|节能.*审查|\
    (提醒|旅游|涉水|关注).*安全|\
    (防范|提示|提醒).*风险|\
    (项目|工程|公开).*招标|\
    转让服务|采购及安装|故障诊断.*平台|沪深公告摘要|托管协议|基金合同|工作情况通报|发布.*通告|\
    职称.*一览表|审批通过.*名单|设备.*对标|授权证书|片区.*整理|关于.*对标|关于.*改正.*决定|\
    有奖竞答|安全.*监管.*计划表|学术会议|发表.*评论|处罚信息公开|信息公开表|发表.*评论|招聘.*简章|执法抽查结果|\
    采购.*中标|关于.*批复函|\
    沪深公告摘要|\
    公布.*通知'
    
    ATK = re.search(announcement_TK,title)
    if ATK:
        if lable == '':
            lable = '公告'
        else:
            lable = lable +','+ '公告'
            
    ####判断是否属于二级市场专项
    market_TK = '(成交金额|涨跌幅|流通市值|换手率)排行榜|交易提示|交易信息提示|价格行情|操作建议|\
    分布情况|暴力拉升.*涨幅|单日报表|注销仓单|库存(统计|变动)|股市午评|大盘收评|(交割|仓单).*日报|单日报表|\
    前.*名|盘中直击|盘后点评|股市收评|价格行情|收评|机构调研|午间看盘|独家资金|(股市|大盘)早评|机构策略|净值增长率|\
    早评|检验量报告|行情整理|(单|净)流入流出|生意社.*月.*日|盘面追踪|保证金调整|(收盘|官方)月均价|千股千评|结算月平均|\
    (个股|行情|振幅|跌幅|资金流向|排名|统计|涨幅|公司|解禁|金额|流向|成交(量|笔)|增长率|回购|调整|价格|利息额|增长率|\
    前.*名|信息|交易情况)一览|\
    公司公告|(股市|申购).*消息|年度我国|大宗交易信息|美国.*月|中钢协.*月|行情早报|股市早评|(午|晚)间公告|\
    (发行|特别|配股|新股|分红|公告|扩募|事项|实施|上市|信息|停牌|派息)提示|\
    单产预估|收盘(行情|报价)|涨跌幅超过|中签结果|机构论市|仓单日报|\
    '
    MTK = re.search(market_TK,title)
    if MTK:
        if lable =='':
            lable = '二级市场专项'
        else:
            lable = lable +','+'二级市场专项'
    '''
    
    print ('svm data receive successful')
    #pattern = ['\d{4}/\d{1,2}/\d{1,2}\s+\d{1,2}:\d{1,2}','\d{4}-\d{1,2}-\d{1,2}\s+\d{1,2}:\d{1,2}:\d{1,2}']
    #for i in pattern:
        #content = re.sub(i,'',content)
    word_cut = jieba.lcut(content.strip(), cut_all = False)
    news1 = []
    news1.append(' '.join(word_cut))
    '''
    print ('====onesvm judge====')
    vec_testone = onevec.transform(news1)        
    tf_testone = onetransformer.transform(vec_testone)
    yone = oneclf.predict(tf_testone)
    if yone[0] == 1 and '二级市场专项' not in lable:
        if lable =='':
            lable = '二级市场专项'
        else:
            lable = lable +','+'二级市场专项'
    '''
    print ('===IF judge====')
    vec_testif = IFvec.transform(news1)
    tf_testif = IFtransformer.transform(vec_testif)
    ch2_testif = IFch2.transform(tf_testif)
    yif = IFclf.predict(ch2_testif)
    print ('svm model judge successful')
    if yif[0] == 0:
        key = re.search(keywords,title)
        if key:
            if lable == '':
                lable =  '互联网金融'
            else:
                lable =  lable +','+ '互联网金融'
    else:
        if lable == '':
            lable =  '互联网金融'
        else:
            lable =  lable +','+ '互联网金融'
            
    print ('====im IF rules====')
    #######文本分类(区分正负面)
    if not_con or not_url or not_tit or len(content) < 120:
        '''
        if not_con:
            print (not_con.group())
        elif not_url:
            print (not_url.group())
        elif not_tit:
            print (not_tit.group())
        else:
            print (len(content))
        '''
        print ('dont svm')
    else:
        ######judge entity
        if len(entitylist) != 0:
            print ('entityList exist')
            #####judge posorneg
            vec_testpn = pnvec.transform(news1)
            tf_testpn = pntransformer.transform(vec_testpn)
            ch2_testpn = pnch2.transform(tf_testpn)
            ypn = pnclf.predict(ch2_testpn)        
            if ypn[0] == 1:
                print ('====admin judge====') 
                vec_testad = advec.transform(news1)
                tf_testad = adtransformer.transform(vec_testad)
                ch2_testad = adch2.transform(tf_testad)
                yad = adclf.predict(ch2_testad)   
                ad_key = re.search(ad_keywords,content)
                not_ad_key = re.search(not_ad_keywords,content)
                if yad[0] == 1 and ad_key and not not_ad_key:
                    if lable == '':
                        lable =  '高管股东预警'  
                    else:
                        lable = lable +','+ '高管股东预警'
                    ad_flag = True
                    ad1_key = re.search(ad1_keywords,content)
                    ad2_key = re.search(ad2_keywords,content)
                    not_ad2_key = re.search(not_ad2_keywords,content)
                    ad3_key = re.search(ad3_keywords,content)
                    not_ad3_key = re.search(not_ad3_keywords,content)
                    ad4_key = re.search(ad4_keywords,content)
                    not_ad4_key = re.search(not_ad4_keywords,content)
                    ad5_key = re.search(ad5_keywords,content)
                    not_ad5_key = re.search(not_ad5_keywords,content)
                    if ad1_key:
                        lable = lable + ','+'高管股东企业接班人问题'
                        ad_flag = False
                    if ad2_key and not not_ad2_key:
                        lable = lable +',' + '高管涉及违法违规'
                        ad_flag = False
                    if ad3_key and not not_ad3_key:
                        lable = lable + ',' + '高管出现重大变动'
                        ad_flag = False
                    if ad4_key and not not_ad4_key:
                        lable = lable + ',' + '高管股东之间出现矛盾'
                        ad_flag = False
                    if ad5_key:
                        lable = lable + ',' + '与员工之间的问题' 
                        ad_flag = False
                    if ad_flag and not not_ad5_key:
                        lable = lable + ',' + '高管其它类' 
                print ('====im admin rules====')
                
                print ('====assure judge====')
                vec_testas = asvec.transform(news1)
                tf_testas = astransformer.transform(vec_testas)
                ch2_testas = asch2.transform(tf_testas)
                yas = asclf.predict(ch2_testas)
                ass_ = re.search(ass_keywords,content)
                not_ass = re.search(not_ass_keywords,content)
                if yas[0] ==1 and ass_ and not not_ass:
                    if lable == '':
                        lable =  '担保类预警'
                    else:
                        lable = lable +','+ '担保类预警'
                    ass_flag = True
                    ass1_key = re.search(ass1_keywords,content)
                    ass2_key = re.search(ass2_keywords,content)
                    if ass1_key:
                        lable = lable +','+'违规担保或担保一方出现问题'
                        ass_flag = False
                    if ass2_key:
                        lable = lable + ',' + '对外担保过多'
                        ass_flag = False
                    if ass_flag:
                        lable = lable + ',' + '其它担保预警'
                print ('====im assre rules====')
                
                print ('====credit judge====')     
                vec_testcre = crevec.transform(news1)
                tf_testcre = cretransformer.transform(vec_testcre)
                ch2_testcre = crech2.transform(tf_testcre)
                ycre = creclf.predict(ch2_testcre)
                cre_key = re.search(credit_keywords,content)
                not_cre_key = re.search(not_credit_keywords,content)
                if ycre[0] == 1 and cre_key and not not_cre_key:
                    if lable == '':
                        lable =  '信用类预警'
                    else:
                        lable = lable +','+ '信用类预警'
                    cre_flag = True
                    cre1_key = re.search(cre1_keywords,content)
                    not_cre1_key = re.search(not_cre1_keywords,content)
                    cre2_key = re.search(cre2_keywords,content)
                    not_cre2_key = re.search(not_cre2_keywords,content)
                    cre3_key = re.search(cre3_keywords,content)
                    not_cre3_key = re.search(not_cre3_keywords,content)
                    cre4_key = re.search(cre4_keywords,content)
                    not_cre4_key = re.search(not_cre4_keywords,content)
                    cre5_key = re.search(cre5_keywords,content)
                    not_cre5_key = re.search(not_cre5_keywords,content)
                    cre6_key = re.search(cre6_keywords,content)
                    not_cre6_key = re.search(not_cre6_keywords,content)
                    if cre1_key and not not_cre1_key:
                        lable = lable + ',' + '承诺失信'
                        cre_flag = False
                    if cre2_key and not not_cre2_key:
                        lable = lable + ',' + '挪用或占用资金'
                        cre_flag = False
                    if cre3_key and not not_cre3_key:
                        lable = lable + ',' + '评级关注下调或列入负面或观察或推迟评级'
                        cre_flag = False
                    if cre4_key and not not_cre4_key:
                        lable = lable + ',' + '欺诈或虚假宣传或造假'
                        cre_flag = False
                    if cre5_key and not not_cre5_key:
                        lable = lable + ',' + '企业失联列入经营异常或负债过高'
                        cre_flag = False
                    if cre6_key and not not_cre6_key:
                        lable = lable + ',' + '企业违约或信贷逾期'
                        cre_flag = False
                    if cre_flag:
                        lable = lable + ',' + '信用其它类预警'
                    
                print ('====im credit rules====')
                
                print ('======== finance judge====')  
                vec_testfin = finvec.transform(news1)
                tf_testfin = fintransformer.transform(vec_testfin)
                ch2_testfin = finch2.transform(tf_testfin)
                yfin = finclf.predict(ch2_testfin)
                
                fin_ = re.search(fin_keywords,content)
                not_fin = re.search(not_fin_keywords,content)
                not_fin1 = re.search(not_fin_keywords1,content)
                not_fin2 = re.search(not_fin_keywords2,content)
                if yfin[0] == 1 and fin_:
                    if not_fin1:
                        if not_fin2:
                            if lable == '':
                                lable =  '财务类预警'
                            else:
                                lable = lable +','+ '财务类预警'
                    else:
                        if not not_fin:
                            if lable == '':
                                lable =  '财务类预警'
                            else:
                                lable = lable +','+ '财务类预警'
                    '''            
                    fin_flag = True
                    fin1_key = re.search(fin1_keywords,content)
                    fin2_key = re.search(fin2_keywords,content)
                    fin3_key = re.search(fin3_keywords,content)
                    fin4_key = re.search(fin4_keywords,content)
                    fin5_key = re.search(fin5_keywords,content)
                    if fin1_key:
                        lable = lable + ',' + '财务造假'
                        fin_flag = False
                    if fin2_key:
                        lable = lable + ',' + '发生亏损或财务指标下降'
                        fin_flag = False
                    if fin3_key:
                        lable = lable + ',' + '会计所问题'
                        fin_flag = False
                    if fin4_key:
                        lable = lable + ',' + '资不抵债或负债高'
                        fin_flag = False
                    if fin5_key:
                        lable = lable + ',' + '资金不足或来源不明'
                        fin_flag = False
                    if fin_flag:
                        lable = lable + ',' + '其它财务类预警'
                    '''
                print ('====im finance rules====')        
                        
                print ('======== manage judge====')       
                vec_testman = manvec.transform(news1)
                tf_testman = mantransformer.transform(vec_testman)
                ch2_testman = manch2.transform(tf_testman)
                yman = manclf.predict(ch2_testman)
                man_ = re.search(manage_keywords,content)
                not_man = re.search(not_man_keywords,content)
                if yman[0] == 1 and man_ and not not_man:
                    if lable == '':
                        lable =  '经营管理类预警'
                    else:
                        lable = lable +','+ '经营管理类预警'
                print ('====im manage rules====')
                
                print ('======== market judge====')       
                vec_testmar = marvec.transform(news1)
                tf_testmar = martransformer.transform(vec_testmar)
                ch2_testmar = march2.transform(tf_testmar)
                ymar = marclf.predict(ch2_testmar)
                not_mar = re.search(not_mar_keywords,content)
                mar_ = re.search(mar_keywords,content)
                if ymar[0] == 1 and mar_ and not not_mar:
                    if lable == '':
                        lable =  '市场类预警'
                    else:
                        lable = lable +','+ '市场类预警'
                    '''
                    mar_flag = True
                    mar1_key = re.search(mar1_keywords,content)
                    mar2_key = re.search(mar2_keywords,content)
                    mar3_key = re.search(mar3_keywords,content)
                    mar4_key = re.search(mar4_keywords,content)
                    mar5_key = re.search(mar5_keywords,content)
                    if mar1_key:
                        lable = lable + ',' + '股份转让或减持或减少'
                        mar_flag = False
                    if mar2_key:
                        lable = lable + ',' + '股权质押或冻结或爆仓'
                        mar_flag = False
                    if mar3_key:
                        lable = lable + ',' + '暂停交易或上市发行或面临风险警示'
                        mar_flag = False
                    if mar4_key:
                        lable = lable + ',' + '证券价格异常波动'
                        mar_flag = False
                    if mar5_key:
                        lable = lable + ',' + '做空股价报告(包括但不限于券商报告)'
                        mar_flag = False
                    if mar_flag:
                        lable = lable + ',' + '其它市场类预警'
                    '''
                print ('====im market rules====')
                
                print ('======== product judge====')
                vec_testpro = provec.transform(news1)
                tf_testpro = protransformer.transform(vec_testpro)
                ch2_testpro = proch2.transform(tf_testpro)
                ypro = proclf.predict(ch2_testpro)
                pro_ = re.search(pro_keywords,content)
                not_pro = re.search(not_pro_keywords,content)
                if ypro[0] == 1 and pro_ and not not_pro:
                    if lable == '':
                        lable =  '产品类预警'
                    else:
                        lable = lable +','+ '产品类预警'
                    '''
                    pro_flag = True
                    pro1_key = re.search(pro1_keywords,content)
                    pro2_key = re.search(pro2_keywords,content)
                    if pro1_key:
                        lable = lable + ',' + '产品设计或生产缺陷或属于淘汰类'
                        pro_flag = False
                    if pro2_key:
                        lable = lable + ',' + '产品侵权'
                        pro_flag = False
                    if pro_flag:
                        lable = lable + ',' + '其它产品类预警'
                    '''
                print ('====im product rules====')
                
                print ('======== project judge====')
                vec_testproj = projvec.transform(news1)
                tf_testproj = projtransformer.transform(vec_testproj)
                ch2_testproj = projch2.transform(tf_testproj)
                yproj = projclf.predict(ch2_testproj)
                proj_ = re.search(proj_keywords,content)
                not_proj = re.search(not_proj_keywords,content)
                if proj_ and not not_proj:
                    if lable == '':
                        lable =  '项目类预警'
                    else:
                        lable = lable +','+ '项目类预警'
                    '''
                    proj_flag = True
                    proj1_flag = re.search(proj1_keywords,content)
                    proj2_flag = re.search(proj2_keywords,content)
                    proj3_flag = re.search(proj3_keywords,content)
                    if proj1_key:
                        lable = lable + ',' + '项目出现停建、延期'
                        proj_flag = False
                    if proj2_key:
                        lable = lable + ',' + '项目审批手续不完备'
                        proj_flag = False
                    if proj3_key:
                        lable = lable + ',' + '项目投产后产能与预期存在差距'
                        proj_flag = False
                    if proj_flag:
                        lable = lable + ',' + '其它项目类预警'
                    '''
                print ('====im project rules====')
                
                print ('======== regulate judge====')       
                vec_testreg = regvec.transform(news1)
                tf_testreg = regtransformer.transform(vec_testreg)
                ch2_testreg = regch2.transform(tf_testreg)
                yreg = regclf.predict(ch2_testreg)
                reg_ = re.search(reg_keywords,content)
                not_reg = re.search(not_reg_keywords,content)
                if yreg[0] == 1 and reg_ and not not_reg:
                    if lable == '':
                        lable =  '监管类预警'
                    else:
                        lable = lable +','+ '监管类预警'
                print ('====im regulate rules====')
                
                print ('======== unforce judge====')   
                vec_testunf = unfvec.transform(news1)
                tf_testunf = unftransformer.transform(vec_testunf)
                ch2_testunf = unfch2.transform(tf_testunf)
                yunf = unfclf.predict(ch2_testunf)
                unf_ = re.search(unf_keywords,content)
                not_unf = re.search(not_unf_keywords,content)
                if yunf[0] == 1 and unf_ and not not_unf:
                    if lable == '':
                        lable =  '不可抗力类预警'
                    else:
                        lable = lable +','+ '不可抗力类预警'
                print ('====im unforce rules====')
                
                print ('======== other judge====')
                #vec_testoth = othvec.transform(news1)
                #tf_testoth = othtransformer.transform(vec_testoth)
                #ch2_testoth = othch2.transform(tf_testoth)
                #yoth = othclf.predict(ch2_testoth)       
                #if yoth[0] == 1:
                not_oth = re.search(oth_keywords,content)
                if lable == '' and not not_oth:
                    lable =  '其它类预警'
                #else:
                    #lable = lable +','+ '其它类预警'
                print ('====im other rules====')
    
    rt = {'SVM_TextSort':lable}
    print ('svm change json successful')
    time_end=time.time()
    print ('svm totally cost',time_end-time_start)
    print (rt)
    return json.dumps(rt)


@app.route('/SVM_ShortText/', methods=['POST'])
def SVM_ShortText():
    time_start=time.time()
    
    #url = request.form.get('siteDomain')
    #text = request.form.get('content')
    #title = request.form.get('title')
    
    #url = request.json['siteDomain']    
    text = request.json['content']
    #title = request.json['title']
    
    lable = ''
    neg_word = ''
    content = text
    neg1_text = re.search(neg1,content)
    
    neg2_text = re.search(neg2,content)
    if neg1_text:
        no_neg1_text = re.search('('+no+').{0,5}'+neg1_text.group(),content)
        if not no_neg1_text:
            lable = '-1'
            neg_word = neg1_text.group()
    if neg2_text:
        no_neg2_text = re.search('('+no+').{0,5}'+neg2_text.group(),content)
        if not no_neg2_text:
            lable = '-2'
            neg_word = neg2_text.group()
    if lable == '':
        lable = '0'
    
    rt = {'SVM_ShortText':lable,'neg_word':neg_word}
    print ('svm change json successful')
    time_end=time.time()
    print ('svm totally cost',time_end-time_start)
    print (rt)
    return json.dumps(rt)


if __name__ == '__main__':
    app.run(host = '0.0.0.0')
    
    

