# -*- coding: utf-8 -*-
"""
Created on Wed Jun  6 16:36:20 2018

@author: XAYQ-WangChenxi
"""

from __future__ import unicode_literals

#from flask_restful import reqparse,Api, Resource
from flask_restful import Api
from flask import Flask,request

#from flask import abort
#from flask import make_response,Response  
import json
#import tab
import time
#########test/product==========
import re
#####放在11.41库
import jieba
import os
import jieba.analyse
####导入排重包


test_content = '我是测试文章'
jieba.lcut(test_content.strip(), cut_all = False)

def abspath(filename):
    basedir = '/home/nlp/model'
    #basedir = 'E:/NLP/深圳局/NegInf'
    return os.path.join(basedir, filename)

print ('IFFile is loading ......')
from sklearn.externals import joblib
IFclf = joblib.load(abspath("IF/model.m"))
IFvec = joblib.load(abspath("IF/vec.m"))
IFtransformer = joblib.load(abspath("IF/tfidf.m"))
IFch2 = joblib.load(abspath("IF/ch2.m"))
print ('IFFile loading successful')

adclf = joblib.load(abspath("admin/model.m"))
advec = joblib.load(abspath("admin/vec.m"))
adtransformer = joblib.load(abspath("admin/tfidf.m"))
adch2 = joblib.load(abspath("admin/ch2.m"))
print ('admin File loading successful')

asclf = joblib.load(abspath("assure/model.m"))
asvec = joblib.load(abspath("assure/vec.m"))
astransformer = joblib.load(abspath("assure/tfidf.m"))
asch2 = joblib.load(abspath("assure/ch2.m"))
print ('assure File loading successful')

creclf = joblib.load(abspath("credit/model.m"))
crevec = joblib.load(abspath("credit/vec.m"))
cretransformer = joblib.load(abspath("credit/tfidf.m"))
crech2 = joblib.load(abspath("credit/ch2.m"))
print ('credit File loading successful')

finclf = joblib.load(abspath("finance/model.m"))
finvec = joblib.load(abspath("finance/vec.m"))
fintransformer = joblib.load(abspath("finance/tfidf.m"))
finch2 = joblib.load(abspath("finance/ch2.m"))
print ('finance File loading successful')

manclf = joblib.load(abspath("manage/model.m"))
manvec = joblib.load(abspath("manage/vec.m"))
mantransformer = joblib.load(abspath("manage/tfidf.m"))
manch2 = joblib.load(abspath("manage/ch2.m"))
print ('manage File loading successful')

marclf = joblib.load(abspath("market/model.m"))
marvec = joblib.load(abspath("market/vec.m"))
martransformer = joblib.load(abspath("market/tfidf.m"))
march2 = joblib.load(abspath("market/ch2.m"))
print ('market File loading successful')

proclf = joblib.load(abspath("product/model.m"))
provec = joblib.load(abspath("product/vec.m"))
protransformer = joblib.load(abspath("product/tfidf.m"))
proch2 = joblib.load(abspath("product/ch2.m"))
print ('product File loading successful')

projclf = joblib.load(abspath("project/model.m"))
projvec = joblib.load(abspath("project/vec.m"))
projtransformer = joblib.load(abspath("project/tfidf.m"))
projch2 = joblib.load(abspath("project/ch2.m"))
print ('project File loading successful')

regclf = joblib.load(abspath("regulate/model.m"))
regvec = joblib.load(abspath("regulate/vec.m"))
regtransformer = joblib.load(abspath("regulate/tfidf.m"))
regch2 = joblib.load(abspath("regulate/ch2.m"))
print ('regulate File loading successful')

unfclf = joblib.load(abspath("unforce/model.m"))
unfvec = joblib.load(abspath("unforce/vec.m"))
unftransformer = joblib.load(abspath("unforce/tfidf.m"))
unfch2 = joblib.load(abspath("unforce/ch2.m"))
print ('unforce File loading successful')

othclf = joblib.load(abspath("other/model.m"))
othvec = joblib.load(abspath("other/vec.m"))
othtransformer = joblib.load(abspath("other/tfidf.m"))
othch2 = joblib.load(abspath("other/ch2.m"))
print ('other File loading successful')

pnclf = joblib.load(abspath("posneg/model.m"))
pnvec = joblib.load(abspath("posneg/vec.m"))
pntransformer = joblib.load(abspath("posneg/tfidf.m"))
pnch2 = joblib.load(abspath("posneg/ch2.m"))
print ('posorneg File loading successful')

pn1clf = joblib.load(abspath("posneg1/model.m"))
pn1vec = joblib.load(abspath("posneg1/vec.m"))
pn1transformer = joblib.load(abspath("posneg1/tfidf.m"))
pn1ch2 = joblib.load(abspath("posneg1/ch2.m"))
print ('posorneg1 File loading successful')

oneclf = joblib.load(abspath("onesvm/model.m"))
onevec = joblib.load(abspath("onesvm/vec.m"))
onetransformer = joblib.load(abspath("onesvm/tfidf.m"))
print ('onesvm File loading successful')

##加载负面词典
neg1 = '减持|预亏|负债率高|风险加剧|重组风险|遭质疑|戴帽风险|大股东套现|关联交易|业绩存疑|重组中止|夸大宣传|质量门|罗生门|服务不佳|再度减持|不达标|销售不力|生产过剩|挪用募资|评级下调|网友投诉|精准减持|客户投诉|拖欠贷款|价量齐跌|利润收窄|误导销售|资金压力|毛利减少|低价贱卖|滞销严重|前景看淡|烧钱|风险凸显|利益损失|巨额赔偿|罚款|主业更迭|伪高新|捆绑销售|数据打架|危及健康|投诉|陷入困境|存货大幅上升|品牌受重创|偷工减料|遭遇黑天鹅|入不敷出|矛盾升级|遭猜疑|遭猜忌|净利润预降|陷困境|卖家产|诚信危机|遭索赔|踩雷|存隐患|风险警示|责令整改|抽检不合格|黑榜|资金匮乏|资产不明|集体辞职|质检不合格|负增长|承诺不兑现|超标|信用黑榜|主业不明|原料不明|过保质期|取消资格|公信力降低|故意违约|质量堪忧|内鬼|画饼|假公济私|用脚投票|垃圾债|债务违约|前景难料|藏猫腻|现状堪忧|打白条|深陷泥沼|发展瓶颈|主业惨淡|前景黯淡|涉嫌隐瞒|三角债|不合格|市值缩水|研报抄袭|质量纠纷|管理硬伤|资质不佳|库存压力大|现金流紧张|违反财务承诺|资金链窘境|名誉侵权|市值蒸发|质量担忧|负重前行|股民控诉|主营歉收|舆论危机|商标纠纷|业绩变脸|管理混乱|囤货严重|责任缺失|订单缩水|大额抛售|销售下滑|年报有误|难掩亏损|扩股圈钱|缺乏核心竞争产品|多重资金压力|中报大注水|产品缺陷|销量差|矛盾加剧|投资超限|业务低迷|跌幅首位|债台高筑|贷款叫停|频频减持|项目停摆|被踢出|高溢价并购|业绩踩雷|戴帽|重组告吹|夭折|做局|遭严打|被诱骗|收购泡汤|误导客户|整改不达标|募投项目存疑|保壳战|业绩下滑|变卖资产|逆势扩张|募投项目缩水|索赔|夸大收益|摊上事了|收益暴跌|夸大推介|业绩承诺过高|被非标|市场质疑|不靠谱|遭拍卖|披星戴帽|存款失窃|躺枪|被揪出旧账|审查遭中止|疑窦重重|动机不纯|前景堪忧|看淡重组前景|混改折戟|挂牌遇冷|遭遇人事动荡|帮凶|项目进展迟缓|疑存风险|盈转亏|悬念丛生|摊事|数据掐架|泡汤|被篡改|项目前景不明|存货激增|销量下滑|业绩三连降|业绩虚胖|逐年萎缩|大变脸|减持套现|主动退市|被终止|遭终止|动机遭质疑|局中局|陷提价怪圈|流标|奇葩|疯狂出逃|账面浮亏|亏损泥潭|担保能力存疑|负债额畸形|费用游戏|玩财技|暗放利好|和解遭拒|澄而不清|研发能力存疑|圈钱发奖金|资金紧绷|拼爹门|拖累业绩|股价饱受质疑|股权存变数|信任危机|迷局待破|溢价收购|库存高企|价格垄断|质量投诉|败家|销售停滞|缺少资金|折价甩卖|质量不过关|资金链存忧|风险犹存|重组引质疑|限价难保|销售低迷|卖壳难成行|借壳梦碎|大幅减持|坑爹|保价成空|大额举债|资金困局|财务趋紧|收购亏损公司|募资被占用|负收益|冤大头|前景不明|业绩地雷|品牌短板|擦边球|重组艰难|扭亏无望|销量利润双跌|频繁换血|整合迷局|逆势跳水|资金周转困局|全年预亏|业绩受损|舆论质疑|净亏损|专家质疑|订单无下文|资质一般|评估定价有失公允|不实信息|遭围剿|大肆减持|大量套现|巨额套现|主业有硬伤|债务压顶|再度巨亏|体系混乱|管理问题|进展迟缓|借机套现|麻烦缠身|现金流失|打水漂|毛利率承压|业绩暴减|陷入迷途|遭遇质疑|借利好套现|疯狂减持|利润亏损|私卖|变相套现|被注销|存货畸高|亏空|项目被查|赌局|身陷困境|产能过剩|吸血鬼|遭逼问|仙股|客户单一|约谈|遭看空|花式借壳|行业危机|溢价|扭亏无期|终止增发|落空|存考验|大股东易位|折戟|前路漫漫|铩羽|不靠普|重组筹划终止|梦魇|恶意抛售|无实际控制人|玩文字游戏|遭吐槽|偿付存疑|ST危机|遭爆炒|不乐观|垫底|业绩加速滑坡|遭遇乌龙|投机炒作|埋下隐患|毛利偏低|利润遭威胁|权宜之计|生变|后院起火|豪赌|被指风险高|砸招牌|遭狙击|酿大祸|业务下滑|停牌前躁动|未落地|增收不增利|依赖大客户|鸡肋|遭拖累|添变数|存变数|脸上贴金|无法对付|噱头|改革迷雾|可持续性存疑|巧合介入|蹊跷|黑色产业链条|漏洞|无改良迹象|挫折|束缚|争锋相对|风口浪尖|屡教不改|心太狠|业绩滑坡|滑铁卢|负面|业绩短板|颓势难扭|套利悬疑|增发毒丸|搅局|暗斗|出尔反尔|妖气缠身|意外泡汤|喊冤|断臂上市|遭诟病|回应迟到|窃听风云|遭浮亏|回扣|疑团|股权转让落空|搭车之嫌|捧杀|陨落|战略不明|遇寒流|逃责|乌龙单|再遭冷眼|铤而走险|转型噩梦|添堵|见光死|陷入烦恼|表态太含糊|生死劫|闹剧|掩护减持|连环套|猫腻|拖欠|遭泄露|难挽颓势|临阵脱逃|推掉责任|赔本甩卖|风波未息|毒饵|真真假假|是是非非|扩张失败|债务游戏|业绩未达标|净利速滑|下调亏损额|内外交困|改错王|放卫星|土豪式送转|陷阱|多事之秋|经营不善|遭声讨|募投诡象|准点减持|研发费用疑云|危机四伏|争议不断|铁公鸡|踩点减持|陷困局|偿付危机|灰色地带|濒临绝境|增资迷局|摊上大事|卖子还债|严重依赖|蹊跷收购|暗藏风险|暗藏陷阱|暗藏猫腻|暗藏隐患|暗藏地雷|恐生变|通报批评|穷途末路|转型失败|卖身还债|三宗罪|内斗升级|股东翻脸|陷十面埋伏|离职潮|不合作声明|股权之争|追咬|引狼入室|突围不易|贱卖|地下硕鼠|被推进危局|薪酬成谜|股东掐架|资格被撤|资产存硬伤|宫斗剧|影响经营|业绩受考验|闹剧重组|难逃卖壳|神秘重组|惹争议|同室操戈|保壳前景堪忧|重组谜团|定增堵单|商标被卖|遭嘲讽|迷雾重重|存货难销|补贴依赖症|败走|保壳失败|扑朔迷离|画饼充饥|高层地震|整合失败|业绩难达标|预谋|问题严重|打太极|闯关失败|资产不符条件|走向成谜|引资本市场围观|互黑|嘴仗|小辫子|狐狸尾巴|诸多疑点|自查不能服众|踢皮球|人祸|陷入泥潭|严重亏损|老油条|新瓶装旧酒|骗局|家丑|固步自封|生死边缘|怠工|转型之困|降级|遭否决|主业单一|软肋|变天|藏忧|资不抵债|损失惨重|延期|拖延|业绩梦魇|杀鸡取卵|损失巨大|自相矛盾|前景蒙尘|三缄其口|钻空子|来源不明|经营欠佳|转型遇阻|引监管关注|重组闹剧|转型阵痛|报忧|收效甚微|架空|悬案|产生分歧|分歧加剧|存在分歧|分歧严重|命悬一线|折翅|自揭家丑|风光不再|债市风暴|引不满|前途未卜|踩线|踩红线|被逾期|麻烦公司|一股独大|资金紧张|一蹶不振|争议|翻旧账|遭封杀|开倒车|断臂求生|被否|遭扣押|酿苦果|起波澜|缺乏人气|变脸王|敷衍|为钱所困|黄粱一梦|业务不振|内控之忧|不被看好|急速下滑|吃补助|多重压力|风险敞口大开|不务正业|区经营风险|说谎|难盈利|保壳渺茫|投资去向不明|面临风险|实力不济|财务窟窿|中报蒙尘|被拉黑|非理性|沉迷理财|业绩堪忧|承诺成泡影|不尽责|注资迷雾|遭淘汰|业务持续不振|内忧外患|困局凸显|订单地雷|陷绝境|致命鸦片|重组难遂愿|过度依赖|密集减持|糊涂账|业绩遭侵蚀|遭曝光|逃避责任|债务缠身|摆乌龙|遭消化不良|败笔|变相涨价|腰斩|业绩难堪|税制混乱|不完善|注水|挨批|挨罚|不属实|全军覆没|欲盖弥彰|被染过|业务集中|遭通报|疲态尽显|圈钱戏码|难扭亏损|遭市场冷眼|有疑点|不看好重组|市场低迷|超级权力|业务流产|扮靓业绩|经营危机|绯闻缠身|拖油瓶|藏隐忧|有水分|搞砸危机公关|资金瓶颈|恩仇录|步履维艰|出口下滑|风险重重|未尽责|公开谴责|空手套白狼|催肥业绩|陷僵局|胆气不足|愈演愈烈|遭发难|金玉其外败絮其中|计提风波|边缘化|累赘|玩失踪|青黄不接|拖下水|高管勾心斗角|众怒|虚增|失败|蒸发|举报|缠身|遇困局|陷入危机|陷入危局|甩卖|硬伤|泥潭|拖累利润|黑洞|恶意误导|漩涡|激进|难逃|谴责|告吹|惨遭|缺陷|遇阻|被判|争夺战|涉嫌炒作|危局|丑闻|沦为鸡肋|绊脚石|绝收|惨淡|受挫|掐架|屡遭|被爆料|夸大|利空|受罚|高估|洗黑钱|雪上加霜|不容乐观|失控|抄袭|频遭|过山车|瑕疵|苦果|屡次|恶意|纷争|重挫|瞒报|围攻|吞噬|秘而不宣|血本无归|骗取|埋雷|参假|黯淡|跳水|反遭|生疑|抹黑|带伤|疑窦|弊端|错失|遭到举报|悲剧|潜藏|沦陷|不买账|损害|信披不实|遥遥无期|噩梦|大肆侵吞|大肆敛财|老赖|受贿罪|未达标|侵蚀|劣迹|口水仗|弃壳|难见效|炮轰|开喷|骂战|卷款门|屡禁不止|清仓式|高位套现|厮杀|讲故事|猜谜期|堪忧|蚕食|昙花一现|乱账|掣肘|高管迷信|作秀|暗战|闹翻|扯皮|业绩异常|遮遮掩掩|闪辞|钱荒|拒解释|隐瞒|难解渴|钉子户|偷龙转凤|举步维艰|股价蹦极|李鬼|惹众怒|乌龙|虚胖|受困|颓势|依赖综合征|名不副实|催命符|坏孩子|带病申购|走弯路|冰点|命途多舛|枯木难逢春|不着调|借款风波|成本飙升|扩张乏力|鬼画符|溃败|疑点难消|资金闲置|崩盘|元气未复|余悸尚存|不符程序|泄密门|决策错误|主业模糊|暂停审核|卸磨杀驴|风控漏洞|收购乱象|残局|对呛|拒绝和解|祸不单行|遭砸盘|过度融资|隐性超募|除权门|遭炮轰|诱导|遭遇麻烦|自不量力|难辞其咎|折价命运|有待商榷|踢场|败家子|致命伤|大跃进|成败难料|自揭伤疤|难脱干系|潜规则|爆炸|被收编|变相提价|离奇暴跌|砸盘|偏安一隅|担保门|涉事|集体沦陷|借款式重组|定时炸弹|过度乐观|技术瓶颈|水土不服|陷尴尬|联手坐庄|存瑕疵|险棋|毒丸|东窗事发|作弊|抹黑门|致癌|最差市值管理|衰败|麻烦不断|事故频发|傍大款|被举报|浮亏|遭唏嘘|变数难测|圈钱还债|相背离|捆绑协议|违规王|被弃门|前景叵测|烫手山芋|高产低效|孤注一掷|学历造假|臭鱼烂虾|主业不振|拦路虎|举债度日|被打脸|疑窦丛生|良心何在|变相欺骗|大出血|马甲账户|暗门|贱卖公司|拒不接收|空架子|存货余额大|遭看衰|亦官亦商|绑架|差强人意|看走眼|非议|不配合|打人|反目|遭罢免|沦为笑柄|太保守|偏向虎山行|复苏无望|扯皮战|装穷|消化不良|没落|战略阵痛|不翼而飞|被强平|令人发指|拖垮|胎死腹中|盛转衰|亏损严重|涉嫌操纵|中枪|迟报|定增受阻|躲猫猫|差钱|流拍|乌龙球|硬碰硬|有玄机|爽约|变脸|被卷入|带病|走钢丝|疑为|频发|疑似|变相借壳|变相违规|乱象|受损|虚构|协商无果|独大|受累|受波及|隐现|动荡不安|悬疑|协商未果|牵涉|牵出|抛弃|遇冷|深陷|谜团|诡异|供应过剩|忽悠|腾挪|滑坡|魔咒|管理缺失|窘境|掩盖事实|发展无望|甩包袱|寄生|发展阻碍|谎言|萎缩|濒临|顽疾|无视|沉浮|强行退市|抛锚|兴衰|涨薪门|不满|计划搁浅|搭错车|取款机|无厘头|多病缠身|殃及|缩水|被迫转型|洗大澡|萎靡不振|不死鸟|一落千丈|诟病|资格被撤销|债务困局|甩卖资产|内外勾结|吃里扒外|绩差生|蒙阴影|被打入冷宫|身陷囹圄|隐性交易|暗箱操作|铩羽而归|预亏王|颗粒无收|徐翔概念股|侵占|资本玩偶|疯狂并购|僵尸股|换汤不换药|利益输送|东床事发|黑庄|遭冻股|钻漏洞|资金玩偶|乱象丛生|扭亏乏术|惹麻烦|乌龙利好|管控薄弱|暗箱易主|转型停滞|承若泡汤|毒丸计划|江河日下|定增生变|作茧自缚|后院失火|负债累累|蒙上阴影|估值存疑|资金链吃紧|信披遗漏|风投出逃|扩张受挫|遭闷杀|诚意不足|恶意收购|失职嫌疑|涉嫌歧视|腹背受敌|破坏财物|举报丑闻|问题年报|增发迷雾|业绩不佳|拒不披露|业绩困局|借款逾期|警戒线|弥天大谎|趁火打劫|重组规模缩水|变数丛生|被套|忽悠式重组|画饼式重组|股价遭腰斩|实控人爽约|债务问题|存在不确定性|账户被查封|帐户被冻结|保壳危机|失信榜|项目烂尾|陷质押危局|举报门|陷亏损泥淖|重仓被套|陷多事之秋|股价异动|非阳光操作|遭爆料|灰色资金|灰色套利|灰色交易|囤地生财|投资者不满|学术造假|奇葩研报|停产门|停工风波|内控不完善|内控不健全|业绩惨淡|风波不断|自营巨亏|露马脚|草率|交易乱象|遭截胡|偷鸡不成蚀把米|定增破发|未予公告|提案被否|窗口期交易|数据涉假|经营难题|主业疲软|巨额减持|倒戈|陷多方博弈|被夺表决权|业绩退步|赔了夫人又折兵|乱象重生|遭撤销|陷纠纷|强制退市|盈利堪忧|定增方案被否|定增方案遭否|定增夭折|重组项目存变数|陷退市危机|被指掺假|涉嫌垄断|定增流产|屡遭处罚|违规占款|忽悠监管|遭巨额罚款|资本阴谋|机构大逃亡|敏感期买入|高负债|亏损|质量太次|利润腰斩|无证销售|净利下滑|销量同比大降|竞争力不足|存隐忧|业绩不达标|方案被否|重组遇冷|激进扩张|资金告急|陷舆论漩涡|主业陷困局|业绩失诺|标的资产披露不详|版权费纠纷|股东减持|年报数据打架|承诺未兑现|财务异常|年报疑团|应收账款存隐患|产品不合格|业绩巨降|净利润下滑|深交所追问|纠纷案|被疑圈钱|承诺或成空|转型落空|盈利模式模糊|数据存较大差异|被监管|负债率骤升|业绩承诺或难实现|业绩“急刹车”|重组方案流产|年报疑点多多|靠政府补助度日|被出具风险提示|负债高企|占用公司资金|逾期贷款难收|重大事项遭否|承诺难兑现|皮包公司|陷业绩泥潭|营收下滑|利润大幅下降|面临暂停交易风险|粉饰业绩|资金链承压|被中小股东否决|投资者质疑|盈利引质疑|业绩预告“失准”|净利润下降|资质存疑|痛骂|对峙|造谣|功败垂成|土崩瓦解|硝烟弥漫|起伏不定|惹祸上身|各自为战|嘲笑|徇私|输血|痛斥|暴露出|歧视|做手脚|若隐若现|假劣|损人利己|赔不起|噤若寒蝉|卷进|成也萧何|骚动|煤气中毒|假冒|超期|背负着|除名|犹抱琵琶半遮面|风声鹤唳|骗到|不痛不痒|卸包袱|何去何从|白热化|疏于|抢夺|驳回|鸟尽弓藏|越权|裁定|掩饰|指责|恐慌|事出有因|入侵|报复|避讳|毁约|贴金|缴获|惨不忍睹|可乘之机|制造舆论|扣罚|折磨|祸及|付之东流|此消彼长|逼到|搁浅|冷落|聚敛钱财|严峻形势|整肃|不良行为|诸多困难|摸不清|掠夺|销声匿迹|大肠杆菌超标|阻碍|言而无信|胡作非为|下降|举债|挽救|致癌性|轻视|触雷|停产|护短|肆无忌惮|无功而返|始料未及|陷入|衰落|无可奉告|惨跌|胆大妄为|约谈公司|停滞|传唤|私设|失察|歪曲|掏空|掩耳盗铃|寄生性|削减|违约案|杜撰|只字未提|暂缓|逆势下跌|实属无奈|不诚实|吹嘘|惩治|连累|赊账|蒙骗|密谋|鏖战|枯竭|受损方|欠债|不满情绪|隔靴搔痒|欺负|集权|停业|踩到|安于现状|掩藏着|引人深思|不良现象|浸染|可窥一斑|洗牌|诬陷|伙同|小题大做|串通|争斗|严阵以待|措手不及|议论纷纷|不正之风|自然灾害|融资难|比比皆是|逃过一劫|激怒|跌宕起伏|泛滥成灾|风雨飘摇|洗劫|赔款|失守|多头管理|露馅|失宠|失实|相悖|饱受|空头支票|遭殃|弃权|假借|蹉跎|徘徊不前|多灾多难|失密|责无旁贷|逼债|名存实亡|威慑|泄密|督办|不无关系|捉襟见肘|虚报|倾倒|污染|塌陷|功能障碍|心有余悸|贬低|高不成低不就|不义之财|吃老本|负担沉重|以次充好|吃回扣|大打折扣|恶意软件|怒斥|撂挑子|不负责任|拿回扣|漏电|迷失|有悖于|倒闭|浑水摸鱼|企图|不为人知|哄抢|阵痛|熟视无睹|悔之晚矣|反悔|尴尬|僧多粥少|过从甚密|紧随其后|于法无据|畏首畏尾|熔断|难以确定|眼花缭乱|蔑视|亏掉|诸多矛盾|攀比|处罚|陷于|负债|威胁|紧缩|自毁|赊欠|无法无天|骗人|瞒天过海|断章取义|挑衅|胁迫|被骗|脱节|敲警钟|急流勇退|不良影响|倒卖|控告|岌岌可危|破坏|触犯|万劫不复|荒废|屡见不鲜|忍无可忍|焦头烂额|孤家寡人|无关痛痒|苛责|不予置评|拒不承认|有毒|取缔|猜疑|抛售|曝光|营私舞弊|贻误|每况愈下|拆借|跌穿|害死|抵制|稍纵即逝|歪门邪道|垂涎|互不相让|一败涂地|拒付|污蔑|短缺|引起轰动|掺入|供大于求|挤掉|争执|摒弃|诘问|散布|瘫痪|注销|搏杀|呼风唤雨|存疑|藏污纳垢|店大欺客|吹牛|赔本赚吆喝|怠慢|套取|流年不利|拒不履行|倍受|缉捕|迫不及待|徒劳|忌讳|无所作为|篡改|无理取闹|捆绑|瞎了眼|居高不下|休克|抨击|缺斤短两|闹鬼|冻结|节外生枝|不良反应|避而不答|自认倒霉|避实就虚|塌方式|产生误解|饥不择食|网络攻击|督促|刁难|无人问津|制假|带帽|推卸|止损线|折半|滥竽充数|羞辱|生锈|掩盖真相|模糊性|凹凸不平|病入膏肓|调侃|伤亡|含糊不清|跌破|秋后算账|催缴|缺斤少两|失真|判决|信用卡诈骗|破釜沉舟|剑拔弩张|优胜劣汰|一筹莫展|见怪不怪|缺少|跳楼自杀|出人意料|群众反映|不制冷|抵债|奢侈浪费|坏账准备|造假|初犯|风云突变|四面楚歌|据为己有|轩然大波|难言之隐|抛出|越来越低|胡来|受害|历历在目|戛然而止|心存侥幸|治标不治本|不确定性|无形压力|醉翁之意不在酒|一去不返|另谋出路|泄露|分崩离滥用|逃不出|死而不僵|歉收|杜绝|偷梁换柱|讨说法|冲昏头脑|视若无睹|本末倒置|金蝉脱壳|敢怒不敢言|挂羊头卖狗肉|驱使|鞭长莫及|裂变|忧虑|烧坏|只字不提|惨淡经营|得逞|横行|起诉案|吓唬|无赖|二进宫|挣扎|背道而驰|咄咄怪事|杀招|不温不火|争议案|被盗|带来不利|裁员|卖不出去|毫不掩饰|捏造事实|被困|老冤家|趋之若鹜|掉队|矫枉过正|骑虎难下|滞销|一贯作风|不无遗憾|不相称|问题重重|清盘线|不良资产|告负|倒退|偏袒|对不上|千夫所指|吊销|警惕|众矢之|否决|蒙受|视而不见|出错|降价|闹着玩|侵害到|谈不拢|咬牙切齿|语焉不详|仿冒|罚没款|编织|言之凿凿|自杀|侵害|逃废债|两败俱伤|曲解|公诸于世|腥风血雨|假装|一穷二白|清仓|股抵债|恶化|歪风邪气|心灰意冷|强奸|悬而未决|殆尽|闯祸|诅咒|不利于|滥发|坑人|指控|违规案|欲罢不能|困窘|受骗|久拖未决|不堪重负|拆毁|阳奉阴违|不尽人意|混淆视听|不如人意|诱使|风光一时|机关算尽太聪明|抬价|抑制|墨守成规|强买强卖|大疗效|监守自盗|偷偷摸摸|搞不好|倒下|追偿|淡出|骑虎之势|逃过|出狱|缄默|崩塌|打砸|大相径庭|反驳|下泻|一意孤行|滞压|屡禁不绝|恐难|明目张胆|审查|坎坷路|玩弄|饥渴症|倚赖|暗含|召回|系统故障|传讯|逃逸|翻脸|凶多吉少|五花八门|染上|看不起|失去|不明朗|绳之以法|爆出|审核|舞弊|空谈|高悬|牟取暴利|僵化|逃避|售假|莫须有|闹心事|辱骂|大不如前|暗藏玄机|模棱两可|遮掩|告诫|匮乏|如坐针毡|控辩|滞后|一波三折|风风雨雨|责任事故|捏一把汗|摸爬滚打|仿造|食物中毒|吃不消|片面追求|着火|愚弄|下跌|跟不上|开炮|破损|揭短|窃密|瓦解|卡壳|防不胜防|披星戴月|停滞不前|令人担心|令人担忧|难避|反诉|逃脱|难上加难|不甚明朗|受到谴责|致命|遭受|怨声载道|沉沦|群死群伤|业主维权|声讨|动乱|不升反降|煽动|杯水车薪|得不偿失|难保|最低迷|揭露|赌钱|上当受骗|利欲熏心|伤害|炒作|认栽|被控|城门失火殃及池鱼|对赌|触目惊心|违规操作|冒进|血雨腥风|投机取巧|落败|僵持|舍本逐末|跌落|破罐子破摔|严禁|天网恢恢|撤职|过期|无起色|受制于人|恶劣影响|骤降|走投无路|灭顶之灾难以为继|毁损|谎称|使用不当|逃往|遭劫|明知故犯|背黑锅|一损俱损|大操大办|不良信息|引诱|遭到|职务侵占|冷嘲热讽|互诉|滑落|耍赖|贪图|谋私|嘲弄|功亏一篑|不予理睬|孤芳自赏|一跌再跌|杳无音讯|谣言惑众|依赖症|败露|堕落|刀光剑影\风起云涌|令人堪忧|逃废|野蛮|无人不知|扼腕|偷逃|牵制|坑害|势均力敌|发案|质问|火中取栗|妄图|敌视|误导|无动于衷|损公肥私|粉饰|颠倒黑白|朝三暮四|梦想破灭|无妄之灾|反其道而行之|查处|违章操作|失职|碌碌无为|苟延残喘|决裂|诱骗|低迷不振|骗钱|三令五申|唯利是图|株连|犯规|叫苦不迭|殴打|生不逢时|摧枯拉朽|剥削|一毛不拔|敷衍塞责|违背|见不得人|相撞|栽赃|一波未平一波又起|深恶痛绝|扣押|血洗|主观臆测|包庇|潜逃|不伦不类|暂扣|不利因素|失当|推来推去|知情不报|捕风捉影|拆除|沦落|作假|临危|延误|骤减|力不从心|歇业|触礁|意气用事|涉案|偷走|不能自拔|严惩不贷|遏制|大吃大喝|置之不理|没理由|戏谑|失序|无力回天|欺负人|拒不执行|失约|勾结|明枪暗箭|黯然失色|难以实现|遭证监局|远不如|不可为|走下坡路|强迫|公开批评|承受不住|志不在此|欠缺|躲避|失款|变速箱异响|横生枝节|大起大落|过于自信|受灾|掺杂使假|倒数|鼓吹|做空者|成为泡影|闹事|兴风作浪|踌躇不前|风马牛不相及|剽窃|烧毁|背弃|不止一次|过街老鼠|严厉打击|缩减|唇亡齿寒|烟消云散|盗取|名噪一时|坐视不理|挪用|本来面目|挖空心思|打伤|讹诈|恶劣行径|欺行霸市|盗卖|索债|不合逻辑|搞垮|严惩|有章不循|空中楼阁|以假充真|起疑|不怀好意|原油泄漏|停业整顿|满目疮痍|不领情|妨害|明文禁止|擅自决定|生活作风|颇为费解|透支|查扣|分道扬镳|大失所望|蒙在鼓里|养尊处优|减产|积重难返|捏造|浅尝辄止|匪夷所思|明争暗斗|自杀身亡|通不过|销毁|回击|黄牌警告|无所不用其极|耍流氓|天方夜谭|难逃法网|供过于求|无耻|勒令|沦为|无影无踪|缺乏|盗版|外泄|再降|处以|崩溃|不可告人|受潮|时间延迟|盘剥|责罚|下挫|欺骗|难以置信|无心|亵渎|拖后腿|发生意外|避而不见|当之无愧|碰壁|成瘾|受伤|削弱|东施效颦|一泻千里|重蹈覆辙|波动大|吹捧|染指|引爆|怀疑|硬着陆|严厉批评|栽跟头|受塑化剂|警告|自顾不暇|侮辱|担忧|喧嚣|通报|冒用|失之交臂|玩味|摸不着头脑|大肠杆菌|惩处|倒挂|减负|无中生有|蛮干|失衡|不理不睬|无利可图|窝里斗|衰退|拒之门外|出格|作祟|压垮|情绪化|违规|开展调查|死路一条|骇人听闻|忧心忡忡|杀一儆百|挤压|企业破产|暴露无遗|鱼死网破|拖累|牢狱之灾|免不了|我行我素|纠缠|说大话|敲诈|催促|冒名|别有用心|避重就轻|连锅端|陷害|毫无诚意|推拖|在劫难逃|摧毁|纠结|揭穿|受灾害|扼杀|损毁|避而不谈|阻挠|变质|爆料|折戟沉沙|当头棒喝|编造|蒙蔽|过河拆桥|操之过急|半停产|盗运|执法不严|肆意妄为|渎职|膨胀|谩骂|事不过三|令人气愤|剥夺|操纵|结党营私|降职|周转不灵|欺瞒|抱怨|形同虚设|纵容|混战|诱惑|出师不利|冷清|加重|倒买倒卖|强烈不满|制约|滚蛋|狂跌|偏离|形势严峻|羁押|拔苗助长|得罪|不强|恶化趋势|追捕|急于|人人自危|恶性事故|拖欠款项|争斗不休|贪官污吏|狂泻|蒙混过关|背离|上当|排污水|欠妥|获罚|挤兑|难以预测|闪烁其词|暗藏|自毁前程|燃眉之急|困难重重|扭曲|谈崩|罪魁祸首|不当得利|恶性循环|严重不足|欲哭无泪|顺手牵羊|严重损失|杀熟|悔恨|车身锈蚀|恶搞|专利案|巧立名目|下落不明|玩不转|拷问|排挤|赔偿损失|于事无补|冒充|自欺欺人|有恃无恐|抽紧|一团乱麻|忙中出错|不计后果|暴打|透水事故|劣质装修|甲醛超标|爆燃|中毒|面板爆裂|售后不保修|拒载|交通事故|沙门氏菌|挡位缺失|气囊隐患|自燃|轮胎鼓包|电池容量不足|漆面起泡|内排水处生锈|吃出蟑螂|用过期肉|过期食品|发霉|二氧化硫超标|霉变|长毛|镉超标|苯超标|吃出虫子|假奶粉|夸大疗效|盗刷|信用卡违规套现|转贷倒贷风|非法买卖银行卡|不良贷款增加|信用卡管理漏洞|飞单|贴息存款|恶意骗贷|快捷支付曝重大漏洞|存款失踪|洗钱|存款莫名消失|信用卡恶意透支|信用卡预授权漏洞|诽谤|不实之处|蓄谋|损坏|后劲不足|人浮于事|凶猛|赔本生意|矢口否认|归咎|逃不了|违反|唱反调|阴魂不散|关押|失势|犹存|离奇失踪|滋生|围堵|退保|割据|不惜成本|自相残杀|无能为力|错配|牵涉到|慌不择路|漏洞百出|折价|恼火|因小失大|时过境迁|窝藏|利诱|巧取豪夺|千疮百孔|深不见底|付出代价|土壤污染|冲突|含糊其辞|奈何|漏水|你死我活|失利|虎视眈眈|耸人听闻|一家独大|陈诉|戳穿|以罚代刑|漠视|践踏|锐减|惹恼|逾期|有失公允|破灭|痛失|脱离|失准|尾大不掉|批判|争权夺利|一拖再拖|隐瞒事实|扰动|逃跑|突袭|事与愿违|惩戒|不足之处|拉帮结派|有损于|漂洗|不为所动|谨小慎微|违犯|严查|涉嫌|凋零|揶揄|盗窃|闻风丧胆|不胫而走|引以为戒|认错|藐视|微不足道|甚嚣尘上|人心惶惶|站不住脚|污水排放|讽刺|虚夸|鱼龙混杂|勾兑|罢免|供认不讳|接受批评|苦不堪言|暴跌|忍气吞声|敲响|害苦|阉割|猜测|商标案|短斤少两|制裁|众说纷纭|错误操作|退赔|退赃|迫近|推诿|费尽心机|疑惑|有损|口诛笔伐|良莠不齐|操纵者|控诉|龟裂|涉嫌人|单打独斗|难兄难弟|退货|讳莫如深|脱离群众|剪不断理还乱|暗度陈仓|厚此薄彼|贪图便宜|践诺|陷落|裙带关系|逃不过|敷衍了事|失信|监禁|言行不一|有禁不止|无异于|沆瀣一气|瞒不住|下有对策|受到牵连|受制于|遇挫|行骗|铺天盖地|火上浇油|非一日之寒|猝死|盛极而衰|弄虚作假|堕入|抗议|苯泄漏|提出异议|斥责|不明真相|不得人心|置若罔闻|首当其冲|停职|偃旗息鼓|顾此失彼|搁置|掩人耳目|作罢|敲诈勒索|打压|惩罚|贬损|败落|撤诉|嘲讽|抽样检查|唆使|灰飞烟灭|呆坏账|釜底抽薪|众矢之的|高溢价|八竿子打不着|延宕|裹足不前|激化|强占|累犯|还债|勾兑门|糊弄|逆市扩张|脱不了|拘押|不可思议|山穷水尽|侵吞|排污|骚扰|日薄西山|寸步难行|烧伤|失踪|一厢情愿|不能偿还|转危为安|弹劾|对垒|鸡飞蛋打|掺杂|泄漏|非法活动|争执不下|避嫌|损害赔偿|克扣|不明不白|变卖|时运不济|撒谎|居心不良|以权谋私|华而不实|急功近利|拖欠工资|措施不力|搪塞|一无所知|倾家荡产|驳斥|讨债|政企不分|大跌|侵犯|拒不接受|进退维谷|枯死|夸大其词|葬送|褒贬不一|如履薄冰|蒙受损失|滋事|受创|冒顶|顾虑重重|底气不足|盗用|以假乱真|诋毁|觊觎|裹挟|九牛一毛|唇枪舌剑|过激|下坡路|进退两难|失误|反目成仇|另有隐情|狡辩|偷窃|失调|未能幸免|谎报|严肃查处|一纸空文|断档|各执一词|纯属捏造|挥霍|罚没|进行批评|日益严重|捉摸不透|免职|泄露信息|隐瞒行为|下滑跌幅|无法重组|同比下跌|被“吓”停牌|遭遇政策收紧|违约问题|遭拒赔|上市公司违反|调查波及|假跨界|净利润预减|披露不准|业绩预降|屡次失信市场|呛声|拖欠年终奖|开展深度自查|被市场禁入|陷入穷途|遭深交所监管|受投资者质疑|陷摘牌危机|降负面|遇毛利挑战|被搁置|遭新主“举牌”|深交所谴责|被转走|被操纵|利润减少|濒临“生死关头”|踩钢丝|遭媒体质疑|接关注函|遭转让公司或易主|被问询|前景未明|被指藏|遭剿|代表人失联|遇重挫|遭上海证监局处罚|产品违规|遭业主吐槽|战略受挫|未披露|再跌停|遭占款|连年下跌|同比“腰斩”|存蹊跷|下调年度预算|遭冻害损失|一切存疑|黑洞"|陷多元发展死循环|著作权迷局|涉嫌股价|追问合规性|遭证监会四点质疑|遭者冷遇|遭上交所问询|债务逾期|销量暴跌|被挤出|被动|致退市风险陡增|掩关联交易|上交所追问|业绩“大变脸”|致损失|受质疑|遇难关|炒作伤身|同比预减|不敢恭维|被小股东训斥|涉嫌违规停牌|再次下滑|遇瓶颈|盈利模式堪忧|被减持|存较大差异|业绩大变脸|违规占用|涉嫌造假|ipo中止|掩背后隐忧|盈利下降|被按“暂停”|国有资产流失|大额透支|涉选择性披露违规|保壳危情|公司受累|遭上交所严问|终止原因各异|仍然失联|披露违规|向证监会举报|涉嫌误导性陈述|重组又悬|引分歧|陷入资本迷阵|遭政策“嫌弃”|存虚高问题|遭集体违约|违规增持|圈钱|遭禁|披露不完善|超标排放|收益为负|立案调查|负面评级|净利润降低|涉欺诈|“惯性”下降|终止资产重组|断崖式下跌|曝调查|终止定增计划|被重点监控|被点名|乱象频出|涉洗黑钱|严重警告|遇危机|遭上交所发函关注|停牌核查|引深交所发函|有致癌风险|业绩持续下滑|长期低迷|被质押|严重违规|环保黑名单|责令改正|受拖累|连续下滑|陷入泥淖|披露不严谨|受自律监管措施|流向不明|遭遇平仓线|披露再触“红线”|遭证监局警示|被退市|又违规|两年下滑|遇“李鬼”|再次折戟|募债违约|隐瞒股权信息遭|已踩雷|不走心|被深交所出具|利润持续下滑|存退市风险|冻结股权|净利为负|遇“黑天鹅”|被强制|影响负面|持续盈利存疑|被否决|遭股转|持续发酵|销量不振|ipo失败|变相裁员|遭多方质疑|重组无望|被指粉|违规停牌|检出瘦肉精|资源违规|遭“封杀”悬疑|需求不振|被限制|监管“警钟”|受灾严重|仍未披露|被实施|净利大跌|被离职|隐瞒重大纠纷|大幅下降|被抛售|持续下滑|恐打水漂|警示风险|存风险|涉嫌重大遗漏|未兑付|涉嫌虚假|违规处罚|有猫腻|净利润狂降|客户存疑|被拒交|地雷业绩|被监管约谈|仍存疑|遭强制停牌|违规受罚|被投诉内幕交易|纰漏频出|质疑平台资质|被假冒销售|被追问|前景难测|引争议|费用存疑|被“祸害”|净利预减|暂停股权转让|信披“冰山一角”|遭遇过山车|证监会终止|被警告|飞蛾扑火|开撕|被质问|被通报|被发改委|遭监管关注|败诉赔偿|净利下降|双双下滑|股权纷争|耍赖皮|引监管层|公司受罚|合计罚款|曝家丑|遭上交所监管关注|企业超标|联合质疑|风险陡增|引后患|被质疑|濒临退市风险|动荡伤元气|被停牌|严重侵害|大幅下滑|被银行挪用|遭交易所问询|违约事件白热化|再画饼|著作权谜局|遭冷遇|接“烂摊子”|同比减少|披露不详|保壳|被消费殆尽|曝财务内情|分红违规|追问原委|销量减少|编制错误|离奇暴增|计划泡汤|被问责|被拆伙|存“易主”风险|中绩倒退|吊销保荐牌照|土豪操纵|恶意交易|疑躺枪|后市无望|遭“不测”|重组面临夭折|被取消|被冻结|沦为“鸡肋”|埋下祸根|遭“暂时性”否决|遭集体“换血”|遭拘留|再度爆仓|几近腰斩|曝全面停摆|前景存疑|被证监会否决|上演“拖字诀”|回归无期|陷危机|奇葩年报|业绩低迷|信批违规|沦为空头支票|终止交易合规性|踩雷借壳新规|涉偷梁换柱|连续巨亏|ipo大事不妙|散发着异味|受到警告|股东闹架|利润率不足|强制关停|本息违约|被揭穿|被调至负面|被罚逾|交易存疑|存违规行为|强制停牌|遭弃|演绎骗局|风险暴露|低迷倒逼转型|防卫过当|利润直降|违规购买理财产品|涉嫌内幕|净利润减少|警示退市风险|存占资问题|被“玩坏”|毛利率降|被替代|巨款失踪|带伤闯关|披露重大诉讼公告|最败家|股民举报|沦为“皮包公司”|受纪律处分|遭查封|产业泡汤|安装工为假冒|重组“流产”|遭上证所问询|陷入寒冬|盛世中断|股价操纵|受猛烈冲击|曝票据大案|被无视|全面疲软|过于凶猛|取消挂网|亏损加剧|重拳出击|违约陷囚徒困境|业务违规|已断裂|有“可恨之处”|市值梦碎|耗巨资返工|潜藏利益输送|公司躺枪|终止上市|曝风险|保壳困境|重组折戟|撤销背后内幕|净值暴跌|被挂牌|提示风险|经销商质疑|遭上交所通报批评|涉关联交易|难以持续|下发监管函|遇"瓶颈"|遭清洗|被曝不合格|深陷督导泥潭|下发关注函|暂停上市|频频折戟|风暴来袭|被重罚|产销降|露出致命缺口|涉短线交易|被罚款|被交易所问询|被挪用|大幅变脸|致应收账款大增|中毒事故|暴增幻象|业绩大降|曝光违反|资本入侵|被漠视|陷入窘境|投资浮亏|存多处疑点待解|被出具|已违约|受拷问|普遍预亏|遭下调|被风险提示|违法罚款|同期下降|存暂停上市风险|违约地雷|披露不准确|违法成本|负面行为|被上证所|违规托运危险品|被轮流冻结|违规涉|遭疑|被自律监管|遭监管层警示|被立案|违反企业文化|被勒令|受冷落|净利降|频发罚单|净利大降|引质疑|被st|遭深交所关注|被疑|被证监会调查|收入下滑|违规建设项目|重组效果打折|ipo痛点|赔偿不披露|失败告终|受挑战|下滑收购|营收下降|采取自律监管措施|引深交所问询|连环违约|严重失误|逆势下滑|涉嫌虚报采购|调至负面|被降级|涉嫌违反|被罢免|涉嫌泄密|遭“爽约”|单独起诉|净利腰斩|未信披|陷入票据风险|被责令|涉嫌吃空饷|涉事企业|违约投资人|重组上市|违规相关责任方|遭处罚|遭监管|被监管关注|处罚落定|项目暂停|暂停受理|被深套|违规开户|被追刑|被置换|遭投资者吐槽|存多种违规|重组均告失败|下跌风险|被埋怨|风波来袭|不足半年|受处罚|被调整|整体遇冷|负面舆论|隐瞒半月|妖股|遭股权|强制回购|严重侵权|项目折戟|终止疑团|遭证监会否决|已立案|陷欠债风波|业绩疲软|遭重创|遭拷问|涉嫌骗|现金流为负|遭局方处罚|披露不充分|主业低迷|牵出财务混乱状况|败家半年报|陷入亏损|疑问迭出|竟然“跑路”|存市场风险|被券商否认|被降为|遭暂停|沦为“违约王”|受谴责|泄露成谜|上市公司遭罚|持续拖累|违约风险|遭转让|遭补卡诈骗|谴责处分|无视合法提案|存货攀升|业务缩水|披违规|引爆纷争|相继陷入|产业艰难|被罚没|断崖下跌|双双巨亏|违规资金占用|深陷困境|曝内幕|遭泼冷水|被人举报|遇寒冬|连续“踩雷”|被交易所公开谴责|存“水分”|隐忧加剧|被玩坏|违规交易|遭自律监管|“卖壳”悬|虚增存贷款|销量骤降|追问跨界风险|遭司法冻结|非法截取|吹捧门|年报错误|陷财报危机|现象严重|在造假|频现违规|质疑董事会表决|资金冻结|遭搅局|净利减少|减少坏账准备大增|被否转型落空|被警告处罚|受行业|同期减少|被决定|遭狸猫换太子|被停用|重组困境|举报海外投资|受监管关注|存伤亡隐患|被证监会捅破|加速下滑|事故频出|滋长|坠毁|衰竭|赔掉|姑息|概不负责|情况严重|误传|应负|依法追究|放纵|一知半解|难以获得|郁积|一屁股债|出毛病|擅自改变|不明智|近墨者黑|以劣充优|被打乱|贪大求全|策反|撑门面|日趋严重|慢性伤害|刻舟求剑|不思进取|无稽之谈|草草收场|判处刑罚|毫无准备|依法取缔|轻敌|曝露出|束手无策|借题发挥|怨恨|不进则退|骗购|不值一提|打官司|解决不了|直言不讳|孰是孰非|不近人情|诱发|依法惩治|群龙无首|自诩|隐讳|抄袭案|作死|怯懦|不胜其烦|毁誉参半|跑官|一无所有|无法弥补|吵闹|信口开河|以讹传讹|迫害|付之一炬|要挟|拆台|经不起|纸醉金迷|黯然神伤|纵横捭阖|缓期|知难而退|恐惧|可诉讼|令人大跌眼镜|摇摇欲坠|没有勇气|丢卒保车|惊吓|刑事追究|劝诱|参差不齐|独木难支|为所欲为|猴年马月|痴人说梦|越俎代庖|挫败|从严处理|表示歉意|满盘皆输|催讨|依法打击|不切实际|勾心斗角|拖泥带水|臭名远扬|渔翁得利|无可挽回|险象环生|造谣中伤|不起作用|不可同日而语|平抑|无缘无故|非法所得|补亏|发泄|不利|破财消灾|充耳不闻|杳无音信|始料不及|冒犯|无故缺席|不知所措|垂死挣扎|急不可待|确凿无疑|不屑一顾|殚精竭虑|抱佛脚|远水解不了近渴|不寒而栗|捣乱|不白之冤|深感不安|误入歧途|臆想|模糊不清|痛定思痛|毁谤|无从下手|轻举妄动|串通一气|深表歉意|躲过一劫|产生矛盾|财政危机|同仇敌忾|义愤填膺|朝不保夕|疏忽大意|困兽犹斗|欺诈案|先天不足|如鲠在喉|望风而逃|分赃不均|咎由自取|公私不分|无济于事|不择手段|确凿证据|另起炉灶|短斤缺两|断送|无地自容|惴惴不安|屡试不爽|降低成本|不当之处|无原则|群情激愤|提诉|严厉查处|一查到底|乱了阵脚|受到冲击|利令智昏|猝不及防|放荡不羁|全盘否定|定责|胳膊拧不过大腿|遏止|争论不休|出庭作证|后果严重|鹿死谁手|败也萧何|违章|乱七八糟|担惊受怕|查办|卖假|哗众取宠|赃款赃物|互斥|逍遥法外|赖账|有过之而无不及|搅乱|贪污贿赂|疲于奔命|节节下挫|寻衅|各罚|气势汹汹|滞缓|玉石俱焚|嗤之以鼻|奇耻大辱|紧逼之下|坑骗|厚颜无耻|危及|提出抗议|粉墨登场|不守信用|是非之地|挥金如土|铁超标|恣意妄为|毫不相关|大动干戈|害群之马|相互指责|心急如焚|无计可施|拨乱反正|独断专行|大言不惭|稍有不慎|不认账|混淆是非|急不可耐|触犯刑律|溃于蚁穴|引咎辞职|举棋不定|有案必查|令人瞠目|谢罪|不良后果|偷逃税|移送起诉|待查|弱不禁风|身败名裂|威吓|水火不容|愤愤不平|来路不明|被双规|含糊其词|粗制滥造|吃哑巴亏|抗诉|可判|追赃|查案|同流合污|后顾之忧|虚心接受|滥用权力|连篇累牍|空穴来风|事不关己|辩驳|抗辩|票房跳水|面临司法拍卖|双双离职|影响投标|面临困境|融资怪现状|面临变更风险|降评级|陷入大额亏损业绩|不严谨|涉嫌误导性|骗补企业现状|多方受罚|客户“大换血”|重组风险陡增|标准缺失|排污超标|伤害消费者|公司停产|低迷倒|未兑现|重组委“大开杀戒”|管理失责|领深交所关注函|污染风险|被揭|被连夜提示|业绩大跌|骗补|行业遇挫|难返|惨遭小股东“打脸”|投资者的毒药|资金短缺|难题待解|断货危机|收到监管关注|大幅亏损|高层失联|披露前内部人增持|被迫关张|持续萎靡|取消整车资质|全面停产|影响业绩或作弊|违规持有|存在突出环境隐患|连年亏损|被指粉饰|疑点待解|股权迷局|意见不一|被资本玩|做市违规|离奇失联|被*st|急发风险|盲目施救|亏损资产|诉讼未决|经营压力|不规范|财富大蒸发|退市风波|遭欧盟“封杀”|数据“打架”|违规买卖|转让纠纷|拖字诀|同比大挫|业绩“失诺”|拒交表决|均反对|交易疑云|无法报牌|交易减持|下滑趋势|无法解决|严防资本|投资风险|被责整改|投诉分析报告|现重大利空|收到证监会警示函|违规予以|逆势涨停|套现失联|遭美国标普降|引发交易所追问|沦为st|摘牌危机|不交代|减持违规|被查出|经营停摆|涉异常交易|借壳上市受挫|业务纠纷|应收款风险|物料超标|监管约谈|收购迷雾|用途不详|股东反对|面临产品匮乏难题|市场整体遇冷|被证监会行政监管|逾期担保|高管离职|曝光涉事企业|亏两季度|战略碰壁|减值隐患|租赁纠纷|上交所处分|质量告急|高度依赖|净利双下滑|状态不明|连遭监管关注|库存难销|购销存疑|面临夭折|债权人“围剿”|“严重超标”排放|拖薪保壳|追刑责|研报监管|疑卷入|陷重组困境|痼疾待治|不断发酵|危机发酵|撤销股东会决议|数据之谜|成长存疑|风控压力|ipo造假|气囊缺陷|遭竞争对手|违约王|失踪理财款|违规情形|现“双降”|深陷亏损泥潭|自查风暴|降级风险|重组疑问迭出|现利空|虚假承兑业务|卖公司|不合规|介入调查|拍卖纷争|股民单独起诉|调查事件|难掩|闹乌龙|净亏|追问背后隐情|问责|巨额债务|巨头裁员|资产风险|提案无效|能力存疑|不守信|未投保|面临退市风险|预告大变脸|信披病|难成行|归属存疑|被关停|不“踩雷”|有隐患|股价波动|无视股东利益|遭遇行业冬天|收入之谜|求生扭亏|遭ipo中止|很尴尬|倒查罚单|危局待解|面临破产|难撑|企业绩变脸|收购案争议|系统监管|配售违规|未有效|未获通过|放弃重组|虚报采购数据|被曝拖欠|未计提相应预计|遭遇“变数”|难逃st厄运|终止疑团难消|严重开裂|疑存关联交易|诉讼纠纷|减少坏账|文化跌停|违规购买|难收回|领监管函|存在退市风险|业绩硬伤|又悬|被指借|预减公告|未通过|证监会发飙|标的去年亏|隐瞒卖壳关键信息|被假冒|遭自律|爆兑付危机|无人接手|疫苗事件|事件发酵|盈利承压|财务恶化|品牌全线溃败|集体“沦陷”|股价承压|对抗监管|违规套现|爆炸事故|企业黑名单|断裂风险|负面舆论难以自拔|暴增盈利画饼|遭渠道联合抵制|异议之争|实控人疑团|冰山一角|文字陷阱|交易风险|大幅转亏|未获支持|现负增长|大幅跳水|涉嫌“误导性陈述”|辞职埋单|纷争频遭|股价恐承压|收到《监管关注函》|加速逼宫|收到上交所问询函|不良贷款|事项遭否|未获成效|不按套路出牌|未予置评|模式终结|恐起|“炒股”亏|整改信披问题|虚列劳务费|欠薪事件|吃紧负债|涉嫌侵害|下游疲软|停牌病|疯狂的内幕|兑付风险|挑战重组|炒股亏|遭股权冻结|业绩亏损|违规办理|遭遇强敌|收到年报问询函|控制违规|资产负债率骤升|消费投诉|被投诉|点名通报|引监管问责|减持股份|支持诉讼|紧急套现|多起诉讼|现金流断裂|再起风波|业绩“蹦极”|盲目买入|核查风暴|不及预期|巨头亏损|不作为|纠纷诉讼|超标企业|股东发难|资产成谜|互撕|存“霸王条款”|被召回|发案疑云|紧急关注|债务危机|违规使用募集|紧急叫停|项目投产后亏|存信息披露问题|内部“大换血”|结果难料|私自挪走|财务猫腻|存在重大缺陷|否认涉案|股东遭罚|“自酿”兑付|反而亏损|超标上黑榜|防恶意收购|违法不断|现双版本|纠纷不断|不再经营|股价受罚|披露大变脸|经销商逼宫|涉“骗”|举牌乱象|被上交所点名|“遭禁”危机|否认借壳|获立案|毛利率奇高|已浮亏|面临更严审核|被发改委罚|未解决|追问终止|面临双重考验|支付存疑|无奈收缩|投研乌龙|高管辞职|遭深交所追问|巨额处罚|私募风暴|不公布|卖自家人|风险事件|难言胜利|绊脚石频现|信托风险|存在问题|现“后遗症”|未申报|收到证监会调查函|未按期进行|寄生式|陷盈利困局|难兑现|追问跨界|退市影响|涉嫌虚报|经销商纠纷|仍旧存疑|集体离职|涉嫌超额申报|易主受阻|收到警示函|不兑现|爆分析师“吹捧门”|疑云重重|信批监管|毛利率之谜|重重疑点|注销跑路|财务数据存疑|停牌一天|违规倒查|媒体曝光|无法绕过|模式遭遇|采取“连坐制”|遭上交所|转让疑云|暂停上市风险|面临“生死时刻”|增速放缓|难闯关|太坑爹|陷入全面疲软|卖子公司|纠纷曝光|监管关注|遭遇滑铁卢|面临资金压力|无法获知|净利重挫|监管层关注|业绩危机|逆势增长|严重失实|碰监管红线|逾期债额扩大|卖股还债|展望为负面|背后乱象|失信市场|缘何搁浅|有害物料|遭河南证监局出具|重组之路成谜|遭司法拍卖|狂降|年报疑点|恐成|环保阴霾|重组资产虚幻|艰难前行|此前卷入|闹“乌龙”|先行赔付|领罚单|被责令整改|品牌泛滥|被关联方占用|涉嫌虚增|股民索赔|收到深交所监管函|舆论漩涡|陷保壳困境|被辞|沦为“违约”|过度倚靠|集体泄密|虚增营收|多道重组|陷债务|无法提现|受累市场弱势|数据异常|逾期贷款|企业索赔|政策风险|受豪赌重组拖累|质价不符|上市存疑|影响后市|遭罚|方案流产|警告信|尚存变数|品牌巨亏|无法可依|未履行|产业整合困局|减值损失|“闹剧”监管|中报地雷|悬念待解|拒背黑锅|不良率|疑遭|现金流危机|遭证监会询问|成长乏力|行业不景气|未完成|遭退|半年度亏损|亏损存退市风险|炒股巨亏|遭中小股东否决|架构巨变|减持股份预案|超预警线|不符合|问题频现|风暴升级|控制权之争|市值坍塌|拒交财报|暂停交易风险|违背承诺|发函追问|股东践约|股东折价|终止定增方案|陷疑云|系统处罚|销量困局|公告减持|陷入三国|多处疑团|面临成长瓶颈|下滑严重|无法履行|遭遇“脚”投票|股价大跌|投资巨亏|终止挂牌|举报直指|客户起诉|难言顺利|难获赔|几乎一切存疑|涉骗|恐生变数|不正当|翻脸证监局介入|退市风险|生死状|章程闹剧|投诉内幕交易|涉案资金|交易监管|董监高辞职|存在难点|假冒销售|难解困局|陷转型困惑|怒告券商|追问关联交易|关停转让|被强行平仓|遭遇“老套路”|终止收购|“黑天鹅”频现|单一产品|巨额占款|再亏|净利亏损|难增利|开局告急|违规提前使用|千万坏账|被深交所监管|设备直接损失|证监会处罚|共亏损|引发市场疑虑|反省不足|预警亏损|存在较大不确定性|难翻身|违规遭罚|竭力否认|疏漏补偿|持续增长存疑|“评级”存疑|未公布|停水事故|严禁入市|首降|市场禁入|账户存疑|净利润大跌|违规非经营性|面临“下课”风险|诉状牵出|遭“封杀”|未按规定|面临困局|现笔误|遭刨根问底|掩转型困局|拖欠工资房租|被贷款|业务堪忧|信披存瑕疵|尴尬局面|利润惨淡|被冻|连亏|失信“大户”|殃及担保人|黑名单激增|摄入致癌|配售黑名单|屡遭警告|逾期归还|不及时|予以监管关注|“裁员”事件|负面消息|环保问题|重组“夭折”|难“解渴”|资金占用问题|遭一董事反对|面临诸多难点|再曝光|资金“饥渴”|股权争斗|不接受|引玄机|占用资金|被检农残超标|不认同|遭“黄牌”警告|问询函|半年报蹊跷|虚假资料|梦想落空|追问未披露|股东公开谴责|严重生锈|易主梦碎|业绩突变|影响利润|导致食言|被限期整改|利润“蒸发”|引出扑朔乱局|年度亏损|违反减持承诺|状况频出|不承认|用途不明|不全面|再折戟|仓式减持|董事长套现|消息缠身|破净|未备案|不足遭批|惨遭股东|拖延增持|互相打架|业务巨亏|引发债务质疑|难以扭转|能力不足|遭批|惨遭股东抛弃|危在旦夕|被提示风险|财务数据有异|采取监管谈话措施|能力薄弱|监管“寒流”|战略难以为继|疑陷|撤资风波|定增遇阻|并购后遗症|逃债无望|存三大隐患|恐陷股权争夺大战|游戏梦碎|被处|罚单|连遭警示|存监管风险|不规矩|处罚升级|暴露制度缺陷|紧急问询|集体请辞|存卫生安全隐患|市场承压|“寒流”袭来|隐患升级|控制权隐患|业绩大亏|陷入忧患|清仓式减持|频繁停货|惹怒|创新力存短板|主业荒废|非理性竞争|资产流动性低|资金运用不健全|管理违规|销售违规|财务费用违规|未退运费险|不支付保险金|买成保险|回避风险|成了买保险|赔付不到账|拖欠理赔|瞎办保险|与赔付不符合|拒绝理赔|没收回保金|不给机动车保险证|复效困难|保单永久失效|拒绝赔付|得不到理赔|索赔无果|不开定损单|拖延理赔|运费险不给退|解除保险|不退还保险押金|存钱成了保险|没有理赔|拿不到定损单|隐瞒费用|理赔复杂|不到账|理赔慢|保费强行翻倍|不给赔|理赔艰难|不理赔|不能全额赔偿|没赔|不能理赔|代我签字|骗取保金|匿病投保|化名就医|要员工购险|保单门|变成买保险|无扣款通知|无保单|拒付返还金|公意险缺陷|存款成保险|取消保险代理资格|索赔无门|鸳鸯保单|赔付难实现|假理赔|假航意险|假借保监局|医保案|理赔案|被签名|没赔付|保单过期|孤儿保单|没法续保|银行内卖保险|保费说成存款|搭售保险|保单不能退|巨额保险|保费骤增|银行卖保|违约购买|保无故失效|多收保费|超额承保|不受理|天书保单|地下保单|骗贷|通融理赔|吃单|保险饭局|账户缩水|拿不到保险金|诈保|没有如实告知|保障单一|未告知是保险|赔付率低|伪造保单|没法赔|骗得赔款|被代签|保单有假|拒付保险|赔偿案|拒绝支付|被保险|变成了保单|延期给付|延迟支付保险金|退还保费|违反投保程序|赔付存在问题|虚列|没有告知|错误介绍|额外利益|不给赔付|大闹保险公司|骗取高额保险|高额退保手续费|存款变生命人寿|虚假病史|骗医保|编造病史|不想再投保|承诺投保人合同外利益|违反保险法|虚构团体|擅自变更条款|假保险|虚增保费|血汗钱变太平洋保险|存款变国寿保险|数据不真实|医保卡被停用|医保卡被冻结|保单存误导|孤儿单|保单无人跟进|虚假社保|无法获理赔|拒保|不想理赔|享受不到|保险不管|拒绝退还|被逼买保险|理赔烦恼|不能刷医保卡|不刷医保卡|莫名成保险|损害参保者|骗取医保|医保卡成提货卡|变成了保险|理财产品变保险|强推保险|虚假列支佣金|代签名|虚假投保资料|解释不明确|自行扣款|强卖保险|不能赔|保单未生效|理赔逾期未支付|冒充投保人|保金未追回|伪造保险票据|误买代理费高|无法理赔|生效后再上路|修改保单底联|费率下滑|高保低赔|减保|寿险市场惨淡|索赔率上升|偿付能力不足|炒停|偿付能力严重不足|假费用|假业务|虚挂|银保乱象|银保挤兑|非法套取资金|截留保费|保监会通报|涉及保费|团险业务违规问|定损标准不一致|保单失效|保险被套|保险损失|存款变保险|误买保险|诱导投保人|虚构代理业务|阴阳保单|假签字|回访超期|产品结构不合理|退保纠纷|存款变保单|收不到保单|保单无人管理|退保困难|办案无故拖延|欺骗销售|抬高交强险售价|虚增营销员|拒绝赔偿|虚挂业务员|骗取保险|回访违规|不给予理赔|套现|骗保|骗卖|资金去向不明|假保单|理赔纠纷|押金退还难|虚列套费|诱导推销|代签门|骗买|套取费用|非法保险中介|理赔给付纠纷|拼凑保单|虚假承保|险企资产流动性低|虚假赔案|取消代理资格|挪用保费|侵占保费|保障能力不足|不说明拒赔理由|拒赔|理赔过程不透明|理赔资料繁多|定损差距大|理赔尺度不一|惜赔|拖赔|费率不公平|费率问题|不如实告知|不进行风险提示|存单变保单|销售误导|误导投保人|理赔难|理赔金额少|虚列中介业务费|到有效保障|不予理赔|保险单遭质疑|虚假理赔|不赔|编造保险|诱导投保|高收益陷阱|保费侵吞|没理赔|不够赔|保险诈案|被续保|保险合同被终止|虚假住院|未给乘客上险|不予赔偿|被失效|套保|存款变新华保险|夸大意外险|停保|最富低保户|被劝退|存款办成保险|假赔|骗领保险|仍未明|“断崖式”下滑|巨额补贴|涉嫌刷票|有霉变|未覆盖|“双头”之争|补贴的诱惑|ip纠纷|乱局频生|难根除|牛散夺食|幽灵场|内控不善|引发行业震荡|采取责令改正措施|遭伙伴罢免|趴窝|责令增加|被停工|批次不合|自食恶果|“闹”离婚|批次不合格|原因仍未明|遭遇“断崖式”下滑|态度说变就变|内控八面漏风|投资踩雷|名声差|持续亏损|方案遭否|未及时信披|地位濒危|巨额电费纠纷|股权冻结|减持公司股票|资不抵罚|业绩大倒退|被上交所问询|揭示风险|被行政监管|大做文章|公诸于众|出卖|战战兢兢|轻慢|一去不复返|聪明反被聪明误|听天由命|掉以轻心|不灵敏|半途而废|怜悯|踟蹰|迷惑不解|勒索|不予承认|不符实|易沾污|添麻烦|雁过拔毛|毛骨悚然|遭袭|树欲静而风不止|自查自纠|杀气腾腾|溃散|逼出来|心有余而力不足|变味儿|趟浑水|毋庸赘述|令人不安|寻衅滋事|无证照|初见端倪|难觅|一带而过|一着不慎|造谣生事|打砸抢|不堪|偷天换日|有苦难言|招摇撞骗|偷运|为富不仁|来者不善|训斥|欺压|忍俊不禁|捉拿归案|死心塌地|不速之客|法网恢恢|对着干|严重困难|排山倒海|情况不明|触怒|岿然不动|马失前蹄|违反纪律|不平则鸣|刀俎鱼肉|不可救药|黑材料|天有不测风云|警钟长鸣|冷眼旁观|有违常情|迫不得已|追踪调查|无用武之地|费尽周折|沾亲带故|有腐必反|毁于|制造矛盾|反复无常|犯错误|艰难曲折|荒诞不经|泥沙俱下|非死即伤|祸起萧墙|恼羞成怒|心怀不轨|一事无成|牵累到|坐以待毙|贬为|山雨欲来风满楼|情况异常|恨之入骨|暗潮汹涌|不良倾向|无法挽救|天理不容|错失良机|搬弄是非|拳打脚踢|无言以对|参赌|溃退|拒绝服务|扣人心弦|惊世骇俗|一罚了之|来历不明|倒大霉|诚惶诚恐|恃强凌弱|变本加厉|后患无穷|滴水不漏|不遗余力|黔驴技穷|引火上身|狼狈不堪|名不符实|冒天下之大不韪|监管函|稀土超标|督导不力|被强制平仓|资产减值|遭风险提示|ipo堪忧|引发不满|裁员降薪减亏|唯一亏损国企|成受罚常客|陷迷途|将一手好牌玩烂|遭欧亚卖场封杀|网销违规|被交易商协会通报|出具警示函|遭券商风险提示|惨遭下调|齐“变脸”|股东“群撤”|重组疑云|惹怒证监会|数据齐“变脸”|年检不合格|蚀本|撕毁|错误做法|整顿|臆造|混乱状态|不堪设想|不及格|吐血|哄骗|逼迫|收拾残局|废弃|证据不足|被忽视|困难|损耗|告密|妨碍|情况严峻|调戏|衰减|毁于一旦|拒绝接受|夺走|贬值|拉下水|阴阳怪气|窃听|犯错|任人宰割|危害|不符|不尽一致|相去甚远|隐瞒真实情况|敲山震虎|绞杀|震怒|处心积虑|滥用|打假|无法说明|被强制摘牌|出现异常|咄咄逼人|爆仓|强行平仓|不能平仓|退市|停市|高频交易|违约|过度投机|系统性金融风险|违规减持|赌场|私募失联|失联|维权|交易中断|交易故障|违反反洗钱法|小鬼|领导弱化|建设缺失|管理不规范|协助调查|非法聚集|游行|静坐|集体诉讼|跳楼|放火|扰乱办公场所|肆意辱骂|言语攻击|扭曲事实|集体飘绿|跌停板|超跌|急跌|自成交|整体低迷|黑天鹅事件|重创|行情疲软|大量撤单|频繁撤单|股市大跌|熊长牛短|延续跌势|连续下跌|大幅下跌|断涯下跌|闪崩|保证金不足|报单延迟|暴力加仓|爆雷|变脸减持|不担当|不能履行职责|财务注水|财务状况恶化|超范围经营|撤销备案|倒仓|盗买盗卖|赌博|断崖|兑付逾期|股东抽逃出资|股东虚假出资|股价腰斩|行政监管措施|合谋操纵|黑嘴|糊弄应付|花式减持|混日子|集中减仓|集中抛售|减持新套路|叫停|巨额亏损|巨幅亏损|客户密码被盗|客户账户被盗|连年下滑|流动性风险|流动性危机|庞氏骗局|疲疲沓沓混日子|评级虚高|欺骗投资者|欺诈发行|抢帽子交易|人去楼空|数据库宕机|数据库故障|数据库异常|通道业务暂停|投机|推卸责任|违约担保|尾市拉抬|无成交回报|无法撤单|无过便是功|无力偿还|系统宕机|系统堵塞|系统事故|系统延迟|系统异常|系统拥堵|消极敷衍|效益大幅下滑|修饰财报|虚增收入|研报标题党|业绩连续下滑|业绩造假|溢价减持|影子偏离度|逾期兑付|债券代持|重大遗漏|装样子|蛊惑交易|操纵开盘价|业绩作假|大幅下调业绩预估|粉饰财报|应收账款翻倍增长|财务报表撒谎|财务欺诈|业绩有压力|业绩同比下降|下修业绩|下调业绩|业绩连续亏损|业绩承诺被质疑|业绩不及市场预期|虚增业绩|零成交|飘绿|全线重挫|再遭重创|全线下跌|跌出新纪录|全线低开|大幅下挫|遭遇重挫|股价创新低|坍塌式离职|联系不上|坠楼|发布通缉令|违法操纵|隐瞒重大涉诉|带病上市|信息披露虚假|信息披露乱象|遗漏披露|业务连续下滑|夺权式要约收购|重组造假|抽逃出资|招股说明书撒谎|敌意收购|反收购|控制权纠纷|业绩对赌未完成|业绩对赌失败|虚假出资|质押股票跌破平仓线|侵占上市公司资金|侵占上市公司资产|侵害上市公司利益|无偿占有上市公司款项|凌驾|混乱|公司治理失效|公司治理失败|公司治理失灵|限制股东权利|公司治理待解|奇葩议案|审计失败|无法表示意见|被调查|评估失真|不履职|问询|监管关注函|警示函|内控缺陷|大股东违规|控股股东违规|法人治理缺陷|流动性枯竭|流动性不足|挪用保证金|流动性坍塌|内容诱导|阴阳合同|自行召开|自焚|虚假仓单|涉嫌受贿罪|奢靡之风|疲疲沓沓|明斯基时刻|立案|跨市场操纵|交割违约|灰犀牛|持续看空|朝令夕改|被开除|备案除名|业务萎缩|财务数据不真实|业务虚构|账款催收|合作方失联|负债率过高|纠纷|债务|负债高|异常交易|隐藏债务|财务纠纷|合同违约|食言|净负债率攀升|利润下降|报告期亏损|营收大幅下降|业绩缩水|业绩大幅缩水|被指控|被监管谈话|重灾区|关停|重组“流产”'
neg2 = '被捕|腐败|涉嫌贪污|涉嫌受贿|涉嫌行贿|涉嫌违法|涉嫌违规|被调查|落马|遭调查|逃税|被处罚|刑事处罚|经济处罚|偷税|漏税|财务造假|假账|虚增利润|违纪|上市造假|侵吞国有资产|包装上市|虚假上市|被拘|被刑拘|跑路|失联|涉黑|遭立案调查|遭举报|经济犯罪|玩忽职守|徇私舞弊|抗税|私自挪用资金|挪用公款|非法吸储|非法集资|诈骗|非法经营|信用诈骗|操纵股价|虚假广告|假冒专利|非法拆借|内幕交易|泄露内幕消息|骗取出口退税|虚假信息|伪劣产品|合同诈骗|贷款诈骗|虚假陈述|违规担保|向大股东违规提供借款|内部治理违规|信息披露违规|信息披露不准确|重大信息遗漏|内部治理违规|未及时披露重大事项|信息披露存在误导|非法套汇|高管未履行职责|违规炒股|虚假记载主营收入|虚假记载利润|欺诈发行股票|操纵证券市场|操纵证券价格|集资诈骗|非法销售|股票诈骗|风险控制指标违规|大股东占用上市公司资金|误导性陈述|破产|遭起诉|资金断裂|遭调查|巨亏|利润暴跌|利润巨降|退市|非法获利|业绩骤降|立案稽查|违约|伪造|资金链断裂|侵占国资|商业诈骗|信披漏洞|信披缺失|公司造假|欺诈上市|骗补门|被约谈|涉嫌虚增利润|信贷危机|事故|大股东内斗|涉牟私利|资产冻结|破产清算|老鼠仓|暂停执业|暂停营业|吊销执照|退市|乌龙指|处罚禁入|纪律处分|开除党籍|权色交易|权钱交易|内斗|资产遭封|不正当竞争|重大安全事故|行政处罚|恶斗|信任危机|销售欺诈|重组失败|退市边缘|造假门|经济诈骗|股权纠纷|环保违规|恶性竞争|黑幕|窃取商业机密|情报战|恶性骂战|口水战|被出具警示函|遭警示|内讧|争权|吞补偿款|被监视|遭点名|财报虚假记载|数据造假|公款旅游|套利|遭逼宫|未批先建|面临易主|短线交易违规|遭问询|坏账风波|黑名单|遭集体索赔|宫斗|非法理财|业绩恶化|财务危机|财务管理危机|浑水做空|罢工|霸王条款|兑付危机|财务迷局|美化业绩|遭巨额索赔|涉嫌违法经营|掺假|交易系统漏洞|单方变更合同|案中案|内幕信息泄露|审查遭中止|财报造假|夺权战|劣迹斑斑|高管密集离职|信用证逾期|风险提示缺失|利润造假|退市危机|税务处罚|存款失踪|重组流产|拖欠工程款|净利恶化|非法吸收公众存款|遭通报批评|逼宫战|安全门|含糊公告|被曝光|遭冻结|遭重罚|败诉|要约收购失败|遭公开谴责|遭谴责|安全漏洞|遭警告|被移送司法机关|被暂停上市|吃罚单|被暂停债务融资业|内警告处分|遭处分|被处分|决策程序违规|偷工减料|被罚|被带走|资本黑洞|违规挪用|操纵利润|业绩注水|财务舞弊|股东违规举牌|合同纠纷|名誉侵权|重组被否|涉嫌侵权|隐藏利润|不履行承诺|恶斗不休|诉讼战|间谍门|行贿门|资金诈骗|信息披露不作为|污染门|屡遭投诉|借贷纠纷|涉嫌虚增业绩|信披非诚|假冒伪劣产品|涉嫌虚高偿债能力|信披真假难辨|违法领取报酬|兼职违法|违法兼职|欠款未付清|迫近退市|同城暗战|以身试法|违规兼职|裁员风波|会计违规|恶意造假|腐败窝案|信披瞒报|亏损黑洞|取消投标资格|被指不务正业|债务扯皮|定增遭否决|隐瞒真实情况|汇票丢失告上法庭|担保黑洞|恶意侵权|舞弊收买|套取职工持股|管理存漏洞|股权司法冻结|经营持续恶化|借势减持惹质疑|缺乏法律保障|股东出逃|盲目扩张|高管涉案|天价罚单|自毁再融资|民事诉讼|非法交易|浮华业绩|暗中操盘|亏损巨大|高管出逃|泄露客户信息|季报存疑|侵权|提案遭抵制|违反规定|触红线|遭调查|募投疑云|不合法|遭反对|财务黑洞|资金蒸发|拆借黑洞|违规拆借|遭抵制|数据乌龙|财务疑云|财报作废|财务数据搬家|混改失败|被查|接受组织调查|高层动荡|被抓|违规批贷|主业濒临死亡|生存危机|遭群众举报|资金链告急|实质违约|本金违约|刚性兑付|官司门|被重组|IPO受挫|募投迷雾|收入无从印证|资金来源成迷|欺诈|配合调查|遭上交所问询|遭深交所问询|遭证监会问询|遭监管部门问询|被警示|遭公检法调查|资质被停|信披瑕疵|项目手续不全|遭做空机构狙杀|兑付违约|亏损王|签字伪造|与事实不符|遭证监会点名|并购迷局|存货暴增|使用假汇票|被指做局|涉贿|涉嫌行贿|举牌战|隐瞒交易|重组如儿戏|窃取|中止审查|债务黑洞|调出两融标的|官司缠身|经营恶化|被销毁|吃官司|拒不履约|违约事件|资金被冻结|截留货款|被提起仲裁|状告|高管震荡期|股东闹翻|股东起争执|存重大风险|坏账|损害投资人利益|股价雪崩|退约风险|摊上大事了|虚列费用|失败收购|疑点重重|商业间谍|业绩持续恶化|员工被欠薪|终身市场禁入|主业风险大|遭业界质疑|人为虚增|失信被执行人|接盘方爽约|欠缺商业道德|重组遭否|股权激励议案被否|质询|市场操纵|操纵市场|连环诉讼|黑幕交易|前科|司法冻结|提前终止重组|乌龙公告|故意违规|募资失踪|管理漏洞|招标内幕|披露存瑕疵|定增梦碎|股权争夺战|拒绝兑付|玩弄定增|保壳堪危|股东交恶|被内部处理|销售迷局|巨亏黑洞|扩张失速|管理藏隐患|资金链疑云|巨亏泥潭|定增困局|涉嫌越权|业务存水分|重组夭折|保壳无望|超警戒线|忽悠投资者|提前泄露|举牌易行权难|债务乱局|存款丢失|冒险定增|账目造假|成败存疑|重组搁浅|虚增存货|疑点频现|敲响警钟|业绩蒙阴|逾期贷款陡增|负面缠身|受处分|提货危机|未能守约|被诉|负面舆情|股债双杀|负债率高企|蹊跷交易|惹官司|现金流不足|盈利恶化|大股东失诺|粉饰报表|信披不充分|国资流失|虚构交易|虚假存单|借款纠纷|高新资质存疑|洗钱|募投之殇|同业竞争|圈钱谜局|招股书大缩水|成长性受质疑|投资款蒸发|缺乏核心技术|议案遭否|假担保真圈钱|坏账风险|回收风险|应收账款激增|不良贷款高企|信披遭质疑|收购争议|财务风险|挑战监管|环境污染|骗巨额担|遭投资者质疑|涉嫌逃税|发生安全事故|废水超标|违法排污|在逃|污染环境|曝安全问题|遭整顿|涉污染|涉污案|独立性存疑|非法|查封|索赔案|贿赂|未及时披露|违规行为|重罚|违规决策|公款吃喝|公款抽雪茄|敛财|顶风作案|公款大吃大喝|绕开监管|自曝家丑|债券违约|新闻腐败|违约债券|腐败案|监管漏洞|遭约谈|公款高消费|检举|揭发|非法生产|严重违纪|蒙混过会|涉国资流失|涉嫌围标|管控危机|摘牌风险|恶意退市|雇佣童工|涉嫌玩忽职守|被免职|非法转移|索贿|被逮捕|遭市场禁入|对簿公堂|被举牌|违反契约|深陷反腐漩涡|虚报债务|合同欺诈|失联风波|监管处罚|信披不及时|不良资产爆发|停产整顿|大股东爆仓|大股东遭平仓|强制平仓|遭实名举报|稽查|违规减持|被双开|遭遇强平|遭监管通报|虚报利润|内控重大缺陷|虚构应收账款|重大会计错误|点名处罚|信息提前泄露|顶格处罚|责令停产|抽逃资金|窗口期提前买入股票|信披失误|退市风险警示|信披滞后|信披意识缺失|借壳方造假案|融债违约|被警方控制|被立案调查|违法生产|股权遭冻结|隐瞒重大诉讼|假仲裁|触犯环保法|遭污染|洗钱案|拖欠增值税|污染案|对薄公堂|对赌失败|收购案遭否|质押股爆仓|账本失踪|被诉讼|信披违规|遭证监会立案|未合法披露|员工涉嫌泄密|涉信披违规|涉嫌虚增营收|公开谴责处分|严重超标|被监管方问询|涉嫌违规任职|关联交易存疑|遭深交所处分|失联黑名单|环保“黑榜”|董事长失联|遭深交所公开谴责|高管集体泄密|业绩预告被指违规|诉讼未披|涉嫌渎职|违规占用资金|操纵招标|有期徒刑|构成犯罪|犯有|审判|违建|恶性事件取保候审|串供|翻案|诬告|偷税漏税|知法犯法|收受贿赂|坐牢|缉拿|收押|作案|贪污|判刑受审|落网|犯罪活动|犯罪|执行逮捕|抢劫|行政诉讼|偷逃税款|涉赌|甲醛超标|不法行为|镉超标|判处死刑|批捕|犯法|提出诉讼|有法不依|监视居住|留党察看|二氧化硫超标|候审|徇私枉法|行贿|拘留|遭证监会|起诉|服刑|判处|犯案|贪污受贿|定罪|依法逮捕|违法犯罪|缓刑|自首|案发|锒铛入狱|令计划案|抓捕|归案|刑拘|通缉|骗税|判罚|行贿受贿|定案|索贿受贿|判赔|刑侦|作奸犯科|上诉|上访|押解|违法违纪|批准逮捕|拘捕|抓获归案|偷漏税|报案|贪污腐败|贪腐案|逮捕|诉讼|违法|受贿获刑|陷诉讼门|涉嫌违法|立案调查投资者|诉诸法律|涉嫌输送|侵权案|被证监会立案|企业受罚|涉违法|涉嫌渎职犯罪|违反证券法律法规|遭证监会处罚|涉嫌利益输送|洗钱罪|涉嫌受贿案|披违法|被起诉|被深交所问询|披露不规范|信披重大遗漏|公司涉嫌|行贿罪|被双规|违反证券法|管理与控制违规|受贿案|被环保责令整改|涉嫌无照经营|遭证监会立案调查|涉资金池违规遭罚|诉讼案|涉隐秘利益输送|遭证监会调查|涉土地违规|违约门|遭商务部立案调查|处罚环境违法企业|被控受贿|涉嫌单位行贿罪|违反八项规定|违反反洗钱规定|被司法强制划转|涉嫌股价操纵|信披违法|被环保部门查处|涉欺诈发行|遭立案|重组报告书造假|遭商务部立案|立案调查股|涉嫌国有资产流失|卷入造假案|涉嫌内幕交易|立案调查函|监管层处罚|面临一系列诉讼|存在粉饰业绩之嫌|重组信批违规|被控行贿受贿|集体失踪|被查封|巨额索赔|涉嫌虚假宣传|被证监会警示|踩《证券法》红线|违规占资|收到证监会关注函|涉官员受贿案|立案处罚|遭保监局处罚|遭证监局出具|骗补名单|遭证监局监管关注|收到监管局警示函|被公诉|违规经营|面临股民诉讼|遭监管严查|遭证监局处罚|调查通知书|强制摘牌|被强制摘牌|警示处罚|涉嫌不当关联交易|遭食药监局|被证监局责令整改|遭食药监局通报|机构许可违规|发案率高|虚假材料|涉案金额大|受监管警示|卷入安全事故|违反相关卫生|接罚单|被采取责令改正措施|最大罚单落定|被债权人申请破产|不服监管斗胆上诉|纠纷升级|被监管盯上|引发深交所关注|收证监局警示函|侵权现象|被判败诉|遭证监会行政处罚|证监局处罚|曝违法违规|被其勒索|侵犯专利|采取行政监管措施|多处造假|遭监管双重处罚|虚假银行汇票业务|操纵市场案|被指多处造假|虚假宣传|获刑|禁锢|罢免|毒死|举报|经济问题|受贿|违规|通奸|立案调查|恶意做空|恶意做多|组织审查|政治攀附|隐藏性腐败|嫌受贿罪|伪造公文印章|违规买卖股票|贪官|塌方式腐败|送上法庭|双重狩猎|双规|人情执法|权力寻租|培养自己的势力|没躲得过狩猎|立案侦查|决不姑息|监管俘获|监督责任缺失|毫不讳言地拿股权|行政开除处分|腐败朋友圈|非法行为|倒卖名单|大老虎|打虎拍蝇|部门小鬼|不法利益|被开除党籍和公职|被开除党籍公职|窃国者侯|调查|不正当关系|情妇|非婚生子|配合调查被警察带走|涉嫌严重违纪|利用职务便利收受贿赂|移送公安|移送司法|利用非法手段|接受组织审查|处分|外逃|违规出国|幕后操纵|监管不作为|监管失职|限制出境|违法乱政|金融大虎|违规出境|被开除公职|被开除党籍|发审腐败|做假账|设局欺骗投资者|投诉举报|盗买账户|萝卜章|被警察带走|实名举报|免去其职务|IPO带病|带病闯关|白粉高利'
no = '不大|不丁点儿|不甚|不怎么|聊|没怎么|不可以|怎么不|几乎不|从来不|从不|不用|不曾|不该|不必|不会|不好|不能|很少|极少|没有|不是|难以|放下|扼杀|终止|停止|放弃|反对|缺乏|缺少|不|甭|勿|别|未|反|没|否|木有|非|无|请勿|无须|并非|毫无|决不|休想|永不|不要|未尝|未曾|毋|莫|从未|从未有过|尚未|一无|并未|尚无|从没|绝非|远非|切莫|绝不|毫不|禁止|忌|拒绝|杜绝|弗'

print ('IFkeyword is loading ......')
keywords = "P2P|p2p|比特币|余额宝|融租租赁|支付机构|支付宝|数字货币|保险.*互联网|加密货币|愉悦资本.*平台\
|虚拟货币|科技金融|金融科技|点牛金融|普惠金融|互金|现金贷|区块链"
print ('IFkeyword loading successful')


ad_keywords = "创始人|董事|经理|董事长|高管|实控人|股东.{0,10}(矛盾|处罚|分歧|反对|利益|违规|转手|被否|变换|举报|变更|通报|\
争执|放弃|控制|转让|冻结|退休|掏空|入主|当|短线|交易|陷|违约|提名|罢免|举报|大战|变动|免去|风险|\
减持|侵占|辞|出逃|回购|晃点|生变|打|实控人)|\
(出席|起诉|辞任|清退|违规|指责|收购|打架).*股东|\
内控风险|独董|监事|董事会|控股股东|实际控制人|党委书记|总监|采购员|职工\
|科长|行长|高层|经纪人|组长|镇长|局长|市长|员工|掌门|副总|主管|总裁|一致行动人|责任人|职员|执董|主席|管理人|秘书|\
法定代表人|当事人|业务员|法人|技术员|董秘|总助|代理人|所长|负责人|操作员|掌舵者|中层|管理层|总工|财务顾问|财务官|审计机构\
|股权之争|股权争夺|股权结构|股权转让|(出让|受让|甩卖).{0,30}股权|股东大战|私有化|控制权|收购|举牌者|实控权|要约收购|\
入主|增持|出售|减持|易主|控股权|内斗|并购|私有化|股权易手|关联方|裁员|欠薪|辞职|裁撤|跳槽|拖欠|裁人\
|人员编制|解约|精减|管理人员|减员|辞退"
not_ad_keywords = '透露|出售信息|(年报|季报).*营收|本管理人|完成出售|披露.{0,10}责任人|上市公司并购重组|国家高层|\
出售资产|接到.{0,10}控股股东|收购.*股权.*一致|本公司.*董事.*保证信息.*|造假.*规定|信用社|担任.{0,15}组长|\
经理办公室|搬迁员工'#|转让.{0,10}控股股东'
ad1_keywords = '履职|失误|免.*职|失联|内控|纷争|留置|转让|失联|掏空|罢免|犯.*罪|诈骗|处分|套现'
ad2_keywords = '调查|涉嫌|落马|违规|获刑|受贿|判刑|带走|被查|行贿|查封|贿送|泄密|监视|侵占|违纪|违法|谴责|被判|\
涉诈|贪污|索贿|缓刑|有期徒刑'
not_ad2_keywords = '翔实调查|不得违规|标的调查'
ad3_keywords = '离职|辞别|辞任|辞呈|免职|履新|降级|辞职|解聘|调整|退任|辞去.*职务|易|换帅|加盟|解职|变更|变动'
not_ad3_keywords = '交易日|人才加盟|方案.{0,15}调整|交易|价.{0,10}调整|离职员工|员工离职|不会.{0,20}变更|贸易|价值变动|\
调整.{0,10}配置'
ad4_keywords = '打架|遭殃|内讧|不一致|反对|未出席|放弃|否决|变脸|撤离|内斗|被否|闹剧|指责|失控|\
恩怨|情仇|冲突'
not_ad4_keywords = '发审委否决|被否.*月|精彩.*变脸|风险失控|业绩.{0,10}变脸|程序.{0,10}冲突|自愿放弃|放弃缴纳'
ad5_keywords = '裁员|欠薪|减员|拖欠'
not_ad5_keywords = '拖欠.{0,10}欠款'
print ('ad_keywords loading successful')


ass_keywords = '担保|抵押'
not_ass_keywords = '担保物|担保权益|担保导致|谎称.*担保|扩大.*担保.*规模|降低.*担保.*成本|专注.*担保.*发展'
ass1_keywords = '违约|风险|披露|逾期|乱象|终止|被罚|蒸发|纠纷|借款|违规|反对|官司|罚单|监管|冻结|寒冬|欠款|担保.{0,15}额.{0,15}超|\
弃权|造假|涉嫌|伪造|拖欠|追回|危机|疑云|陷|大坑|出事|整顿|堪忧|存疑|索债|自救|关注|催债|责任担保|关联担保|担保事项'
not_ass1_keywords = '风险可控|不存在.{0,10}风险|抗风险'
ass2_keywords = '(追加|提供|增加|对外|融资|作|做|贷款|互相|反|连带|保证)担保|担保(额度|总额|公告)'
print ('assure_keywords loading successful')

credit_keywords = '诚信|失信|未达预期|业绩补偿未支付|未能支付业绩补偿|失约|诈骗\
|无法实现|打脸|忽悠|难兑现|逾期|变脸|爽约|信披|违诺|老赖|信任|履约|瞒天过海|质疑|失联|信任危机|信用|隐瞒|黑名单|\
消失|不翼而飞|挪用|资金占用|占用资金|用募资|资金去向不明|资金.{0,10}变更|占资|资金.{0,15}存疑|钱荒|挪为他用\
|资金.{0,15}用途|拆解资金|去向不明|募资用途|变更.{0,10}用途|募资理财|动用|运用.{0,15}资金|虚假信息|募资闲置|降级\
|连降|等级|吹牛|违法.{0,15}(资金|处罚|欺骗)|虚假|造假|虚增|虚构|误导|卖假|诈骗|非法经营|骗补|忽悠|谎言|操纵|侵害|打假|真假|欺诈\
|伪造|骗局|舞弊|腾挪|伪造|隐瞒|欺骗|逃避|举债|挪作他用|巨亏|债务|退市|警示|债务|受累|避税|更改.{0,15}用途\
|欠债|执行.{0,15}名单|追讨|持续经营|冒用|不良记录|异常|代偿|假冒|破产|违约|未能清偿|烂账|逃往|展期|偿债\
|延长|追债|(兑付|信任|债务|踩雷|资金|年报|陷入).{0,15}危机|危机.{0,15}(债务|资产|提现)|\
信用.{0,15}(寒冬|下调|观察|事件|降级|欺骗|追讨|偿还|失信)|(撤销|下调|调整).{0,15}信用|\
承诺.{0,15}(只完成|仅完成|无法实现|完成.{0,15}仅|未能|兑现|失约|未达|泡影|履行|存疑|游戏|逾期|风险|延期|未达标|变脸)|\
(低于|违背|违反|食言|未完成|虚假|违|履行|兑现|不|注入).{0,15}承诺|\
涉嫌.{0,8}(虚假|伪造|挪用|造假|欺诈|抄袭|诈骗|传销|隐瞒)|(无力|不履行|未).{0,15}偿还|\
业绩.{0,10}承诺.{0,10}(未达|失约|泡影|难|完成|存疑|游戏|存.{0,10}风险|未兑现|变脸|未能|完成率|无法实现|仅完成)|\
(食言|未完成|违|不).{0,10}业绩.{0,10}承诺|业绩.{0,10}(低于|变脸).{0,10}承诺|\
偿付.{0,10}(不确定|风险|承压)'
not_credit_keywords = '(不存在|没有)虚假.*误导.*陈述|信用鉴证|度假|违约事件频发|收效未达预期|违法所得|警示市场|内部通报|\
认为.*信用等级|承担.{0,10}清偿.{0,10}责任|进行.{0,10}评级|逾期贷款占|逾期率|涉嫌.{0,15}信息.{0,15}违规|\
信用评级|参与质押式回购|不存在虚假.*误导|无需承担违约责任|公司承诺|现金支付|募集.*延长|有无造假|不会.*(警示|退市)|并.*承诺|\
异常波动|支付.*现金对价|增强.*持续经营|股东承诺|支付.*现金.*方式|下调管理费|承诺.*净利润.*不低|支付方式|报酬.*计提|\
信用.*业务|异常波动|承诺函|造假.*规定|违约金|私有化退市|媒体通报|通报会|准备.{0,10}偿付|保护区.*违法|违法开垦|不能挪用|\
政府债务|不.{0,10}冻结|债务.{0,10}可控|犯非法经营罪|逾期.{0,15}清收|变动.{0,15}警示|逾期.{0,10}造成.{0,10}损失|信用信息系统'
cre1_keywords = '承诺|失信|未达预期|诚信|违诺|不达标|老赖|是否具备.{0,10}履约能力|发布承诺.{0,10}增持'
not_cre1_keywords = '中诚信托|失信.{0,10}制度|接受诚信|诚信信息|诚信建设|失信.{0,10}名单|诚信经营|诚信意识|丧失信心'
cre2_keywords = '挪用|占用|使用.{0,10}(资金|募资)|资金.{0,10}使用|(变更|改变).{0,10}用途|\
占资|拆借|侵占|腾挪|去向不明|动用|挪为他用'
not_cre2_keywords = '变更集中|动用账号|车道占用|通道占用|侵占.{0,15}自然|侵占破坏|侵占保护区|侵占区域|侵占林地|占用实验区|\
占用林地|占资产'
cre3_keywords = '评级|下调|降级|信用等级'
not_cre3_keywords = '下调换股价|政务降级|降级处分|贷款下调|税率.{0,15}下调|下调.{0,15}税率'
cre4_keywords = '抄袭|误导|故事|虚假|欺诈|制假|售假|造假|忽悠|虚增|卖假|诈骗|假章|假账|骗补|诈骗|伪造|虚构|舞弊|\
欺骗|失实|失真|涉嫌.{0,8}(虚假|伪造|挪用|造假|欺诈|抄袭|诈骗|传销|隐瞒)'
not_cre4_keywords = '虚假整改|反欺诈|反诈骗'
cre5_keywords = '黑名单|黑榜|欠薪|贷款|违建|欠债'
not_cre5_keywords = '小额贷款'
cre6_keywords = '债务.{0,8}(危机|违约|逾期)|违约|水漂|逾期|冻结|抵债|未能清偿|偿还'
not_cre6_keywords = '冻结账号|逾期不整改|逾期未登记'
print ('credit_keywords loading successful')

fin_keywords = '流动性|亏|现金流|利润|财务|债务|净利|自融|融资|收入|同期下滑\
|坏账|负债|营收|关联交易|财报|资不抵债|老赖|冻结|费用猛增|业绩|审计|造假|账务|存账|销售额\
|会计|无法表示意见|否定意见|损失|盈利|由盈转亏|套现|款项|账款|收益|计提|败家|年报|杠杆\
|现金|回购|中报|季报|盈利|投资.{0,15}(占比.*超|失败|赔)|募资|财报|利息|毛利|年度报告\
|会所|非标|快报|事务所|下调|外强中干|虚增|造假|变脸|调节|操纵|利益输送|涉嫌|迷雾|伪造|粉饰|刷假\
|假利|存疑|无法披露|注水|假账|两套账本|不一致|夸张|财务之谜|质询|账实不符|嫌疑|更正|离奇|疑云\
|真实|谎称|略逊|净利润减少|净利减少|资产负债|托管经营|偿债|欠债|抵押|注资|流动性\
|现金流|借款|无法支付|欠款|债务危机|拖累|无法.*保证.*真实|业绩下滑|\
资产.{0,15}(减值|下降|不佳|抵押|不实|为负|缩水)|(变卖|甩|出售).{0,15}资产'
not_fin_keywords = '审计部|客观真实|若.{0,30}未能披露.{0,30}年度报告|固定收益证券|利息种类|真实性|内容真实|业绩漂亮|有无造假|\
资产重组|信息披露.*真实|唯一真实|数据.*下调|真实信息|统计年报|收入增长|偿债获股|青年报|新快报|学术造假|律师.{0,15}事务所'
not_fin_keywords1 = '增长|审计部|同增|增加|盈利|提升|大增|升|增长|提高|添加'
not_fin_keywords2 = '减少|下滑|下降|亏损'
fin1_keywords = '账实不符|造假|虚增|真实性|虚假|谎称|存疑|欺骗|质疑|虚夸|子虚乌有|隐瞒|欺诈|垫资|疑点|疑云|存疑|假账|\
不同.{0,15}数据|数据.{0,15}(不一|异常)|伪造'
fin2_keywords = '亏损|少赚|下滑|亏了|净亏|下降|下跌|巨亏|减少'
not_fin2_keywords = '房价.{0,15}下跌'
fin3_keywords = '审计机构|业绩修正|无保留意见|审计报告|会计师事务所|会计事务所|无法保证|审计意见|非标|会计师|拒绝审计|\
无法表示意见|修正|出具保留意见|会所|会计所'
not_fin3_keywords = '财务.{0,15}为.{0,15}会计师事务所'
fin4_keywords = '资不抵债|负债|债务危机|债务'
fin5_keywords = '资金.{0,15}(紧张|不足|风险|吃紧|危机)|来源不明|现金流.{0,15}(锐减|负|承压|风险)|(没有|创造|吞噬).{0,15}现金流|\
维系.{0,15}资金链|资金链.{0,15}(断裂|紧|问题|危机)|筹钱|融资徐明|还不上钱|流动性.{0,15}危机|欠款|付不起'
print ('finance_keywords loading successful')

manage_keywords = '到期未付|坏账|收回.{0,10}风险|(款|资金|投资|土地).{0,20}收回|追收|坏账|负债|依赖.{0,10}补助|补助.{0,10}(难解|保壳)|借款|\
欠款|追回|回收|计提|偿还|债务.{0,20}(缠身|纠纷|危机|逾期)|归还|巨额资金.{1,10}陷|贷款逾期|财产.{1,10}查封|回款.{1,10}慢|\
还钱|拆借|资金.{0,10}(压力|困难|紧张|占用|告急|危机|深陷|问题|链困境|链危机|回笼|危局)|拖欠|金.{0,20}退回|欠.{0,20}(万|元)|\
讨.*质押金|追债|不良率|发不起工资|(债务|兑付)危机|押.{0,20}股权|现金流.{0,20}(吃紧|紧张)|背.{0,20}债|欠.{0,20}债|\
营销费用|欠.{0,20}(薪|费|亿|未还|钱|资)|资金链(问题|危机|吃紧|临危|断裂|告急|状况|紧张)|合同诈骗|强制平仓|\
股权质押违约|巨亏|回收.{0,20}(难度|堪忧)|业绩.{0,20}未达标|拖款|负债率超|宣告破产|没钱|解冻资产|划转.{0,10}资金\
(账户|资金|持股|股份|资产|股票|账号|银行|股权|存款|股|公司|资产).{0,20}冻结|(公司|冻结|司法|连累).{0,20}(崩溃|查封)|冻结.{0,15}存款|\
强行划扣|冻结|伪造.{0,20}款|逾期.{0,20}(债务|本息|资金)|私下融资|阴阳贷|缺钱|偿债能力|拍卖|(财产|资产).{0,20}查封|账户.{0,20}保全|\
资产.{0,20}抵押|票据诈骗|股份.{0,20}划转|IPO.{0,30}(摘牌|搁浅|撤退|撤回|被否|终止|撤单|过会率|冲击)|发行终止|\
(终止|忽悠式|问|搅黄|遭罚|不会|抬价|放弃|撤回|中止|暂缓).{0,20}(定增|A股|募资|公开|审核|项目|审查|挂牌|上市|合并|\
IPO|重大|转让|并购|发行|重组|收购|认购|筹划|辅导)|(冻结|连累).{0,20}公司|\
收购.{0,20}(失败|终止|内讧|闹剧|爆雷|终止|告吹|资金来源|被否|疑云|变数)|\
并购.{0,20}(受挫|问题)|购买资产|受让.{0,10}股权|\
重组.{0,20}(告吹|夭折|落空|质疑|自救|终止|未果|失败|风险|告败|迷雾|通过率|屡战屡败|变更)|\
股权之争|出售股权|溢价收购|业绩.{0,20}爽约|支付.{0,20}转让|关联交易折戟|借壳.{0,20}(搁浅|延期)|募资.{0,20}不给钱|上市.{0,20}破灭|\
取消.{0,20}(发行|配股)|定增.*(失效|告吹|失败|缩水)|延长.{0,20}增发|(配额|融资).*被否|违规.{0,15}挪用|\
原材料.{0,10}(价|经营)|一季度.*景气度|推进.*未达预期|影响.{0,30}业务|业务.{0,30}(变更|少)|禁售|制裁|主业退出|转型|政策风险|\
产品关税|销售.{0,20}终止|暂时停产|跨界|主业.{0,20}天花板|布局.{0,20}产业|行业.*变局|调.{0,30}价|暂停生产|工作.*延迟|开发.{0,20}产品|\
生产.{0,20}关闭|收.{0,20}税|成本.{0,20}(加剧|上升)|停产|税.{0,20}政策|供不应求|限产|生产经营.*(变化|压力)|外部环境.*(困境|影响)|暂停批设|\
停售|终止.{0,20}(合作|设立)|需求.{0,20}(软|低迷)|扇贝.{0,20}死亡|环境异常|生产.{0,10}停滞|贸易争端|经营活动.{0,10}变化|面临.{0,10}风险|复工复产|\
出事|损失|中毒|安全(隐患|生产)|火灾|爆炸|灾害|塌方|倒塌|坍塌|\
索赔|上诉|判罚|产权案件|纠纷|清还方案|诉讼|维权|控诉|起诉|变卖|侵权|清盘呈请|被判|诉.{0,10}专利|赔偿|被告|起诉|仲裁|资产.*划走|\
发放.*清算款|起诉|败诉|判决|被诉|法院(传票|回|维持)|反诉|\
投资损失|亏损|市值(萧瑟|狂泻)|灰飞烟灭|未获回报|专户浮亏|愿赌.{0,20}服输|浮亏|基金.{0,20}影响|深套|微乎其微|拖累.{0,20}信托|理亏|\
(跌停|亿).{0,20}蒸发|蒸发.{0,20}亿|资金失踪|(业绩|信托)惨亏|出逃|踩雷|血亏|投资难收|巨亏|亏.{0,20}亿|惨套|业务败局|被套|投资腰斩|\
炒股亏|身陷.{0,20}违约|信托.{0,20}亏|损失.{0,20}元|套牢|跌破.{0,20}平仓线|亏.{0,20}亿|拖累|\
(利润|营收|业绩|收入|毛利率|价|营业额|产品|用户量|份额|出货量|业务|销量|净利|销售|营收|增速|营收).{0,30}\
(锐减|大挫|减少|下滑|低迷|锐减|跌|放缓|淡季|萎靡|腰斩|下行)|\
关闭.{0,20}馆|拉低.{0,20}业绩|闭.{0,20}店|滞销|挤压下滑|营收为零|利润.{0,20}暴跌|房地产.{0,20}同比减少|业务.{0,20}承压|\
应收账款|欠款|借款|拖欠.*款|欠债不还|扩张.{0,20}(出售|受挫|待考|折戟|受阻|亏损|盲目|质疑|蒸发|乏力|产能|承压|生变|后遗|激进)\
转让|(卖|出售|出让|转让|甩卖|剥离|收购|置出|出清|抛|售卖|甩手|开售).{0,30}(资源|企|价格|物业|债权|公司|股|项目|资产|业务|所持)|\
(资产|公司|股权|PE|设备|股份|业务).{0,30}(剥离|变卖|转让|租赁|甩卖|出售|卖出|置出|收购)|蛇吞象|卖壳|\
破产|减资|合并|解散.{0,10}公司|重整|退市|清盘|倒闭|清算|收缩.*业务|注销.{0,15}公司|公司.{0,15}注销|企业.*解散|\
(迷恋|投资).{0,20}副业|民间(借贷|集资)|扩产|(激进|盲目).{0,15}扩张|\
环保|环评|排污|污染|油耗.{0,20}未达标|(终止|客户).{0,30}合作|环境.{0,20}(违法|问题)|合作.{0,30}(终止|低)|破坏.{0,20}环境|不续约|不续签|停止.{0,20}供货|\
禁止.{0,20}产品|排污|废渣|营收为负|中美贸易(摩擦|战)|债务.{0,20}爆雷|采购.{0,20}预期|收购.{0,20}亏损|巨亏.*接盘|贸易风险|成本抬升|行业低迷|\
持续经营能力.*不确定|使用.*不合规|业绩不如预期|流动性问题|董事长跳楼|互撕|受贿|收益.{0,20}下滑|估值.{0,20}异常|怒怼|不尽职|\
转型不顺|合同纠纷|事故|贷款.{0,10}(还旧|逾期|违约|私下融资|传讯|诉讼|违规)|(虚增|新增|抵押|贷).{0,10}贷款|\
(一度|股价|复牌|连续|低位).{0,10}跌停|跌停.{0,10}狂泻|无.{0,10}还款.{0,10}计划|延迟.{0,10}还款'
not_man_keywords = '显示.{0,20}主营|增长.{0,20}转型|(特征|信息)损失|强化.*污染.*防控|IPO.{0,30}企业|反馈冻结|转让日.*暂停.*转让|\
基金转型|偿债能力较强|负债.*额下降|跨界合作|客户.*获取.*通过.*合作|爆炸式|贷款.{0,15}余额|污染.*方案|土地拍卖|私有化退市|抛光设备|\
转让.*细则.*公司|卖空指定.*名单|各项贷款.{0,15}元|不良贷款率|出售.*(建立|来源).*公司|迎来转型期|资金.{0,15}问题受到.{0,15}重视|\
基金.{0,20}影响力|调研.{0,30}价|竞价转让|对于布局|真的合并|合并报表|帮卖.*项目|增长影响.{0,20}业务|借款合同|影响.*继续.*业务|\
偿还.{0,20}地方政府债券|调.{0,30}电价|拨付.*转型.*资金|否则视为侵权|调目标价|减少.{0,15}负债|外币负债.{0,15}对冲|\
不会.*生产.*变化|用于.*贷款.*担保|空调.*价|影响.{0,15}，.{0,15}业务|开发.{0,15}，.{0,15}产品|(推动|推进).{0,15}转型|\
生产.{0,15}未.{0,15}变化|转型压力.{0,15}大|负债端|卖.{0,5}，.{0,15}公司|卖.{0,5}，.{0,15}项目|出售.{0,15}企事业单位'

man1_keywords = '破产|重整|减资|收缩.{0,15}业务|重组|公司.{0,15}注销|注销.{0,15}公司|解散清算'
not_man1_keywords = '(推进|不排除).{0,15}重组|对.{0,15}重组.{0,15}信心'
man2_keywords = '非法(排污|倾倒)|环评.*未.*通过|环保.{0,15}(违法|高压|问责|违规|问题|风险)|油耗未达标|\
终止.{0,15}(入|合作|合同)|(曝光|废气|企业).{0,15}污染|废水排放|合作.{0,15}终结|环境(违法|污染)|协议.{0,15}不续约|\
污染环境|收购.{0,15}终止|失.{0,15}联|纠纷.{0,15}赔|(违法|违规)排污'
man3_keywords = '(沉迷|迷恋).{0,15}副业|民间借贷|生产.{0,15}检修|责令停产|盲目扩张|传统.*业务.*承压|陷.{0,15}资金危机|\
布局多元化|扩张.*盲目|主业.{0,15}下跌|陷.*扩张.*症|扩张.{0,15}(质疑|亏损|需.*理智)|布局.{0,15}产业|发展.{0,15}承压|\
民间集资|跨界|主业.{0,15}(变更|困局|遇考)'
not_man3_keywords = '满足.{0,15}转型.{0,15}需求'
man4_keywords = '欠款|私下.{0,15}融资|难解.{0,15}债务|借款.{0,15}(占|超|增)|新增.{0,15}借款|债务危机|欠.{0,15}(亿|债)'
man5_keywords = '(出让|转让|出清|变卖).{0,15}股权|剥离.{0,15}(业务|资产|公司)|股权.{0,15}转让|出售.{0,15}(股权|项目|资产|业务|股份)|\
(抛|卖).{0,15}资产|资产.{0,15}出售|收购.{0,15}(股权|股份)|抛售.{0,15}亿|转让.{0,15}(债权|公司)|公司.{0,15}甩卖|业务.{0,15}(变卖|剥离)|\
开售.{0,15}资源'
not_man5_keywords = '可供.{0,15}出售.{0,15}资产'
man6_keywords = '(存款|持.{0,15}股|账户|资金|资产|股票|账号|帐号|股份|股权|股东.{0,15}股|财产).{0,15}冻结|(股权|股票|资产).{0,15}拍卖|借款纠纷|\
(清单|财产|公司).{0,15}查封|查封.{0,15}股权|冻结.{0,15}资金|连累遭查封|股份.*划转'
man7_keywords = '(收入|营收).{0,15}(降|大挫|下滑)|销售.{0,15}(下降|锐减|淡季|萎缩)|\
(销量|销售|业务|出货量|份额).{0,15}(萎靡|降|跌|放缓|下滑|减少)|闭店|停产|\
营业额.{0,15}降|掉出.{0,15}排名|减产|竞争力下降|增速.{0,15}(下行|放缓|下滑)'
man8_keywords = '投资.{0,15}损失|出资.{0,14}亏损|萧瑟|踩.{0,15}雷|基金.{0,15}解散|被套|复牌.{0,15}跌停|\
(亏|蒸发).{0,15}亿|公司.{0,15}不寒而粟|亏.{0,15}万|导致.{0,15}亏|投资.{0,15}难.{0,15}收割|\
跌停|机构.{0,15}躺枪|买.{0,15}理财.{0,15}亏|公司.{0,15}注销|转型.{0,15}阵痛|投资.{0,15}失利|业务败局|连亏|承诺.{0,15}未达标|\
折戟|马失前蹄|投资.{0,15}腰斩|浮亏.{0,15}成|套牢|跌.{0,15}平仓线'
not_man8_keywords = '避免.{0,15}投资.{0,15}损失|亏.{0,5}盈.{0,15}万'
man9_keywords = '工.{0,15}遇难|矿.{0,15}(出事|关闭)|(炉|气).{0,15}泄|(车|厂|集团|矿|产线|产品|粉|项目|长期|全面|被|公司).{0,15}停产|\
(矿|安全|意外|工厂|火灾|爆炸|燃爆|质量).{0,15}事故|(车|公司).{0,15}爆炸|停产.{0,15}整改|车间.{0,15}封停|\
中毒.{0,15}亡|生产.{0,15}停滞|未.{0,15}复产|泄.{0,15}事故|处于.{0,15}停业|公司.{0,15}火灾|工地.{0,15}起火|\
停产.{0,15}搬迁|厂.{0,15}(塌方|倒塌)暂停.{0,15}生产|中毒事件|停产.{0,15}整改|爆炸.{0,15}起火'
man10_keywords = '经营.{0,15}(负面|变化)|景气.{0,15}变化|未达预期|盈利.{0,15}影响|退出.{0,15}行业|转型|面临.{0,15}风险|\
购买.{0,15}股权|新增.{0,15}风险|布局.{0,15}产业|生产.{0,15}关闭|成本加剧|限产.*影响'
not_man10_keywords = '满足.{0,15}转型.{0,15}需求'
man11_keywords = '终止.{0,15}(发行|IPO|ipo|辅导|挂牌|上市)|(放弃|撤回).{0,15}(可转债|上市|挂牌|IPO|ipo)|\
(IPO|ipo|上市).{0,15}(搁浅|终止|走低)|投资.{0,15}不.{0,15}给钱|(可转债|公司债).{0,15}(中止|终止)|定增价.{0,15}倒挂|\
撤回.{0,15}(A股|上市).{0,15}申请|(取消|中止|终止).{0,15}发行|取消配股|定增.{0,15}(告吹|失败)|配额.{0,15}方案.{0,15}被否'
man12_keywords = '重组.{0,15}难.{0,15}形成|放弃.{0,15}(合并|收购)|终止.{0,15}(并购|认购|购买|收购|重组)|\
(抬价|溢价).{0,15}(收购|并购)|并购.{0,15}受挫|(忽悠式|跨界).{0,15}重组|并购.{0,15}出路|\
重组.{0,15}(终止|自救|质疑|未果|失败|告败|落空|迷雾|夭折)|收购.{0,15}(被否|失败|终止|争议|内讧|闹剧)'
man13_keywords = '应收.{0,15}计提|资金.{0,15}(紧张|危机|临危|告急|断裂|承压|堪忧|危局|压力)|债务.{0,15}爆雷|\
冻结.{0,15}资金|不.{0,15}工资|(背负|陷|难解).{0,15}债务|债务危机|资金周转|负债.{0,15}超|资不抵债|拖欠.{0,15}货款|\
现金流.{0,15}紧张|风险.{0,15}缺钱'
man14_keywords = '到期未付|收回.{0,15}风险|债务.{0,15}闷杀|(资金|款项|资助款).{0,15}(无法|未|能否).{0,15}收回|\
回款.{0,15}慢|金.{0,15}未退|\
追讨.{0,15}金|追债|款.{0,15}回收.{0,15}(难|堪忧)'
man15_keywords = '罚.{0,15}上诉|司法.{0,15}冻结|诉讼|\
索赔.{0,15}开庭|遭.{0,15}控诉|起诉.{0,15}(索赔|侵权)|租赁.{0,15}纠纷|立案调查|\
纠缠|索赔|纠纷.{0,15}案|拍卖.{0,15}驳回|败诉|受损.{0,15}维权'
print ('manage_keywords loading successful')

mar_keywords = '减持|转让|出售.{1,20}股|沽清|套现|抽血|受让|持有.*股份.{0,20}减少|持股.{0,30}减少|平仓|强平|清仓|质押|\
冻结|拍卖|爆仓|(收购|IPO).{0,15}终止|摘牌|戴帽|退市|暂停上市|终止上市|撤回IPO|清退|终止挂牌|喊停|除牌|清盘|终止审查|被.{0,10}ST|\
风险警示|风险提示|终止挂牌|关联交易|操纵|炒作|交易异常|新低|跳空低开|腰斩|新低|蒸发|破发|重挫|拖累|\
折半|新低|折价|狂砍|沽售|跑输大市|与大市同步|与大市同步|(降|下调).{0,10}评级|评级.{0,10}降|(价|股).{0,15}降至|(遭|评级).\
{0,15}下调|中性|调低|砍掉|沽空|重挫|踩雷|负面.{0,15}舆情|消减|沽出|撤销|卖出|消减|被砍|下调.{0.15}预测|下调.{0,15}(至|预期|估值|价)|\
终止.{0,15}(计划|事项|挂牌|发行|辅导|上市)|评级.{0,15}至负面'
not_mar_keywords = '避免.*摘牌|增持|风险提示(：|:)|转让系统|指数.{0,15}新低|增速.*降至|未能.*披露.*(转让|终止)|\
数据.*降至|下调趋势|终止维护|公开转让说明书|化解质押风险|增速新低|技术.{0,10}转让'
mar1_keywords = '转让|减持|清仓|沽清|套现|出售.{0,10}股|强平|清盘|受让.{0,10}股'
mar2_keywords = '质押|股.{0,15}冻结|拍卖|爆仓'
mar3_keywords = '摘牌|终止挂牌|终止.{0,5}发行|除牌|暂停买卖|取消上市|风险警示|退市风险|终止上市|暂停转让|取消股票发行|临停|\
暂停上市|退市|(遭|次|终止).{0,10}风险提示'
not_mar3_keywords = '可能.{0,10}终止上市进程'
mar4_keywords = '跌|新低|拖累股价|踩雷|闪崩|重挫|跳水|蒸发|崩盘|破发|异常波动|腰斩|卖出|下挫'
not_mar4_keywords = '业绩.{0,10}下挫'
mar5_keywords = '下调|估值调整|削目标价|削减|评级|做空|沽空|调低|预估|估值.{0,15}(贬值|缩水|下调|下降|跌停)|\
(跌停|砍|下调|调低|遭|消减).{0,15}估值'
not_mar5_keywords = '削减产能|工资.{0,15}下调|下调.{0,15}工资'
print ('market_keywords loading successful')

pro_keywords = '投诉|曝光|不合格|黑榜|召回|违规生产|缺陷|强索|陷入.{0,15}事件|隐患|产品质量|\
质量.{0,15}(不合格|不可靠|不过关|缺陷|关注)|抽检|不合规|生产.{0,15}不合格\
不靠谱|315|故障|(质量|机油|引擎|车型|召回|施工|卫生|车辆).{0,15}问题|问题不断|不达标|缺失|质检|侵犯|侵权'

not_pro_keywords = '生产厂商|(主营|从事).{0,15}生产|从事.{0,15}设计|符合设计|回应.{0,15}事件|管理.{0,15}缺失|\
曝光量|进行生产|申请.{0,15}生产|集产.{0,15}生产|生产厂家|设计.{0,15}方案|陷入.{0,15}窘境|\
技术不达标|曝光率|生产安全|产品的.{0,10}生产|陷入.{0,15}(思考|合同纠纷)|\
处境陷入|合格.*合格.*合格.*合格.*合格|产品质量保证体系'
pro1_keywords = '车.*召回|召回.*车|不良反应|安全性|曝光.{0,10}问题|不合格|上.{0,10}黑榜|造假|违规生产|\
召回.{0,10}(产品|笔|台|部分)|质量.{0,10}(不过关|缺陷|问题)|产品.{0,10}(陷|风险|质量)|安全隐患|掺假|查封'
pro2_keywords = '侵犯.{0,10}专利|侵权|专利战|专利涉及'
print ('product_keywords loading sucessful')

proj_keywords = '项目.{0,15}(烂尾|停产|时长超|时间超|停工|审批|未果|无法|暂停|起诉|终止|调整|延迟|延误|\
完成|计提|进展|暂缓|遥遥无期|青黄不接|陷|延期|停摆|撂荒|如意|进展|违反|缓慢)|\
(暂停|退出|终止|清出|放弃|暂缓|干扰|分离|阻扰|阻挠|投入).{0,15}项目|\
计划.{0,15}(搁浅|暂停)|延迟动工'
not_proj_keywords = '一个标杆项目|提升.*项目.*合作|关注.{0,10}项目|开工.*项目|根据项目进展|等项目|缺陷.{0,15}识别|故障巡检|\
净值不达标|支持项目停摆'
proj1_keywords = '项目.{0,20}(延迟|延误|延期|停建|投资多年|暂停|停产|终止|难以启动|超|停工|未果|暂缓|停滞|停工|停售|停摆)|\
工程.{0,15}审批|(延期|停建|暂停|停产|退出|终止|放弃).{0,20}项目'
not_proj1_keywords = '暂停.{0,20}。.{0,20}项目'
proj2_keywords = '项目.{0,20}(手续|审批)|资料不齐'
proj3_keywords = '项目收益未达预期|票房惨败|过于乐观|亏损.{0,20}延续|(无法达到|未|不及)预期|难盈利|项目.{0,20}亏损'
print ('project_keywords loading sucessful')

reg_keywords = '问询|质询|过会|审核|被否|驳回|IPO.{0,30}(过会|取消|撤单|变|不足|核查|否|通过率|审核|通关|中止|终止)|\
监管|叫停|注销|暂停.{0,15}审核|审核.{0,15}暂停|否决|未.{0,30}通过|挂牌|被停|\
核准|暂缓表决|政策抑制|停发|搜查|抽查|证监|上交所|深交所|中国证券监督管理委员会|股转|深圳证券交易所|\
中小板公司|保监局|公安机关|环保局|消保委|药监局|交易所|环境保护局|检察院|罚款|罚单|处罚|被罚|受罚|罚决|罚没|\
计罚|处分|遭罚|罚逾|(现场|监督).{0,15}检查|整改.{0,15}不到位|(处罚|约谈|开始|勒令|要求|责令).{0,15}整改'
not_reg_keywords = '向.*(上交所|深交所|深圳证券交易所|上海证券交易所|证监).*(申请|提交)|(归属于|推荐).*挂牌|挂牌.*(板|公司)|\
交易所.*(上市规则|运作指引)|公司.{0,10}关注|股转系统|方案.{0,10}被否|整改.{0,10}问题|应深交所的要求|施工.*暂停|\
不按要求整改|回复深交所|敬请.{0,10}关注|交易所.*接受.*报表|IPO审核趋严|获.*证监会.*受理|避免.*审核|\
通过.*上交所.*交易系统|法院.*驳回|资质审核|证监会查证|生产.*流程|产品质量优势|未经审核|暂停键|上交所.*发行|\
登陆深交所|刑罚.{0,10}处罚|深交所.{0,10}获悉|深交所.{0,10}介绍|深圳证券交易所.{0,10}发行|公开挂牌|挂牌转让|\
经.*证监.*核准|交易所.*(发行|研究|弱点)|证监会批文|违反.*深圳证券交易所.*规定|支出.{0,15}通过审核|问题.{0,15}审核|\
以交易所通知|(跟踪|结算)审核|发现.{0,15}整改|处罚.{0,15}吸烟|未.{0,30}股东大会通过|停发.{0,30}工资|薪资停发'
reg1_keywords = '被.{0,15}罚|处罚|遭罚|重罚|罚单|罚款|罚没|受罚|罚.{0,15}(元|亿|万)|规范.{0,15}审核'
reg2_keywords = '监管.{0,15}函|(立案|全面)调查|不.{0,15}行政许可|行政监管|警示.{0,15}函|遭.{0,15}发函|被.{0,15}谴责|\
遭.{0,15}(监管|警告|问询|警示)|被.{0,15}(通报|批评|监管|警示|查)|纪律处分|关注.{0,15}函|责令(改正|整改)|要求整改|\
上交所.{0,15}采取.{0,15}措施|收.{0,15}监管(函|.{0,15}书)'
reg3_keywords = '保荐.{0,15}倒春寒|暂停.{0,15}业务|刹停.{0,15}涨价'
reg4_keywords = '取消审核|上市.{0,15}否决|申请.{0,15}驳回|IPO.{0,15}(中止|落马|过..{0,15}否|终止|被否|过会率.{0,15}新低)|\
增资.{0,15}未果|(上市|保荐|冲A).{0,15}被否|发行.{0,15}未.{0,15}通过|被否.{0,15}IPO'
reg5_keywords = '(遭|收|被|引).{0,15}(关注|问询|质询|询问)|问询函|关注函'
not_reg5_keywords = '引发舆论关注'
print ('regulate_keywords loading successful')

unf_keywords = '水|火|风|雨|电|雷|灾|事故|雪|天气|坍塌|死亡|地震|洪涝|燃|爆炸|遇难|埋|倒塌|昏迷|惊险|意外|\
矿震|闪爆|病毒|洗劫|抢劫|爆炸|瓦斯|落石|泄露'
not_unf_keywords = '山水|水泥|环保风暴|数据泄露|主管.{0,15}雷|电子|电话|水平'
print ('unforce_keywords loading successful')

oth_keywords = '关于.*培养.*考核.*通知|(业绩|利润).*增长.*增长|业绩预增|签约.*同比.*增|投资.*元.*建设|重点关注的财经数据与事件|\
'
print ('other_keywords loading successful')
app = Flask(__name__)
app.debug = True
app.config.update(RESTFUL_JSON=dict(ensure_ascii=False))
api = Api(app)

@app.route('/')
def hello_world():
    return 'hello world'

@app.route('/SVM_TextSort/', methods=['POST'])
def add_task():
    time_start=time.time()
    
    #url = request.form.get('siteDomain')
    #entitylist = request.form.get('entityList')
    #text = request.form.get('content')
    #title = request.form.get('title')
    
    url = request.json['siteDomain']    
    entitylist = request.json['entityList']
    text = request.json['content']
    title = request.json['title']
    
    content = title + text
    lable = ''
    #####不参与分类文章的关键词
    title_keywords = '企业参考价格|政策解读.*补贴.*方案|法律风险与防范|增持.*评级|促销|汇率.*表|图片新闻|\
    信用卡逾期|发起.*招标项目|食材.*名单|参考均价|意向登记|参考价格|报名|操盘必读|行情观点|上调业绩预期|超预期|\
    业绩预增|参考价格|推荐评级|优于大市评级|扭亏为盈|增持|发行与上市提示|预增|股推荐|遗失启事|新车抢鲜看|有趣的经济学|\
    停水预告|信用卡逾期|理财产品一览|公告速递|发行起始日|发行截止日|售.*元.*上市|人民币理财计划产品.*公告|一览表|\
    车.*售.*元|起付息|分类广告|分类信息|月薪.*元|问题.*解析|临时股东大会|广告|直播|补贴.*通知|公告精选|\
    现场检查全面启动|知识宣传|价格行情|业绩增长|复牌时间公告|业绩同比增长|车直降.*元|预告|利润预增|行情一览\
    汇率.*表|经营状态稳健|招标项目|宣传册|新资料一览|名单发布|价格信息|一览表|信访案件|演练|预防.*事故发生|执法监察|\
    表彰|培训|从你我做起|迁址|深交所投教|中标|稳步增长|利率.*公告|排名升至|调研报告|下调.*关税|圆满落幕|\
    Pre-A轮融资|上市公司列表|发行情况公告|上市.*公告|付息公告|盛大开班|保证金.*通知|到期日.*通知|行权日.*通知|\
    交易日.*通知|新股日历|人才集聚高地|审计报告|收费站.*启用|净利.*增|金洽会.*开幕|赴港IPO|入选.*福布斯|金条.*价格.*多少|\
    物联网.*举办|了解.*套路|创想会.*召开|.*涨停|楼.*在售|酒会.*开幕|报告.*企业市值|任.*长|权益分派实施公告|合作洽谈会|\
    选房细则|美元兑人民币汇率|关于.*培养.*考核.*通知|召开工作会议.*通知|研讨会的预通知|交易提示|限售总体情况一览|\
    报告解析|中国企业500强发布|排行榜|年度报告摘要|签署.*协议.*公告|债券.*挂牌.*公告|发行.*债|赚钱企业出炉|\
    营收超|500强排名|招股意向书摘要|保荐工作报告|赴美上市|增资协议.*公告|[互动]|人民币汇率中间价走势|债券.上市|\
    债券.*回售.*公告|转让服务.*(公告|通知)|会议决议公告|专项补贴|摩根士丹利.*看好|募集.*公告|分红公告|决议生效公告|\
    部署.*工作|融资券兑付(完成|公告)|网络问政|投资有望提速|国际软博会|督导意见|到期购回.*公告|药.*降价|担保.*实施公告|\
    现金管理.*公告|股权.*划转.*进展.*公告|日.*吸金.*亿|公告.*系列|民生.*新规|撤销.*名单.*公示|活期存款利率|法院.*打击.*拒执|\
    房企.*冲刺|财险.*出炉|取得.*核发.*公告|GSP认证公示|资产.*专项.*获批|检验.*结论.*有.*异议|募集资金|上市.*未敲定|\
    价格波动.*公告|采购.*公开.*招标公告|修订.*合同.*公告|变更.*基准.*公告|发售.*机构.*公告|赎回业务.*通知|\
    采购项目.*公示|IPO过会|博览会|债.*交易|利润.*低估|售.*穿山甲|失信.*对象公示|采购项目.*公告|\
    项目.*招标公告|招标公告|前世今生|风险提示.*公告|政策.*实施|交采暖费|拟.*上市|获.*贷款|亲情节|测评结果|IPO快报|\
    股价.*创.*新高|案件公布|挂牌出让公告|提示性公告|新增.*公告|高创会|职场报告|启动.*调查|上线.*平台|消费.*排|募.*资.*元|\
    异动统计|合作模式|房企流量|最新进展|印发|涨跌停板幅度.*调整|公告|采购通告|启动.*活动|债.*提速|开幕|寻求合作|参观访问|\
    宽带|榜单出炉|享受.*新政|公开投标|榜单公布|前景.*报告|证监会.*修.*规|火热上市|分析报告|研究报告|每股收益可增|\
    修改.*通知|评级.*资质|名单公布|评级行业|环评报告|评级资质|价格对比|销售额前.*名|下调.*利率|调查项目|网友.*留言|\
    关于.*批复|超.*倍PE发行|会.*开启|早评|发行.*CMBN|价格统计|派资本公积|最新调价|变更规则.*通知|高洽会|销量分析|\
    取得.*证书|征求.*通知|关于.*通知|享.*优惠|峰会|募集.*元|下调.*元|下降.*元|中性评级|董事会.*评述|今日.*最新.*价|\
    每周债评|评级.*上升|门票价|晨会纪要|升.*价|评级.*无|销量.*增|销量.*超|无新股发行.*上市|复牌时间|慈善|名单|\
    案例|油价.*涨|上市.*规则|一览|文化节|离婚|表彰大会|成功举办|获.*融资|停电|生效.*区别|高利贷|影讯|中超|\
    记录.*研究|首先.*要做到|缴费标准|新四板挂牌.*融资|专访|外资买卖免费分享|获注册|降杠杆|土地流拍|病毒营销|还款时间.*梳理|\
    趋势预测|规范.*通过|好评|政经谭|邀您参加|专采项目|球童招募|成功上线|网络安全|车展|成语故事|语文|股权布局|佳泽问候|\
    债.*发行|价调整消息|国务院.{0,10}关税|专题研究|定期支付表|晒榜|酒驾|品牌日|大市分析|加征关税|创业担保|战略投资|纪念币|\
    招.*岗|校园招聘|招聘.*汇总|法律依据汇总|报告.*研究|一体化赔偿|配置解读|退.*赛|跳崖|土地.*流拍|之旅|优惠专场|优惠券|\
    坚果.*新闻|炒货.*新闻|采购清单|《.*》|会员福利|秘籍|实盘.*记录|实盘.*分析|八卦|娱乐圈|品牌.*强|房企.*强|蝉联.*强|\
    小三房|(购|买).*二手车|餐厅.*账单|资产管理计划|地块项目|新增.*股|贫困户|道士|监管加码|官赖|酒吧|征求意见|荣膺|\
    通知.*整治.*乱象|喜登|盛况空前|招乘|香港上市(优势|条件|流程|费用|模式|方案|案例)|房屋征收|新增.*IPO.*申请|发行提示|\
    发行.*融资券|助力.*业务|基金净值|禁止新建|指引防洗钱|创业大赛|保持.*平稳过渡|TOP.*榜单发布|路.*问题.*回复|\
    位列.*首位|环境.*督查.*调度表|财务咨询.*靠谱|特佳.*榜|更名.*批复|任职.*批复|售.*理财产品|助残卡|治污方案|组合贷款担保|\
    净值更新|假期.*安排|政策.*问题.*解答|收入.*模式.*详解|申请IPO|同比增长|上市公司.*强|商务部.*倾销|整治.*乱象|融资担保基金|\
    银行业面临.*压力|财务审核要点|公司.*股权转让.*问题|案例分析|策略.*全解析|月.*新规|推.*支付方式|办理.*号码业务|停水通知|\
    项目获预售证|计息新规|视频监控.*覆盖|开发商推盘|趋于行业领先水平|物联网.*兴起|讲物联网|了解.*光储|质押.*解析|增资潮|\
    过会.*登陆.*股|大气治理方案|得.*奖|强制退市.{0,10}制度|推荐给您|车辆款型.*贷款购车.*车辆颜色.*车辆排量|上市公司董事长大起底|\
    发挥担保.{0,20}作用|增长转型|推.*支付方式|企业.*强|结算方式.*调整|国标.*获批|网购.*额.*亿.*交易份额|新能源政策|货车通检|\
    使用.*注意事项|银行监管指标压力|电影票房|民企杠杆|环保令.*关停|信托计划|修改.*法规.*决定|月.*日.*报价|宣传片.*出品|\
    资产评估说明|大气.*方案发布|(季|年)报预喜|业绩.*翻番|门票购买攻略|门票.*购票|演出安排|演唱会|公路工程|年.*月.*投资策略|\
    公开招标|分期提前还款|采购项目|社科院报告|预计.*经济增长|手机.*占.*份额|增速放缓|看待未来一年|法律误区|签署.*共享协议|\
    法律风险有哪些|风险治理框架|公安部.*限制.*购票|关于.*框架结构|对.*模块.*分析|关于.*物联网|出口化肥|土地成交明细|\
    租房找房|二手买卖|生活信息|企业.*成为.*重要力量|新增.*独角兽|胡润.*百富榜|金融风险防范|走红华尔街|募资额超|助小微|\
    企业.*发展纪实|赢得好口碑|涨.*元.*涨价|上调.*待遇|关于.*承诺函|发行股份.*核查意见|IPO.*热情渐退|农机抢收|个省.*建设.*完成|\
    方案.*披露对照表|投教下午茶|可行性报告|考.*知识点|发.*可换股债|种业务模式|高院新规|逾期.*赖账.*后果|欠钱.*财产.*不.*起诉|\
    借款人.*支付.*利息.*银行.*复利|最高院|最高法院|银行.*首推.*支付|审计.*重点.*关注.*事项|工程项目审计结果|月.*日.*采购价格|\
    电影.*市场.*格局|平台上线|月.*日.*价格政策|持续督导现场检查报告|基建信托|月.*日.*价格播报|月.*日.*现货价格|重登.*首富|\
    标准.*由.*编制|地方.*债.*方案.*制定|荣耀.*揭榜|配股提示|激励计划.*摘要|获.*正式.*牌照|系列资管|收购价格.*上涨|抽检.*全部\
    .*合格|上调.*业绩|地方.*债.*制定|打响.*地方债|群猜谜|环境信息.*披露.*质量.*提升|债.*成立.*募.*规模|产品推介|\
    经济.*效益.*增长|套取.*公积金.*纳.*征信|企业.*免征.*税|救市|发展趋势预测报告|创业创新项目揭晓|扶持.*优秀.*项目|\
    两部委.*明确.*房产税|财政部.*去产能|推进去产能|税收优惠政策|胡润.*企业家榜|商标转让.*税|会计准则.*第.*号|法律适用解析|\
    并购.*流程|全程指引|市场化债转股|并购.*趋势.*机遇|论坛.*举行|喜获核准|设备.*效果好|影视资讯大放送|价格上涨.*元.*吨|\
    提振市场信心|首富六连冠|抽检.*全部合格|样品.*全部合格|财务宝典系列|构建.*学习.*体系|地块.*拍卖|盈利同比增|上市首日.*涨|\
    企业喜讯|获.*奖|解读理财新规|强监管.*助手|签署.*备忘录|训练营.*召集|物业.*晋级|分红派息备忘|深交所.*发挥.*优势|\
    深交所.*助力.*合作|业绩改善|汇率.*行情|技术研讨会| 打响.*突围战|在线.*领跑|销量.*上升|国企.*落实.*规定.*短板|\
    国.*银行.*业务.*达|网.*传.*消息失实|板块.*跌.*高.*性价比.*区间|存款保险|支行开业|注入.*优质资产|回应.*正常|\
    产能.*阶段.*投产|自驾.*最合适|黑科技.*位|专题系列一|公司.*招聘|打造.*强市|获预售证|迎拐点|助力.*发展|\
    研究.*监管.*措施|基金获批|人民检察院.*起.*诉.*书|信用.*修复|洗白征信|房企.*销售额.*高达|发行.*股.*上市|股事闲话|\
    银保渠道.*备战|史记.*传|汇率.*报.*元|税率.*调整.*影响|男子.*欠.*款|男子.*借.*不.*还|股票.*行情.*建议|文艺沙龙|\
    地方债.*发行|强化管控|加大信贷助发展|月.*日.*价格|探索.*风口|成.*领头羊|市场.*领头羊|金融.*数据.*维稳|考试.*曝光|\
    银行.*服务升级|推荐报告|优势.*股.*资料|银行.*成功.*开户|农村部.*加强.*监管|地块.*成交|月.*日.*价|财政收入.*高.*增速|\
    持续高增长|银行.*利率|股价拉升|补贴.*条件.*出炉|利率.*月.*日|\d强势股|提供法律服务|一行.*调研|分级基金风险提示|\
    一行莅临|财政部.*地方债|财政部.*地方政府债|锌.*增加.*锌价|Windows.*功能.*更新|财政部.*地方政府专项债|赛季.*赢家|\
    保障.*支付安全|奖励.*优秀|政府.*借.*外债|国际马拉松|增强.*信心|专家剖析|油价.*调|融.*战略|美媒.*失实|\
    北京中介协会.*展开调查|新股上市提示|修复.*冻结|最高优惠|Office|WPS|成稳盘主力|未来房价|月.*日.*成交量|执行新航季|\
    召开.*会议|信用卡分期|法.*修正.*提交.*审议|中基协.*加强.*监管|过会率.*回升|制售假.*最高罚|法.*修正|登陆创业板|\
    出台新政打击囤地|网签率.*楼市降温|营收.*同比增长|月.*日.*收购价|投资.*赚.*倍|树折断.*砸坏.*车.*物业|\
    双轨.*交.*万起|完成发行缴款|租房.*整治.*成效.*显|缓和市场情绪|政策.*出|出席.*论坛|争取.*国家.*资金|\
    环保行业：.*确认|女.*额.*超.*男|实现.*净利.*成效.*显|停止社招|杰出.*企业家|招聘|新股数量.*新高|融资额.*新高|\
    房地产.*注意环保|政府.*击破.*担保|实施.*降费|实施.*奖补|证监.*礼|寒冬报春|摄像头.*竞赛升级|\
    品种.*入选.*目录|知识产权.*质押.*贷款|保秋冬.*蓝天白云|评委.*曝光|月.*合约|两市.*融资.*余额|交易.*说明|\
    差异.*对比表|回应国资驰援|事项.*独立意见|内在价值？|净利.*(亿|万).*受益|政策底.*领先.*市场底|主业.*稳健|管理库.*投资额|\
    扶持项目公示|员工学习|电商.*诚信经营|纾困民企|设.*基金.*民企|交易所.*补偿|从.*报.*看.*周期|价格.*年.*月.*日|\
    加入.*危机.*救火队|H股.*回A|券商.*计划.*实操|美剧推荐|财政部.*检查.*公布|订单.*超|券商.*计提.*规矩|年度.*临时.*报告|\
    延伸.*转型|增速.*持续.*改善利润.*增长|政府债务|提升.*项目.*进展.*顺利|额.*增长.*财务.*稳健|考察.*指导|月.*赚.*倍|\
    拟.*派.*元|品牌.*大.*排名|支付.*区别|看好.*公司.*价值|看好.*公司.*长期|更新招股书|每吨价格|辟谣.*没有收到|\
    线路.*充满.*黑科技|装修笔记|盈利.*(亿|元).*增|现金流.*更.*畅|派.*元.*登记|财政部.*发债.*超|增值税.*效果|\
    图看清.*上市.*过程|二手房.*评估.*费|银行.*抽贷.*症结.*何在|银行.*断贷.*症结.*何在|引入.*问题.*研究'
    #not_title_keywords = '拉.*涨停'
    con_keywords = '评级.*买入|买入.*评级|评级.*增持|增持.*评级|债券.*在本所挂牌|代码.*简称.*实施日期.*增发价|公告速递\
    |董秘需知|监察.*重点工作安排|促销活动|迁址|产品名称.*发行机构.*发行时间|深交所投教|专项计划.*发行规模|房企.*进驻|\
    (予|维持).*(推荐|买入|增持)|递交招股书|持有评级|互动平台上询问|公司.*业绩.*产生积极|博览会.*举办|推荐.*评级|\
    重申.*买入|开幕|发布.*公告|农村金融时报|网民留言|公告基本信息|深圳证券交易所.{0,10}年.*月.*日|片详情介绍|致力.*公开课|\
    病毒营销|安全宣传|酒驾|大市分析|优于大市.*评级|招聘汇总|法律依据汇总|免费获取资源|看看电影|行程特色|享.{0,10}充值优惠|\
    导演.*编剧.*主演|资讯一手掌握|当日成交明细|当日成交汇总|当日成交思路|创新大会|招聘结果|招聘活动|网红|小三房|假道士|\
    印发.{0,15}提出|公职人员|公开征求意见|天然气.*价格.*政策.*调整|招聘要求|客户满意度指数.{0,15}出炉|召开.{0,15}临时股东大会\
    .*债权登记日.*权益登记日|宣传.*活动.*铺开|担保基金成立|铁腕治|股转.*发布.{0,20}通知|发布.{0,20}意见.{0,10}决定|\
    与.{0,20}讨论.{0,20}问题|个税.{0,15}新规.{0,15}实施|一周楼市回顾|地点.*国债期限.*票面利率.*国债全称|股吧.*股吧.*股吧.*股吧.*股吧|\
    发布.*通知.*指出|定价.*集资.*挂牌|假期.*工作.*安排.*通知|每百元面值利息.*每百元面值利息.*每百元面值利息.*每百元面值利息|\
    公告.*公告.*公告.*公告.*公告.*公告.*公告|投诉编号.*投诉时间.*投诉品牌.*投诉内容|公告速览|造假.*案例分析|信托计划.*资金用途\
    .*还款来源|00.*00.*00.*00.*00.*00.*00.*00.*00.*00|资管规模.*预期收益.*资金用途|科技大会.{0,15}召开|个股利好：|上榜.*强|\
    国家风险.*上升.*表现.*方面|证监会.*上市.*扶贫|公司经营一切正常|经营状况良好|胡润.*企业家榜.*出炉|注重.*追求生活.*品质|\
    票.*拿.*问题.*私信|培训目的.*培训对象.*培训时间|分红派息提示.*分红派息提示.*分红派息提示|双十一.*公司.*备战|\
    优秀.*评选.*小组.*公示|案例.*案例.*案例|博览会.*好消息|产销.*符合预期.*增长强劲|申请.{0,15}上市|上交所.*研究.*监管.*措施|\
    牌照.*批准.*加快|发行.*公司债.*票面利率|发布.*胡润房.*企业.*榜|中国人民银行发布金融数据|引进人才住房.{0,15}通知|\
    迎.*利好.*消息|企业.*资金问题.*财政政策|招股说明书.{0,15}显示|会议.*法.*院.*主席.*公布|\
    证券业协会.*举办.*培训会|称.*报道严重失实'
    url_keywords = 'guba|question|Question'
    
    #title = '2017证券从业《金融市场基础》知识：基金与股票'
    #url = 'http%3A%2F%2Firm.cninfo.com.cn%2Fircs%2Finteraction%2FviewQuestionForSzse.do%3FquestionId%3D6126764'
    not_tit = re.search(title_keywords,title)
    #not2_tit = re.search(not_title_keywords,title)
    not_con = re.search(con_keywords,content)
    not_url = re.search(url_keywords,url)
    
    ####判断是否属于研报
    research_report_TK = '.*证券--.*行业研究|(予|维持|花旗|对).*(评级|目标价)|证券.*(：|:)|投资评级|\
    (降|升|下调|调高|调低).*目标价|策略.*看好'
    not_research_report_TK = '证券从业《金融市场基础》知识：|证券.*(：|:).*净偿还累计'
    RRTK = re.search(research_report_TK,title)
    not_RRTK = re.search(not_research_report_TK,title)
    if RRTK and not not_RRTK:
        lable = '研报'
    '''
    #####判断是否属于公告
    announcement_TK = '(花园|厕所|车|房屋|住房|水库|节能|采购|政务|农路|采购|整治|道路|评审|获奖|设施|燃气|\
    学院|校区|节能|应用|旅游|改造|宅|工程|风景.*提示|下达.*资金|业务外包|提升|服务|房地产|保养|消防|\
    清洁|扶贫|迁址|管网|国网|发电|建设|评审|承包|改造|教学楼).*项目|\
    (专项|图书|设备|电缆|展示架).*采购|\
    (公路|灯|拆除|车间|弱电|用电|提标|环路|道路|供电|箱变|地下水|电.*站重建|提升|维修|翻修|服务|配电|改造|市政|\
    道路|驳岸|专变).*工程|\
    (招标|中标|采购|征求意见|评审|获奖|调整|项目|上市公司).*(公告|公示)|\
    文化.*研讨会|安全.*背熟|验收意见|专项规划|节能.*审查|\
    (提醒|旅游|涉水|关注).*安全|\
    (防范|提示|提醒).*风险|\
    (项目|工程|公开).*招标|\
    转让服务|采购及安装|故障诊断.*平台|沪深公告摘要|托管协议|基金合同|工作情况通报|发布.*通告|\
    职称.*一览表|审批通过.*名单|设备.*对标|授权证书|片区.*整理|关于.*对标|关于.*改正.*决定|\
    有奖竞答|安全.*监管.*计划表|学术会议|发表.*评论|处罚信息公开|信息公开表|发表.*评论|招聘.*简章|执法抽查结果|\
    采购.*中标|关于.*批复函|\
    沪深公告摘要|\
    公布.*通知'
    
    ATK = re.search(announcement_TK,title)
    if ATK:
        if lable == '':
            lable = '公告'
        else:
            lable = lable +','+ '公告'
            
    ####判断是否属于二级市场专项
    market_TK = '(成交金额|涨跌幅|流通市值|换手率)排行榜|交易提示|交易信息提示|价格行情|操作建议|\
    分布情况|暴力拉升.*涨幅|单日报表|注销仓单|库存(统计|变动)|股市午评|大盘收评|(交割|仓单).*日报|单日报表|\
    前.*名|盘中直击|盘后点评|股市收评|价格行情|收评|机构调研|午间看盘|独家资金|(股市|大盘)早评|机构策略|净值增长率|\
    早评|检验量报告|行情整理|(单|净)流入流出|生意社.*月.*日|盘面追踪|保证金调整|(收盘|官方)月均价|千股千评|结算月平均|\
    (个股|行情|振幅|跌幅|资金流向|排名|统计|涨幅|公司|解禁|金额|流向|成交(量|笔)|增长率|回购|调整|价格|利息额|增长率|\
    前.*名|信息|交易情况)一览|\
    公司公告|(股市|申购).*消息|年度我国|大宗交易信息|美国.*月|中钢协.*月|行情早报|股市早评|(午|晚)间公告|\
    (发行|特别|配股|新股|分红|公告|扩募|事项|实施|上市|信息|停牌|派息)提示|\
    单产预估|收盘(行情|报价)|涨跌幅超过|中签结果|机构论市|仓单日报|\
    '
    MTK = re.search(market_TK,title)
    if MTK:
        if lable =='':
            lable = '二级市场专项'
        else:
            lable = lable +','+'二级市场专项'
    '''
    
    print ('svm data receive successful')
    #pattern = ['\d{4}/\d{1,2}/\d{1,2}\s+\d{1,2}:\d{1,2}','\d{4}-\d{1,2}-\d{1,2}\s+\d{1,2}:\d{1,2}:\d{1,2}']
    #for i in pattern:
        #content = re.sub(i,'',content)
    word_cut = jieba.lcut(content.strip(), cut_all = False)
    news1 = []
    news1.append(' '.join(word_cut))
    '''
    print ('====onesvm judge====')
    vec_testone = onevec.transform(news1)        
    tf_testone = onetransformer.transform(vec_testone)
    yone = oneclf.predict(tf_testone)
    if yone[0] == 1 and '二级市场专项' not in lable:
        if lable =='':
            lable = '二级市场专项'
        else:
            lable = lable +','+'二级市场专项'
    '''
    print ('===IF judge====')
    vec_testif = IFvec.transform(news1)
    tf_testif = IFtransformer.transform(vec_testif)
    ch2_testif = IFch2.transform(tf_testif)
    yif = IFclf.predict(ch2_testif)
    print ('svm model judge successful')
    if yif[0] == 0:
        key = re.search(keywords,title)
        if key:
            if lable == '':
                lable =  '互联网金融'
            else:
                lable =  lable +','+ '互联网金融'
    else:
        if lable == '':
            lable =  '互联网金融'
        else:
            lable =  lable +','+ '互联网金融'
            
    print ('====im IF rules====')
    #######文本分类(区分正负面)
    if not_con or not_url or not_tit or len(content) < 120:
        
        if not_con:
            print (not_con.group())
        elif not_url:
            print (not_url.group())
        elif not_tit:
            print (not_tit.group())
        else:
            print (len(content))
        
        print ('dont svm')
    else:
        ######judge entity
        if len(entitylist) != 0:
            print ('entityList exist')
            #####judge posorneg
            vec_testpn1 = pn1vec.transform(news1)
            tf_testpn1 = pn1transformer.transform(vec_testpn1)
            ch2_testpn1 = pn1ch2.transform(tf_testpn1)
            ypn1 = pn1clf.predict(ch2_testpn1)
            if ypn1[0] == 1:
                if lable == '':
                    lable =  '负面'
                else:
                    lable = lable +','+ '负面'
            vec_testpn = pnvec.transform(news1)
            tf_testpn = pntransformer.transform(vec_testpn)
            ch2_testpn = pnch2.transform(tf_testpn)
            ypn = pnclf.predict(ch2_testpn)
            if ypn[0] == 1:
                print ('====admin judge====') 
                vec_testad = advec.transform(news1)
                tf_testad = adtransformer.transform(vec_testad)
                ch2_testad = adch2.transform(tf_testad)
                yad = adclf.predict(ch2_testad)
                ad_key = re.search(ad_keywords,content)
                not_ad_key = re.search(not_ad_keywords,content)
                if yad[0] == 1 and ad_key and not not_ad_key:
                    if lable == '':
                        lable =  '高管股东类预警'  
                    else:
                        lable = lable +','+ '高管股东类预警'
                    ad_flag = True
                    ad1_key = re.search(ad1_keywords,content)
                    ad2_key = re.search(ad2_keywords,content)
                    not_ad2_key = re.search(not_ad2_keywords,content)
                    ad3_key = re.search(ad3_keywords,content)
                    not_ad3_key = re.search(not_ad3_keywords,content)
                    ad4_key = re.search(ad4_keywords,content)
                    not_ad4_key = re.search(not_ad4_keywords,content)
                    ad5_key = re.search(ad5_keywords,content)
                    not_ad5_key = re.search(not_ad5_keywords,content)
                    if ad1_key:
                        lable = lable + ','+'高管股东企业接班人问题'
                        ad_flag = False
                    if ad2_key and not not_ad2_key:
                        lable = lable +',' + '高管涉及违法违规'
                        ad_flag = False
                    if ad3_key and not not_ad3_key:
                        lable = lable + ',' + '高管出现重大变动'
                        ad_flag = False
                    if ad4_key and not not_ad4_key:
                        lable = lable + ',' + '高管股东之间出现矛盾'
                        ad_flag = False
                    if ad5_key:
                        lable = lable + ',' + '与员工之间的问题' 
                        ad_flag = False
                    if ad_flag and not not_ad5_key:
                        lable = lable + ',' + '高管其它类' 
                print ('====im admin rules====')
                
                print ('====assure judge====')
                vec_testas = asvec.transform(news1)
                tf_testas = astransformer.transform(vec_testas)
                ch2_testas = asch2.transform(tf_testas)
                yas = asclf.predict(ch2_testas)
                ass_ = re.search(ass_keywords,content)
                not_ass = re.search(not_ass_keywords,content)
                if yas[0] ==1 and ass_ and not not_ass:
                    if lable == '':
                        lable =  '担保类预警'
                    else:
                        lable = lable +','+ '担保类预警'
                    ass_flag = True
                    ass1_key = re.search(ass1_keywords,content)
                    ass2_key = re.search(ass2_keywords,content)
                    not_ass1_key = re.search(not_ass1_keywords,content)
                    if ass1_key and not not_ass1_key:
                        lable = lable +','+'违规担保或担保一方出现问题'
                        ass_flag = False
                    if ass2_key:
                        lable = lable + ',' + '对外担保过多'
                        ass_flag = False
                    if ass_flag:
                        lable = lable + ',' + '担保其它类'
                print ('====im assre rules====')
                
                print ('====credit judge====')     
                vec_testcre = crevec.transform(news1)
                tf_testcre = cretransformer.transform(vec_testcre)
                ch2_testcre = crech2.transform(tf_testcre)
                ycre = creclf.predict(ch2_testcre)
                cre_key = re.search(credit_keywords,content)
                not_cre_key = re.search(not_credit_keywords,content)
                if ycre[0] == 1 and cre_key and not not_cre_key:
                    if lable == '':
                        lable =  '信用类预警'
                    else:
                        lable = lable +','+ '信用类预警'
                    cre_flag = True
                    cre1_key = re.search(cre1_keywords,content)
                    not_cre1_key = re.search(not_cre1_keywords,content)
                    cre2_key = re.search(cre2_keywords,content)
                    not_cre2_key = re.search(not_cre2_keywords,content)
                    cre3_key = re.search(cre3_keywords,content)
                    not_cre3_key = re.search(not_cre3_keywords,content)
                    cre4_key = re.search(cre4_keywords,content)
                    not_cre4_key = re.search(not_cre4_keywords,content)
                    cre5_key = re.search(cre5_keywords,content)
                    not_cre5_key = re.search(not_cre5_keywords,content)
                    cre6_key = re.search(cre6_keywords,content)
                    not_cre6_key = re.search(not_cre6_keywords,content)
                    if cre1_key and not not_cre1_key:
                        lable = lable + ',' + '相关人士或企业失信'
                        cre_flag = False
                    if cre2_key and not not_cre2_key:
                        lable = lable + ',' + '挪用或占用资金'
                        cre_flag = False
                    if cre3_key and not not_cre3_key:
                        lable = lable + ',' + '评级关注下调或列入负面或观察或推迟评级'
                        cre_flag = False
                    if cre4_key and not not_cre4_key:
                        lable = lable + ',' + '欺诈或虚假宣传或造假'
                        cre_flag = False
                    if cre5_key and not not_cre5_key:
                        lable = lable + ',' + '企业失联列入经营异常或负债过高'
                        cre_flag = False
                    if cre6_key and not not_cre6_key:
                        lable = lable + ',' + '企业相关人士或本身违约或信贷逾期'
                        cre_flag = False
                    if cre_flag:
                        lable = lable + ',' + '信用其它类'
                    
                print ('====im credit rules====')
                
                print ('======== finance judge====')  
                vec_testfin = finvec.transform(news1)
                tf_testfin = fintransformer.transform(vec_testfin)
                ch2_testfin = finch2.transform(tf_testfin)
                yfin = finclf.predict(ch2_testfin)
                
                fin_ = re.search(fin_keywords,content)
                not_fin = re.search(not_fin_keywords,content)
                not_fin1 = re.search(not_fin_keywords1,content)
                not_fin2 = re.search(not_fin_keywords2,content)
                if yfin[0] == 1 and fin_ and not not_fin:
                    if not_fin1:
                        if not_fin2:
                            if lable == '':
                                lable =  '财务类预警'
                            else:
                                lable = lable +','+ '财务类预警'
                            fin_flag = True
                            fin1_key = re.search(fin1_keywords,content)
                            fin2_key = re.search(fin2_keywords,content)
                            fin3_key = re.search(fin3_keywords,content)
                            fin4_key = re.search(fin4_keywords,content)
                            fin5_key = re.search(fin5_keywords,content)
                            not_fin3_key = re.search(not_fin3_keywords,content)
                            if fin1_key:
                                lable = lable + ',' + '财务造假'
                                fin_flag = False
                            if fin2_key:
                                lable = lable + ',' + '发生亏损或财务指标下降'
                                fin_flag = False
                            if fin3_key and not not_fin3_key:
                                lable = lable + ',' + '会计所问题'
                                fin_flag = False
                            if fin4_key:
                                lable = lable + ',' + '资不抵债或负债高'
                                fin_flag = False
                            if fin5_key:
                                lable = lable + ',' + '资金不足或来源不明'
                                fin_flag = False
                            if fin_flag:
                                lable = lable + ',' + '财务其它类'    
                    else:
                        if lable == '':
                            lable =  '财务类预警'
                        else:
                            lable = lable +','+ '财务类预警'
                        fin_flag = True
                        fin1_key = re.search(fin1_keywords,content)
                        fin2_key = re.search(fin2_keywords,content)
                        fin3_key = re.search(fin3_keywords,content)
                        fin4_key = re.search(fin4_keywords,content)
                        fin5_key = re.search(fin5_keywords,content)
                        not_fin2_key = re.search(not_fin2_keywords,content)
                        if fin1_key:
                            lable = lable + ',' + '财务造假'
                            fin_flag = False
                        if fin2_key and not not_fin2_key:
                            lable = lable + ',' + '发生亏损或财务指标下降'
                            fin_flag = False
                        if fin3_key:
                            lable = lable + ',' + '会计所问题'
                            fin_flag = False
                        if fin4_key:
                            lable = lable + ',' + '资不抵债或负债高'
                            fin_flag = False
                        if fin5_key:
                            lable = lable + ',' + '资金不足或来源不明'
                            fin_flag = False
                        if fin_flag:
                            lable = lable + ',' + '财务其它类'
                    
                print ('====im finance rules====')        
                        
                print ('======== manage judge====')       
                vec_testman = manvec.transform(news1)
                tf_testman = mantransformer.transform(vec_testman)
                ch2_testman = manch2.transform(tf_testman)
                yman = manclf.predict(ch2_testman)
                man_ = re.search(manage_keywords,content)
                not_man = re.search(not_man_keywords,content)
                if yman[0] == 1 and man_ and not not_man:
                    if lable == '':
                        lable =  '经营管理类预警'
                    else:
                        lable = lable +','+ '经营管理类预警'
                    man_flag = True
                    man1_key = re.search(man1_keywords,content)
                    man2_key = re.search(man2_keywords,content)
                    man3_key = re.search(man3_keywords,content)
                    man4_key = re.search(man4_keywords,content)
                    man5_key = re.search(man5_keywords,content)
                    man6_key = re.search(man6_keywords,content)
                    man7_key = re.search(man7_keywords,content)
                    man8_key = re.search(man8_keywords,content)
                    man9_key = re.search(man9_keywords,content)
                    man10_key = re.search(man10_keywords,content)
                    man11_key = re.search(man11_keywords,content)
                    man12_key = re.search(man12_keywords,content)
                    man13_key = re.search(man13_keywords,content)
                    man14_key = re.search(man14_keywords,content)
                    man15_key = re.search(man15_keywords,content)
                    not_man1_key = re.search(not_man1_keywords,content)
                    not_man3_key = re.search(not_man3_keywords,content)
                    not_man5_key = re.search(not_man5_keywords,content)
                    not_man8_key = re.search(not_man8_keywords,content)
                    not_man10_key = re.search(not_man10_keywords,content)
                    if man1_key and not not_man1_key:
                        lable = lable + ',' + '减资或合并或重组或破产等'
                        man_flag = False
                    if man2_key:
                        lable = lable + ',' + '与合作方的问题或环保问题'
                        man_flag = False
                    if man3_key and not not_man3_key:
                        lable = lable + ',' + '主业不突出或盲目扩张或资金或生产问题'
                        man_flag = False
                    if man4_key:
                        lable = lable + ',' + '对外借款过多'
                        man_flag = False
                    if man5_key and not not_man5_key:
                        lable = lable + ',' + '出售变卖公司主营资产'
                        man_flag = False
                    if man6_key:
                        lable = lable + ',' + '资产转让或重组与资产查封或扣押冻结问题'
                        man_flag = False
                    if man7_key:
                        lable = lable + ',' + '市场份额或竞争力或收入净利下降'
                        man_flag = False
                    if man8_key and not not_man8_key:
                        lable = lable + ',' + '发生亏损或投资决策失误'
                        man_flag = False
                    if man9_key:
                        lable = lable + ',' + '生产事故或停产'
                        man_flag = False
                    if man10_key and not not_man10_key:
                        lable = lable + ',' + '经营活动或环境发生变化'
                        man_flag = False
                    if man11_key:
                        lable = lable + ',' + '融资失败或取消'
                        man_flag = False
                    if man12_key:
                        lable = lable + ',' + '资产转让或重组有关问题'
                        man_flag = False
                    if man13_key:
                        lable = lable + ',' + '资金周转困难'
                        man_flag = False
                    if man14_key:
                        lable = lable + ',' + '资金回收风险'
                        man_flag = False
                    if man15_key:
                        lable = lable + ',' + '法律或司法相关问题或经济纠纷'
                        man_flag = False
                    if man_flag:
                        lable = lable + ',' + '经营管理其它类'
                print ('====im manage rules====')
                
                print ('======== market judge====')       
                vec_testmar = marvec.transform(news1)
                tf_testmar = martransformer.transform(vec_testmar)
                ch2_testmar = march2.transform(tf_testmar)
                ymar = marclf.predict(ch2_testmar)
                not_mar = re.search(not_mar_keywords,content)
                mar_ = re.search(mar_keywords,content)
                if ymar[0] == 1 and mar_ and not not_mar:
                    if lable == '':
                        lable =  '市场类预警'
                    else:
                        lable = lable +','+ '市场类预警'
                    
                    mar_flag = True
                    mar1_key = re.search(mar1_keywords,content)
                    mar2_key = re.search(mar2_keywords,content)
                    mar3_key = re.search(mar3_keywords,content)
                    mar4_key = re.search(mar4_keywords,content)
                    mar5_key = re.search(mar5_keywords,content)
                    not_mar3_key = re.search(not_mar3_keywords,content)
                    not_mar4_key = re.search(not_mar4_keywords,content)
                    not_mar5_key = re.search(not_mar5_keywords,content)
                    if mar1_key:
                        lable = lable + ',' + '股份资产转让或减持或减少'
                        mar_flag = False
                    if mar2_key:
                        lable = lable + ',' + '股权质押或冻结或爆仓'
                        mar_flag = False
                    if mar3_key and not not_mar3_key:
                        lable = lable + ',' + '暂停交易或上市发行或面临风险警示'
                        mar_flag = False
                    if mar4_key and not not_mar4_key:
                        lable = lable + ',' + '证券价格异常波动'
                        mar_flag = False
                    if mar5_key and not not_mar5_key:
                        lable = lable + ',' + '做空股价报告(包括但不限于券商报告)'
                        mar_flag = False
                    if mar_flag:
                        lable = lable + ',' + '市场其它类'
                    
                print ('====im market rules====')
                
                print ('======== product judge====')
                vec_testpro = provec.transform(news1)
                tf_testpro = protransformer.transform(vec_testpro)
                ch2_testpro = proch2.transform(tf_testpro)
                ypro = proclf.predict(ch2_testpro)
                pro_ = re.search(pro_keywords,content)
                not_pro = re.search(not_pro_keywords,content)
                print ('产品：'+ str(ypro[0]))
                if ypro[0] == 1 and pro_ and not not_pro:
                    if lable == '':
                        lable =  '产品类预警'
                    else:
                        lable = lable +','+ '产品类预警'
                    
                    pro_flag = True
                    pro1_key = re.search(pro1_keywords,content)
                    pro2_key = re.search(pro2_keywords,content)
                    if pro1_key:
                        lable = lable + ',' + '产品设计或生产缺陷或属于淘汰类'
                        pro_flag = False
                    if pro2_key:
                        lable = lable + ',' + '产品侵权'
                        pro_flag = False
                    if pro_flag:
                        lable = lable + ',' + '产品其它类'
                    
                print ('====im product rules====')
                
                print ('======== project judge====')
                #vec_testproj = projvec.transform(news1)
                #tf_testproj = projtransformer.transform(vec_testproj)
                #ch2_testproj = projch2.transform(tf_testproj)
                #yproj = projclf.predict(ch2_testproj)
                proj_ = re.search(proj_keywords,content)
                not_proj = re.search(not_proj_keywords,content)
                if proj_ and not not_proj:
                    if lable == '':
                        lable =  '项目类预警'
                    else:
                        lable = lable +','+ '项目类预警'
                    
                    proj_flag = True
                    proj1_key = re.search(proj1_keywords,content)
                    proj2_key = re.search(proj2_keywords,content)
                    proj3_key = re.search(proj3_keywords,content)
                    not_proj1_key = re.search(not_proj1_keywords,content)
                    if proj1_key and not not_proj1_key:
                        lable = lable + ',' + '项目出现停建、延期'
                        proj_flag = False
                    if proj2_key:
                        lable = lable + ',' + '项目审批手续不完备'
                        proj_flag = False
                    if proj3_key:
                        lable = lable + ',' + '项目投产后产能与预期存在差距'
                        proj_flag = False
                    if proj_flag:
                        lable = lable + ',' + '项目其它类'
                    
                print ('====im project rules====')
                
                print ('======== regulate judge====')       
                vec_testreg = regvec.transform(news1)
                tf_testreg = regtransformer.transform(vec_testreg)
                ch2_testreg = regch2.transform(tf_testreg)
                yreg = regclf.predict(ch2_testreg)
                reg_ = re.search(reg_keywords,content)
                not_reg = re.search(not_reg_keywords,content)
                if yreg[0] == 1 and reg_ and not not_reg:
                    if lable == '':
                        lable =  '监管类预警'
                    else:
                        lable = lable +','+ '监管类预警'
                    
                    reg_flag = True
                    reg1_key = re.search(reg1_keywords,content)
                    reg2_key = re.search(reg2_keywords,content)
                    reg3_key = re.search(reg3_keywords,content)
                    reg4_key = re.search(reg4_keywords,content)
                    reg5_key = re.search(reg5_keywords,content)
                    not_reg5_key = re.search(not_reg5_keywords,content)
                    if reg1_key:
                        lable = lable + ',' + '行政处罚'
                        reg_flag = False
                    if reg2_key:
                        lable = lable + ',' + '监管措施'
                        reg_flag = False
                    if reg3_key:
                        lable = lable + ',' + '监管机构对某类业务采取更为严格的管理措施'
                        reg_flag = False
                    if reg4_key:
                        lable = lable + ',' + '审批不通过或监管叫停'
                        reg_flag = False
                    if reg5_key and not not_reg5_key:
                        lable = lable + ',' + '问询或关注'
                        reg_flag = False
                    if reg_flag:
                        lable = lable + ',' + '监管其它类'
                    
                print ('====im regulate rules====')
                
                print ('======== unforce judge====')   
                vec_testunf = unfvec.transform(news1)
                tf_testunf = unftransformer.transform(vec_testunf)
                ch2_testunf = unfch2.transform(tf_testunf)
                yunf = unfclf.predict(ch2_testunf)
                unf_ = re.search(unf_keywords,content)
                not_unf = re.search(not_unf_keywords,content)
                if yunf[0] == 1 and unf_ and not not_unf:
                    if lable == '':
                        lable =  '不可抗力类预警'
                    else:
                        lable = lable +','+ '不可抗力类预警'
                print ('====im unforce rules====')
                
                print ('======== other judge====')
                #vec_testoth = othvec.transform(news1)
                #tf_testoth = othtransformer.transform(vec_testoth)
                #ch2_testoth = othch2.transform(tf_testoth)
                #yoth = othclf.predict(ch2_testoth)       
                #if yoth[0] == 1:
                not_oth = re.search(oth_keywords,content)
                if lable == '' and not not_oth:
                    lable =  '其它类预警'
                #else:
                    #lable = lable +','+ '其它类预警'
                print ('====im other rules====')
    
    rt = {'SVM_TextSort':lable}
    print ('svm change json successful')
    time_end=time.time()
    print ('svm totally cost',time_end-time_start)
    print (rt)
    return json.dumps(rt)


@app.route('/SVM_ShortText/', methods=['POST'])
def SVM_ShortText():
    time_start=time.time()
    
    #url = request.form.get('siteDomain')
    #text = request.form.get('content')
    #title = request.form.get('title')
    
    #url = request.json['siteDomain']    
    text = request.json['content']
    #title = request.json['title']
    
    lable = ''
    neg_word = ''
    content = text
    neg1_text = re.search(neg1,content)
    
    neg2_text = re.search(neg2,content)
    if neg1_text:
        no_neg1_text = re.search('('+no+').{0,5}'+neg1_text.group(),content)
        if not no_neg1_text:
            lable = '-1'
            neg_word = neg1_text.group()
    if neg2_text:
        no_neg2_text = re.search('('+no+').{0,5}'+neg2_text.group(),content)
        if not no_neg2_text:
            lable = '-2'
            neg_word = neg2_text.group()
    if lable == '':
        lable = '0'
    
    rt = {'SVM_ShortText':lable,'neg_word':neg_word}
    print ('svm change json successful')
    time_end=time.time()
    print ('svm totally cost',time_end-time_start)
    print (rt)
    return json.dumps(rt)


if __name__ == '__main__':
    app.run(host = '0.0.0.0')
    
    

